[{"app":"Dropbox","id":"3331728527","title":"Children Doing The Quality Control","comment":"Most of my files are missing... no indication of them being updated or syncing or a data wheel turning... just says folder is empty.... been waiting four hours now no files... is quality control just an out dated concept?  Where are my files?\n\nUpdate: now photo uploads stall after 2 photos. Rebooting the phone gives the ability to load 2 more before stalling again","rating":1,"reviewer":"Joliver332","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3331595003","title":"Awesome app! At least it used to be.","comment":"APP DEVELOPERS! WHEN YOU GET YOUR APP WORKING WELL, STOP MESSING WITH IT!\n\nI use Dropbox daily on my PC, iPhone and iPad. It is incredibly useful. I put manuals, school homework (which gets shared with my grandson’s mom), pictures and so much more! I’ve gotten in the habit of downloading every owner’s manual for every tool, device, camera I have. I often refer to it on my iPad.\n\nThere’s the recent problem. Dropbox has become unreliable on my Apple devices. I get the “loading” circle for 10 or 15 minutes before anything shows up! Sometimes contents never appear. Dropbox used to be instantaneous. Oh, and I have a 220 mbps download speed, so that’s not the issue.\n\nIf they fix this I’ll enthusiastically give it 5 stars. But right now it’s almost useless.","rating":2,"reviewer":"ATX media guy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3331442007","title":"Automatic camera uploads taken away","comment":"Taking away a feature from legacy users is really disappointing, especially something as useful as auto uploads.","rating":1,"reviewer":"upper case JD","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3328938504","title":"New update makes us pay","comment":"The new update makes people with the basic to pay if they want to save offline files , that’s absurd","rating":1,"reviewer":"Mexican 23 20","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3328411590","title":"Garbage","comment":"Garbage app full of error. Videos not loading properly, confusing to navigate, slow, constant notifications asking you to upgrade your plan.\n\nBeen trying to skip through my files on this websites. It jumps from files #202 to #2 even though I’m trying to see #203, #204 and so on. I can’t even download stuff because it says “error downloading your file”","rating":1,"reviewer":"User20181","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3322557356","title":"change the logo/icon it’s really ugly","comment":"maybe to a white background and then a blue box","rating":5,"reviewer":"meantomatoes","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3322294416","title":"I hate the app and website","comment":"They are really pushing this app for business users. The UI and \"features\" are for business and collaboration users. \n\nWhy can't I sort the files by kind with folders at the top? If I am moving a file, will I be moving it into an other file or a folder? \nI can't export anything out of the app.\n\nI think it is time for me to move on.","rating":2,"reviewer":"@Sigil","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3321933034","title":"Sadly - since iOS 12 can’t view files","comment":"I deleted and reinstalled app but to no avail. Viewing files just spins and file never renders. Same file I can open on mobile safari but not in the App. Contacted their support and got a lame response to delete and reinstall app - did that but didn’t help. I have been a paid subscriber for years and it is surprising to see such a basic bug.","rating":1,"reviewer":"Neotk9711","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3313668545","title":"New update now I can’t attach files from Dropbox to email","comment":"I tested this with google drive iCloud Drive everything works as before. Dropbox when I select the file it doesn’t attach it gives me the option to change it name","rating":1,"reviewer":"dbepstein","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3313370664","title":"Saving Offline","comment":"I’m wanting to make a certain folder in my Dropbox available offline.  But I need to make sure before I do so. That the contents of this folder that I’m wanting to make offline to view whenever with data or not.. that it won’t be automatically updated into my iPhone camera roll. Or put into a folder in my iOS camera roll.  That would be BAD... very very BAD.  so that’s my concern.   I need to make sure that these sensitive confidential files won’t be seen ANYWHERE else except offline in the Dropbox app. And not in my personal camera roll.  Please advise.  \n\nRespectfully,\n\nDropbox 1TB user.  :)","rating":5,"reviewer":"Byhiu","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3313214870","title":"Freezes","comment":"I have loved this app since the beginning. \nBut since the last few updates, it is constantly freezing on iPhone. \nI have 40 files that refute upload. \nThey need to fix this.","rating":2,"reviewer":"KillerKane0861","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3310574140","title":"Wow!","comment":"Awesome app, love it!","rating":5,"reviewer":"odog1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3308020639","title":"What did you do?","comment":"I used to be able to attach documents to emails when replying to customers requests for info. Now when I select a document to attach it takes me to a window to change the file name! HUH?The app also hangs up when opening a PDF.","rating":1,"reviewer":"SnookyP","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3306703616","title":"Ugh","comment":"This stupid prove your not a robot verification is extremely annoying being asked constantly.","rating":1,"reviewer":"Lulukattt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3305693398","title":"Hyperlinks","comment":"I have spreadsheets saved in drop box that have hyperlinks. However, while the hyperlinks are blue and underlined as they should be, nothing happens when I tap on them. Can you update the app to open hyperlinks like it should?","rating":4,"reviewer":"Blastrx","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3301313876","title":"Update is a huge #fail","comment":"The current update for iPad freezes whenever I try to open a pdf in acrobat.\nPlease expedite a fix.\nThank you\n\nI appreciate the developers’ suggestion to leave a more detailed note in the support area. I did so.\nThe app in iPad continues to freeze and quit. \nThis is a major life lesson: do not rely on cloud services. My workflow and life have utterly been disrupted by this failed update. External hard drives are inexpensive with massive storage capacities and are safe from predation. I plan on transferring all my cloud data to an external hard drive and have a safer, cheaper storage solution.","rating":1,"reviewer":"hnp1995","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3299762881","title":"DropBox is becoming more and more useless as time passes","comment":"DropBox seriously needs to update its free offsite personal storage size and they need to offer more affordable storage size tier-ing.\n2.2 GBs of free personal data storage is a joke in this day and age. At least offer a free tier that is the same as Apple's and maybe consider offering double that, 10 GBs, for free!\nGoogle Drive offers a free 15 GBs of free personal storage.\nDropBox needs to offer personal offsite data storage at pricing for 50, 100, 200 and 500 GBs storage tiers.\nDropbox devs are greedy.\nI don't want or need to pay for 1 TB of data storage at $10 per month.\nI can get by with say 50 to 200 GBs of offsite storage just fine.\n\nI had hoped to use this along side iCloud to upload both video and photos for download to my iPad at a later time.\nI haven't tried any movies or videos, yet, but my experiences with photos is less than desirable.\nI upload high quality Jpeg images to DropBox only to have DropBox drop the quality and resolution of my original upload to an image resolution that's less than desirable.\nAnd, also, many times DropBox refused to load the photo/image at any resolution. The high res file never got downloaded to my iPad.\nOnly a low resolution one.\nPlus, there is no progress bar to know how long an image is taking to download fromDropBox to my iPad.\nEveryone is giving this app grat reviews, but so far, I am not seeing this or the benefits.\nMy Photos are between 8 and 15 MBs in data size and have been reduced to fit the iPad's viewable screen size or close. Totally worthless for photos if I can't get what I, originally, uploaded to down load to my iPad. Plus, there customer service and support, so far, has been totally useless. I 've been waiting for days for an answer or resolution to this problem and no responses from theDropBox support team. This app maybe good for documents, but so far for photos and images, it leaves a lot to be  be desired.","rating":1,"reviewer":"Hardcore Trek Tek","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3299689323","title":"UMANO","comment":"Why did you guys kill Umano??","rating":1,"reviewer":"isaquec","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3299586917","title":"Stop","comment":"Just get google photos.","rating":1,"reviewer":"yeonsooz94","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3298746030","title":"Troubles","comment":"So I’ve used Dropbox for a year or two. Been a great app. Unfortunately the last two weeks maybe less I’ve had issues with media. If I have an MP3 file, I can’t listen to it. Or I’ll have to reset the app multiple times to even play it. The app crashes a lot. As of now it’s barely usable. I hope the Devs see this and look into it. It’s not my device or connection as all of my files are offline compatible. Hopefully they fix it so I can bump it back up to a 5 star. Love Dropbox","rating":1,"reviewer":"MafiaAlex","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3295845511","title":"Freezes constantly","comment":"Clearly no technical support nor integration for older iOS devices. App freezes, can’t upload photos, can’t select photos, can’t do anything. Dropbox used to be the best, now they’re one of the worst.","rating":1,"reviewer":"Skyscan305","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3294706084","title":"Not working )))))))): so baaad","comment":"After the new update i cannot upload easily i cannot open the files easily i have to close the app and open it each time cause it freeeeeeze all the time with any action i need , my offline files are hard to access hard to upload them through email , the previous update was so flexible !!! Iam so disappointed its my fav storage app","rating":1,"reviewer":"dr.hanan.a","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3294221697","title":"Crashes","comment":"For some reason, after the update, my Dropbox app keeps crashing every time I play one of my songs and freeze the screen....","rating":3,"reviewer":"FlyBobbyJones","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3292746997","title":"Passcode compatability with Files app","comment":"I’ve used Dropbox for a long time, and the only real issue I have with it is that if you set up a passcode you can’t use it with Apple’s Files app.  Other similar apps work fine with a passcode (eg Resilio Sync), so I know it can be done. This is actually enough that I’m less likely to use Dropbox for everyday file management.\n\nOverall it’s a great set-and-forget program, but it does need the passcode issue fixed.\n\n[Response to Developer response: It’s not impossible and it’s not out of your hands. The makers of Resilio Sync must know something you don’t know, because they actually do what you say can’t be done. Maybe you should drop them a line, because I really would like Dropbox to work properly with Files.]","rating":4,"reviewer":"Stee-rider","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3291605311","title":"Current version bugged??","comment":"App works fine.. icon broken....","rating":3,"reviewer":"Wark88","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3291163669","title":"It won’t let me cancel","comment":"I’m hoping it won’t charge me. I’ve signed up for a free trial and it won’t let me cancel. Really hope it didn’t trick us into paying money because that would be very evil.","rating":1,"reviewer":"Tom4Jesus","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3290349510","title":"WHAT HAPPENED ?!","comment":"My experience with the Dropbox app has been great up until just recently. It takes forever to open up folders to access them. Almost seems as if it freezes. Only after force closing and reopening a number of times am I able to access/view my files. Please fix !","rating":3,"reviewer":"SROSSM","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3288985464","title":"Ugh.","comment":"Was working great until some new app updates came along. Now the app freezes ALL the time. I have to go my desktop to get anything done. I’ve restarted my phone, deleted, reinstall app, nothing so far....","rating":1,"reviewer":"Lavjames","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3288736987","title":"This worked great until the 10-10-18 update","comment":"I am a paid subscriber.  All my files are stored in Dropbox.   Many are stored on device for work.  I have to use my iPad for work.  The latest update made my iPhone X and iPad 2018 Dropbox apps inoperable.  All my files were removed from the device, and i cant open my files.   Please fix!   I have tried everything, including restarting the devices multiple times.  The app locks up if i try to open anything.","rating":1,"reviewer":"Warriorvamp","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3286679419","title":"WORST APP I HAVE EVER SEEN!!!!!!!!!","comment":"DO NOT EVER GET THIS APP!!! I  WAS JUST TRING TO WATCH A VIDEO SOMEONE SENT ME AND ALL IT DID WAS MAKE ME PAY!!!!!!!!","rating":1,"reviewer":"chfhghufhfucucbc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3285871556","title":"Having problems with latest iOS Dropbox stuff","comment":"When tries to search for a file it says “searching” and then abends. When try to load from folder says “loading” and eventually abends.   Talked with Dropbox support but they couldn’t help me. Just upgraded to professional and this is what I get.  I’m at a loss as to what to do.","rating":1,"reviewer":"Dsperk","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3283108941","title":"Good app","comment":"Where it says home that should be more up more so I can see more without having to scroll up. There's so much white space for no reason.","rating":4,"reviewer":"jackson2192","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3282354146","title":"Sharing","comment":"The last update stated when sharing a document it DB will send the file and a link. IT DOES NOT SEND THE FILE. Just a link as usual.","rating":2,"reviewer":"frankster222","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3281927800","title":"Confusing","comment":"Someone sent me a file that I can’t view.  Tried downloading the app and it doesn’t appear in my phone. Super frustrating....","rating":1,"reviewer":"sofia777","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3280381029","title":"Never works for me","comment":"Every time I try to use this app, it tells me to download it and sends me to the App Store, even though I already have it downloaded on my phone. I’ve only been able to successfully use it a couple times.","rating":1,"reviewer":"alycewandering","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3277933704","title":"such a disappointment (app)","comment":"cannot believe i pay for an app with this poor of design-    my “recent” folders include a 2016 file and a 2017 folder- that never disappear.  been like that for months. deleted and reloaded.","rating":1,"reviewer":"ml baxley","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3277876830","title":"Not syncing, even on wifi","comment":"Not showing file changes from past week, which I can see on other devices. Refreshing doesn't fix the issue. \niPhone 10, on WiFi with cellular data enabled for the app\nWould be 4 stars otherwise, 5 if one could also browse through one’s Dropbox subfolders, like in a normal file manager.","rating":2,"reviewer":"Stayingintouch","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3276315505","title":"Be Careful with the Free trial","comment":"Be careful with the free trial, once you put your credit card information they will charge you even if you cancel it early. I did cancel it like 5 days earlier from the trial expiration day and they still charged me.","rating":1,"reviewer":"KCstone03","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3272012660","title":"Trying to cancel subscription but can’t","comment":"It suggests that I should be able to cancel my subscription by using App Store...App Store shows I’m subscribed but doesn’t offer a way to unsubscribe.  It was very easy to subscribe...why so difficult to unsubscribe????  Please help!","rating":1,"reviewer":"So-so is all","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3270913770","title":"Thumbnail","comment":"My video files don’t have thumbnail images on them, and I can’t figure out how to fix that","rating":2,"reviewer":"Mpfully1001","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3268500537","title":"Great app, need to clear cache","comment":"I use Dropbox almost daily, but without a way to clear the cache, it constantly chews up my storage on my iphone. There needs to be a way to clear the cache without uninstalling and reinstalling and signing back in. \n\nThis needs to be the primary focus of app developers.","rating":4,"reviewer":"CaptMikey73","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3266862645","title":"Rip off","comment":"Upgraded to a new phone, backed up everything in iCloud twice, opened ap on new phone and all of my pics are totally gone! So upset","rating":1,"reviewer":"Buddhaneck","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3266213583","title":"Dropbox","comment":"This is not a user friendly app.  I want my money back.  Not happy with the product.    It automatically signs you up for a monthly fee thru apple and I do not like.  Please do not bill me","rating":1,"reviewer":"bk5098","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3263617319","title":"Crashes when uploading photos","comment":"100% of the time.","rating":1,"reviewer":"whîsp","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3263532582","title":"Problems","comment":"I had many issues with Dropbox","rating":1,"reviewer":"ActivePrime","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3262924952","title":"Glitchy AF","comment":"For the past week, files won’t open when I’m connected to Wi-Fi and files freeze all the time.  No sorting feature in app.  App getting worse and worse as time goes on.","rating":1,"reviewer":"Robvalhed","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3261486376","title":"Horrible","comment":"The app just closes out every time I start it up so it’s unusable.","rating":1,"reviewer":"nuyghjhv","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3261415274","title":"Heic formatted pictures update","comment":"I have been waiting for Dropbox to fix this issue for quite some time now but this is too stupid for Dropbox to ignore Heic formatted pictures in IPhone. Apple apparently introduced a new format to avoid pictures/videos taking too much space. But Dropbox have been coming up with bunch of useless updates almost every week but for some reason they have been avoiding the compatibility of HEIC formatted pictures...\n\nPlease do something or you will lose one subscribed customer from next month onwards!!! \n\nSincerely,\nFrustrated customer!","rating":1,"reviewer":"Vikramtiwari","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3260147549","title":"Something is wrong","comment":"Every time I try to pull a picture from one of my folders it says file empty but two seconds later it shows pictures. Someone please help because if you don’t get this fixed I have lost all my pictures of my late husband.","rating":1,"reviewer":"Wilkerson1214","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3331728527","title":"Children Doing The Quality Control","comment":"Most of my files are missing... no indication of them being updated or syncing or a data wheel turning... just says folder is empty.... been waiting four hours now no files... is quality control just an out dated concept?  Where are my files?\n\nUpdate: now photo uploads stall after 2 photos. Rebooting the phone gives the ability to load 2 more before stalling again","rating":1,"reviewer":"Joliver332","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3331595003","title":"Awesome app! At least it used to be.","comment":"APP DEVELOPERS! WHEN YOU GET YOUR APP WORKING WELL, STOP MESSING WITH IT!\n\nI use Dropbox daily on my PC, iPhone and iPad. It is incredibly useful. I put manuals, school homework (which gets shared with my grandson’s mom), pictures and so much more! I’ve gotten in the habit of downloading every owner’s manual for every tool, device, camera I have. I often refer to it on my iPad.\n\nThere’s the recent problem. Dropbox has become unreliable on my Apple devices. I get the “loading” circle for 10 or 15 minutes before anything shows up! Sometimes contents never appear. Dropbox used to be instantaneous. Oh, and I have a 220 mbps download speed, so that’s not the issue.\n\nIf they fix this I’ll enthusiastically give it 5 stars. But right now it’s almost useless.","rating":2,"reviewer":"ATX media guy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3331442007","title":"Automatic camera uploads taken away","comment":"Taking away a feature from legacy users is really disappointing, especially something as useful as auto uploads.","rating":1,"reviewer":"upper case JD","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3328938504","title":"New update makes us pay","comment":"The new update makes people with the basic to pay if they want to save offline files , that’s absurd","rating":1,"reviewer":"Mexican 23 20","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3328411590","title":"Garbage","comment":"Garbage app full of error. Videos not loading properly, confusing to navigate, slow, constant notifications asking you to upgrade your plan.\n\nBeen trying to skip through my files on this websites. It jumps from files #202 to #2 even though I’m trying to see #203, #204 and so on. I can’t even download stuff because it says “error downloading your file”","rating":1,"reviewer":"User20181","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3322557356","title":"change the logo/icon it’s really ugly","comment":"maybe to a white background and then a blue box","rating":5,"reviewer":"meantomatoes","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3322294416","title":"I hate the app and website","comment":"They are really pushing this app for business users. The UI and \"features\" are for business and collaboration users. \n\nWhy can't I sort the files by kind with folders at the top? If I am moving a file, will I be moving it into an other file or a folder? \nI can't export anything out of the app.\n\nI think it is time for me to move on.","rating":2,"reviewer":"@Sigil","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3321933034","title":"Sadly - since iOS 12 can’t view files","comment":"I deleted and reinstalled app but to no avail. Viewing files just spins and file never renders. Same file I can open on mobile safari but not in the App. Contacted their support and got a lame response to delete and reinstall app - did that but didn’t help. I have been a paid subscriber for years and it is surprising to see such a basic bug.","rating":1,"reviewer":"Neotk9711","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3313668545","title":"New update now I can’t attach files from Dropbox to email","comment":"I tested this with google drive iCloud Drive everything works as before. Dropbox when I select the file it doesn’t attach it gives me the option to change it name","rating":1,"reviewer":"dbepstein","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3313370664","title":"Saving Offline","comment":"I’m wanting to make a certain folder in my Dropbox available offline.  But I need to make sure before I do so. That the contents of this folder that I’m wanting to make offline to view whenever with data or not.. that it won’t be automatically updated into my iPhone camera roll. Or put into a folder in my iOS camera roll.  That would be BAD... very very BAD.  so that’s my concern.   I need to make sure that these sensitive confidential files won’t be seen ANYWHERE else except offline in the Dropbox app. And not in my personal camera roll.  Please advise.  \n\nRespectfully,\n\nDropbox 1TB user.  :)","rating":5,"reviewer":"Byhiu","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3313214870","title":"Freezes","comment":"I have loved this app since the beginning. \nBut since the last few updates, it is constantly freezing on iPhone. \nI have 40 files that refute upload. \nThey need to fix this.","rating":2,"reviewer":"KillerKane0861","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3310574140","title":"Wow!","comment":"Awesome app, love it!","rating":5,"reviewer":"odog1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3308020639","title":"What did you do?","comment":"I used to be able to attach documents to emails when replying to customers requests for info. Now when I select a document to attach it takes me to a window to change the file name! HUH?The app also hangs up when opening a PDF.","rating":1,"reviewer":"SnookyP","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3306703616","title":"Ugh","comment":"This stupid prove your not a robot verification is extremely annoying being asked constantly.","rating":1,"reviewer":"Lulukattt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3305693398","title":"Hyperlinks","comment":"I have spreadsheets saved in drop box that have hyperlinks. However, while the hyperlinks are blue and underlined as they should be, nothing happens when I tap on them. Can you update the app to open hyperlinks like it should?","rating":4,"reviewer":"Blastrx","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3301313876","title":"Update is a huge #fail","comment":"The current update for iPad freezes whenever I try to open a pdf in acrobat.\nPlease expedite a fix.\nThank you\n\nI appreciate the developers’ suggestion to leave a more detailed note in the support area. I did so.\nThe app in iPad continues to freeze and quit. \nThis is a major life lesson: do not rely on cloud services. My workflow and life have utterly been disrupted by this failed update. External hard drives are inexpensive with massive storage capacities and are safe from predation. I plan on transferring all my cloud data to an external hard drive and have a safer, cheaper storage solution.","rating":1,"reviewer":"hnp1995","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3299762881","title":"DropBox is becoming more and more useless as time passes","comment":"DropBox seriously needs to update its free offsite personal storage size and they need to offer more affordable storage size tier-ing.\n2.2 GBs of free personal data storage is a joke in this day and age. At least offer a free tier that is the same as Apple's and maybe consider offering double that, 10 GBs, for free!\nGoogle Drive offers a free 15 GBs of free personal storage.\nDropBox needs to offer personal offsite data storage at pricing for 50, 100, 200 and 500 GBs storage tiers.\nDropbox devs are greedy.\nI don't want or need to pay for 1 TB of data storage at $10 per month.\nI can get by with say 50 to 200 GBs of offsite storage just fine.\n\nI had hoped to use this along side iCloud to upload both video and photos for download to my iPad at a later time.\nI haven't tried any movies or videos, yet, but my experiences with photos is less than desirable.\nI upload high quality Jpeg images to DropBox only to have DropBox drop the quality and resolution of my original upload to an image resolution that's less than desirable.\nAnd, also, many times DropBox refused to load the photo/image at any resolution. The high res file never got downloaded to my iPad.\nOnly a low resolution one.\nPlus, there is no progress bar to know how long an image is taking to download fromDropBox to my iPad.\nEveryone is giving this app grat reviews, but so far, I am not seeing this or the benefits.\nMy Photos are between 8 and 15 MBs in data size and have been reduced to fit the iPad's viewable screen size or close. Totally worthless for photos if I can't get what I, originally, uploaded to down load to my iPad. Plus, there customer service and support, so far, has been totally useless. I 've been waiting for days for an answer or resolution to this problem and no responses from theDropBox support team. This app maybe good for documents, but so far for photos and images, it leaves a lot to be  be desired.","rating":1,"reviewer":"Hardcore Trek Tek","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3299689323","title":"UMANO","comment":"Why did you guys kill Umano??","rating":1,"reviewer":"isaquec","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3299586917","title":"Stop","comment":"Just get google photos.","rating":1,"reviewer":"yeonsooz94","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3298746030","title":"Troubles","comment":"So I’ve used Dropbox for a year or two. Been a great app. Unfortunately the last two weeks maybe less I’ve had issues with media. If I have an MP3 file, I can’t listen to it. Or I’ll have to reset the app multiple times to even play it. The app crashes a lot. As of now it’s barely usable. I hope the Devs see this and look into it. It’s not my device or connection as all of my files are offline compatible. Hopefully they fix it so I can bump it back up to a 5 star. Love Dropbox","rating":1,"reviewer":"MafiaAlex","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3295845511","title":"Freezes constantly","comment":"Clearly no technical support nor integration for older iOS devices. App freezes, can’t upload photos, can’t select photos, can’t do anything. Dropbox used to be the best, now they’re one of the worst.","rating":1,"reviewer":"Skyscan305","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3294706084","title":"Not working )))))))): so baaad","comment":"After the new update i cannot upload easily i cannot open the files easily i have to close the app and open it each time cause it freeeeeeze all the time with any action i need , my offline files are hard to access hard to upload them through email , the previous update was so flexible !!! Iam so disappointed its my fav storage app","rating":1,"reviewer":"dr.hanan.a","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3294221697","title":"Crashes","comment":"For some reason, after the update, my Dropbox app keeps crashing every time I play one of my songs and freeze the screen....","rating":3,"reviewer":"FlyBobbyJones","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3292746997","title":"Passcode compatability with Files app","comment":"I’ve used Dropbox for a long time, and the only real issue I have with it is that if you set up a passcode you can’t use it with Apple’s Files app.  Other similar apps work fine with a passcode (eg Resilio Sync), so I know it can be done. This is actually enough that I’m less likely to use Dropbox for everyday file management.\n\nOverall it’s a great set-and-forget program, but it does need the passcode issue fixed.\n\n[Response to Developer response: It’s not impossible and it’s not out of your hands. The makers of Resilio Sync must know something you don’t know, because they actually do what you say can’t be done. Maybe you should drop them a line, because I really would like Dropbox to work properly with Files.]","rating":4,"reviewer":"Stee-rider","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3291605311","title":"Current version bugged??","comment":"App works fine.. icon broken....","rating":3,"reviewer":"Wark88","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3291163669","title":"It won’t let me cancel","comment":"I’m hoping it won’t charge me. I’ve signed up for a free trial and it won’t let me cancel. Really hope it didn’t trick us into paying money because that would be very evil.","rating":1,"reviewer":"Tom4Jesus","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3290349510","title":"WHAT HAPPENED ?!","comment":"My experience with the Dropbox app has been great up until just recently. It takes forever to open up folders to access them. Almost seems as if it freezes. Only after force closing and reopening a number of times am I able to access/view my files. Please fix !","rating":3,"reviewer":"SROSSM","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3288985464","title":"Ugh.","comment":"Was working great until some new app updates came along. Now the app freezes ALL the time. I have to go my desktop to get anything done. I’ve restarted my phone, deleted, reinstall app, nothing so far....","rating":1,"reviewer":"Lavjames","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3288736987","title":"This worked great until the 10-10-18 update","comment":"I am a paid subscriber.  All my files are stored in Dropbox.   Many are stored on device for work.  I have to use my iPad for work.  The latest update made my iPhone X and iPad 2018 Dropbox apps inoperable.  All my files were removed from the device, and i cant open my files.   Please fix!   I have tried everything, including restarting the devices multiple times.  The app locks up if i try to open anything.","rating":1,"reviewer":"Warriorvamp","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3286679419","title":"WORST APP I HAVE EVER SEEN!!!!!!!!!","comment":"DO NOT EVER GET THIS APP!!! I  WAS JUST TRING TO WATCH A VIDEO SOMEONE SENT ME AND ALL IT DID WAS MAKE ME PAY!!!!!!!!","rating":1,"reviewer":"chfhghufhfucucbc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3285871556","title":"Having problems with latest iOS Dropbox stuff","comment":"When tries to search for a file it says “searching” and then abends. When try to load from folder says “loading” and eventually abends.   Talked with Dropbox support but they couldn’t help me. Just upgraded to professional and this is what I get.  I’m at a loss as to what to do.","rating":1,"reviewer":"Dsperk","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3283108941","title":"Good app","comment":"Where it says home that should be more up more so I can see more without having to scroll up. There's so much white space for no reason.","rating":4,"reviewer":"jackson2192","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3282354146","title":"Sharing","comment":"The last update stated when sharing a document it DB will send the file and a link. IT DOES NOT SEND THE FILE. Just a link as usual.","rating":2,"reviewer":"frankster222","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3281927800","title":"Confusing","comment":"Someone sent me a file that I can’t view.  Tried downloading the app and it doesn’t appear in my phone. Super frustrating....","rating":1,"reviewer":"sofia777","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3280381029","title":"Never works for me","comment":"Every time I try to use this app, it tells me to download it and sends me to the App Store, even though I already have it downloaded on my phone. I’ve only been able to successfully use it a couple times.","rating":1,"reviewer":"alycewandering","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3277933704","title":"such a disappointment (app)","comment":"cannot believe i pay for an app with this poor of design-    my “recent” folders include a 2016 file and a 2017 folder- that never disappear.  been like that for months. deleted and reloaded.","rating":1,"reviewer":"ml baxley","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3277876830","title":"Not syncing, even on wifi","comment":"Not showing file changes from past week, which I can see on other devices. Refreshing doesn't fix the issue. \niPhone 10, on WiFi with cellular data enabled for the app\nWould be 4 stars otherwise, 5 if one could also browse through one’s Dropbox subfolders, like in a normal file manager.","rating":2,"reviewer":"Stayingintouch","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3276315505","title":"Be Careful with the Free trial","comment":"Be careful with the free trial, once you put your credit card information they will charge you even if you cancel it early. I did cancel it like 5 days earlier from the trial expiration day and they still charged me.","rating":1,"reviewer":"KCstone03","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3272012660","title":"Trying to cancel subscription but can’t","comment":"It suggests that I should be able to cancel my subscription by using App Store...App Store shows I’m subscribed but doesn’t offer a way to unsubscribe.  It was very easy to subscribe...why so difficult to unsubscribe????  Please help!","rating":1,"reviewer":"So-so is all","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3270913770","title":"Thumbnail","comment":"My video files don’t have thumbnail images on them, and I can’t figure out how to fix that","rating":2,"reviewer":"Mpfully1001","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3268500537","title":"Great app, need to clear cache","comment":"I use Dropbox almost daily, but without a way to clear the cache, it constantly chews up my storage on my iphone. There needs to be a way to clear the cache without uninstalling and reinstalling and signing back in. \n\nThis needs to be the primary focus of app developers.","rating":4,"reviewer":"CaptMikey73","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3266862645","title":"Rip off","comment":"Upgraded to a new phone, backed up everything in iCloud twice, opened ap on new phone and all of my pics are totally gone! So upset","rating":1,"reviewer":"Buddhaneck","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3266213583","title":"Dropbox","comment":"This is not a user friendly app.  I want my money back.  Not happy with the product.    It automatically signs you up for a monthly fee thru apple and I do not like.  Please do not bill me","rating":1,"reviewer":"bk5098","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3263617319","title":"Crashes when uploading photos","comment":"100% of the time.","rating":1,"reviewer":"whîsp","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3263532582","title":"Problems","comment":"I had many issues with Dropbox","rating":1,"reviewer":"ActivePrime","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3262924952","title":"Glitchy AF","comment":"For the past week, files won’t open when I’m connected to Wi-Fi and files freeze all the time.  No sorting feature in app.  App getting worse and worse as time goes on.","rating":1,"reviewer":"Robvalhed","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3261486376","title":"Horrible","comment":"The app just closes out every time I start it up so it’s unusable.","rating":1,"reviewer":"nuyghjhv","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3261415274","title":"Heic formatted pictures update","comment":"I have been waiting for Dropbox to fix this issue for quite some time now but this is too stupid for Dropbox to ignore Heic formatted pictures in IPhone. Apple apparently introduced a new format to avoid pictures/videos taking too much space. But Dropbox have been coming up with bunch of useless updates almost every week but for some reason they have been avoiding the compatibility of HEIC formatted pictures...\n\nPlease do something or you will lose one subscribed customer from next month onwards!!! \n\nSincerely,\nFrustrated customer!","rating":1,"reviewer":"Vikramtiwari","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3260147549","title":"Something is wrong","comment":"Every time I try to pull a picture from one of my folders it says file empty but two seconds later it shows pictures. Someone please help because if you don’t get this fixed I have lost all my pictures of my late husband.","rating":1,"reviewer":"Wilkerson1214","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3260147549","title":"Something is wrong","comment":"Every time I try to pull a picture from one of my folders it says file empty but two seconds later it shows pictures. Someone please help because if you don’t get this fixed I have lost all my pictures of my late husband.","rating":1,"reviewer":"Wilkerson1214","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3258170363","title":"I love Dropbox","comment":"Great","rating":5,"reviewer":"prosongit","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3257312309","title":"Money","comment":"Was wondering why when I originally downloaded the app I was told I would get a monthly charge of .99 cents a month. Now you are charging me $9.99. I would appreciate a refund and a cancellation of my membership so I don’t get charged again. I was only using it to download a video and was going to void it after I was done. Thank you.","rating":1,"reviewer":"pdawg907","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3255086673","title":"Becoming less useful","comment":"The app increasingly fails to preview some ascii text files, .jpg and PDF documents. As I use the app to show projects to team members, this is becoming a major headache.","rating":2,"reviewer":"ChurchOrganist","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3254310237","title":"Problem signing into drop box","comment":"I have been trying to sign in to Dropbox, but you keep telling me that my e-mail is invalid. My addresses are nuimage40@gmail  & nuimage40@yahoo. I ave been using both these addresses for over 10 years & are both still active. So why can’t I get into Dropbox. \n\nYou can reach me at either of those two e-mails or call\n1 715-324-6166.  Or 920-604-1500\n\nRespectfully: Janet","rating":2,"reviewer":"J39MD","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3254121863","title":"Bad app very disappointed","comment":"Bag app very disappointed","rating":1,"reviewer":"Cocosino","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3253700735","title":"Big report","comment":"Apparently renaming a folder deletes everything inside the folder","rating":4,"reviewer":"KINGOFTHEDROPBOX","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3253131817","title":"Freezing","comment":"Been trying to upload photos and videos and the app has been freezing up after pressing “next.”","rating":1,"reviewer":"mel345926","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3251236102","title":"Please poop","comment":"poop","rating":5,"reviewer":"rhody sara","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3250601456","title":"Long Time User Now Very Upset","comment":"I have the most updated version of the app. I just spent hours (yes HOURS) scanning documents for work and the app just crashed while saving. Everything I scanned is gone. I’ll be starting over with Google Drive. This is unacceptable.","rating":1,"reviewer":"kolgreat","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3248389126","title":"Too expensive !","comment":"I am a senior citizen on a fixed income and although this was easy to navigate-in the long run on a annual basis too expensive! Thanks","rating":4,"reviewer":"goldengirl@3","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3248134649","title":"Not wasting my money!!!","comment":"I signed up for the premium subscription by accident and I’ve tried so hard to get rid of it!! I can’t figure it out . It keeps redirecting me to a different page. This should be simple!!!","rating":2,"reviewer":"bigglo300","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3245936218","title":"So awesome, so simple","comment":"It’s everything you would hope for. \n\nOne request: please allow edited pics to be uploaded instead of original pics","rating":5,"reviewer":"MpowerSkills","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3245933578","title":"Terrible","comment":"Worst app I’ve ever used to back up photos, etc. Firstly, it took over a week to back up 4,000 photos. There’s no excuse for it to have taken that long. Then, there was no way to save all of them to another device unless I went through all 4,000 and selected each one individually and selected to export and save image to phone. Garbage app, will never use again and will always tell everyone to avoid it.","rating":1,"reviewer":"RedAMK","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3244583439","title":"Update causes crash","comment":"What’s going on with the new update!? It’s crashing every time I use it. It’s the most frustrating thing because this is such an important tool for me. You’ve been so good Dropbox! Why now? Why ya gotta burn me like this?","rating":1,"reviewer":"Matthew Takes","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3240069994","title":"Export multiple photos!","comment":"Love Dropbox and the app just want to be able to export a whole photo or multiple photos to my iPhone camera roll at once!! Please add this feature.","rating":4,"reviewer":"Mahdjsjsndhdnd","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3237561723","title":"Agreement to SHARE YOUR STUFF!!!?","comment":"Don’t download or agree. Read Drop Box agreement if you don’t mind sharing personal stuff to others","rating":1,"reviewer":"Morning Anime","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3236864257","title":"Former reviews","comment":"Just like to say I’ve never been charged a dime and it is connected to all of my electronics! I thought I was computer illiterate but apparently not as bad as some. Thanks for great service!","rating":5,"reviewer":"Stymie0608","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3235950270","title":"Cancellation","comment":"I downloaded this app not understanding exactly what it was for I would like to cancel my Dropbox thank you very much","rating":1,"reviewer":"Mary tabler.","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3232157434","title":"Don't know what I'd do without it","comment":"9/26/18 update - addition OF the ability to export the actual file along with link - MAJOR. Thank you! Haven’t tried it yet but will do the minute the update is finished. 5 minutes later: yep, it works beautifully. I sent a PDF via iMessage & rcvd. the file and the link. \n\nI use Dropbox throughout the day (mostly on an iPhone and an iPad). It is such a well designed piece of software - I really only intended to provide feedback to say thanks for giving me a longer list of directory choices when I want to file something. \n\nBut that gets to the heart of things - they continue improving all the time (& are prompt about checking into problems).","rating":5,"reviewer":"jvtunes","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3229571646","title":"Still forces you to create links when sharing.","comment":"Latest update sends the actual file when exporting(thank you!) but still insists on creating a link to the file and putting that URL in the export too.\n\nSeems very sloppy to have all of these links created when you simply want to attach a file to an email, for example. Feels like a security weakness for Dropbox.\n\nI get that you want to share the Dropbox.com link for brand and lock-in reasons but sometimes this isn’t the best option.","rating":2,"reviewer":"JasonTM1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3222992490","title":"Good luck trying to cancel your free trial","comment":"I’m already spending close to three hours trying to cancel my free trial and going around and around and around, they will not get a penny out of me, if I couldn’t find a way to cancel I will cancel my credit card before the end of the day, they count on people giving up trying to cancel and being charged, not from me scums.","rating":1,"reviewer":"Davidvibernum","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3219129574","title":"1/6","comment":"I uploaded 6 photos. I couldn't see 5 of them because it says \"the file can't be previewed, to view this file open it on your computer.\" The problem is I want to view these pictures on my phone, not my computer. That is my only goal in using this app. When I tried to delete them it told me there was an error and the files couldn't be deleted. I'm shook by how awful this app is.","rating":1,"reviewer":"whycantijustusemyname","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3218137346","title":"No support/Tried to charge for a cancelled subscription","comment":"BEWARE!  I cancelled my trial, the App Store tried to charge me a week before trial was up, then continued trying to charge me,fortunately I had removed my credit card before that because App Store said my valid card wasn’t valid, obvious App Store problem.  Way to go Apple! \n\nDropbox sends emails you can’t reply to, and there is no way to contact them thru app or website, I’d rate ZERO stars if I could, how are users supposed to get support? Reading other reviews, apparently there is none, that’s a major FAIL!!!\n\nI suppose the app works ok if you have access to high speed internet or work with tiny files, but if you don’t or are limited to a cell connection it’s pointless if working with large video files.","rating":1,"reviewer":"Xvd68","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3211041512","title":"Plus Acct","comment":"I would make sure if you are paying for a plus account you verify it on Dropbox website as well. I’ve been paying for it for months & just happened to take a look into it today to find I have a basic account. I went to my iTunes account & it shows a current subscription with Dropbox. I reached out to Dropbox who weren’t much help & reached out to Apple who referred me back to Dropbox. Ultimately I canceled the subscription & I will look for other means to get my data backed up.","rating":1,"reviewer":"ItsDip","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3210365484","title":"Good but not great!","comment":"Everything about this app is great except for 1 feature which is exporting files. I have to export 1 at a time. There is no way for me to select all the photos I want to save to camera roll at once. If this change in the future I’ll change my review to 5 stars!","rating":3,"reviewer":"ibrake4tanks","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3208463734","title":"Little tweaks","comment":"I wish there was a pause option for downloads. If I’m out of WiFi I have to relay on my data or cancel all the downloads until I’m able to continue doing so. \n\nAlso, it would be great if the downloads from my camera roll would be in chronological order instead of alphabetical.","rating":3,"reviewer":"Her1217","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3208277100","title":"Nudey Nathan strikes again","comment":"Just broke my phone but that doesn't matter, I backed all the nudes I've collected up to the drop box. New phone, old nudes, good day. 😎","rating":5,"reviewer":"Flipendo101","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3207593046","title":"Anti app","comment":"I don’t use Dropbox regularly and have limited space on my phone. It would be nice to not be forced to download this app to use when I use it once every couple months and then delete it after I get my pix.","rating":1,"reviewer":"khingz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3207447452","title":"Zero support or instructions on how to get started","comment":"I took the 30 day free trial with DropBox plus i think it’s called where id get 1 tb if storage but I cant find how to get started. The app isn’t even showing up on my screen but when i go to the app store it says i have it.  I’m canceling be because i cant even find it.  Too bad, i wanted to move away from Google Photos where everything stays locked up so bad that none of my photos or vids can be viewed or downloaded.\nIs there a company like this that actually works somewhere?","rating":1,"reviewer":"RockNRowBoat","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3207053489","title":"A suggestion","comment":"Hey guys\nI have seen a bug in chrome, when I want to save a pdf file from chrome to Dropbox, i can't save it in my Dropbox folder unless I email it someone, please make it optional to save or send by email, sending an email is a must to save the file in Dropbox folder.","rating":4,"reviewer":"fa_daniel","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3202198083","title":"Stop changing stuff!","comment":"Why do you guys constantly insist on changing the whole interface of the app? Seriously. Every update things are different, and not in a good way. Also, I can’t scroll down on my synced folders anymore. It makes my files disappear when I try. This started after the recent update. I’m not one of those “let me speak to your manager” kind of people but I just had to let you know how bad my experience has been so far. Please fix it, and leave it that way unless there’s a really important bug to fix. Also gave you 5 stars because I know you’re hard working people over there and I pay for pro. Don’t hate the app, just hate the constant changes to the overall look of the app that honestly seem more like a step backward than forward.","rating":5,"reviewer":"Dudebraj9000","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3200269799","title":"READ!!!!!!","comment":"It’s a great app and lets me save allot of things but it would even be more helpful if you guys could add a feature where we can customize the photos of each file. Just to give it a extra touch. Just saying small details matter!!","rating":5,"reviewer":"Just a guy with a thought :)","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3199468826","title":"scam","comment":"all of you developers try to get rich off you app, free trial subscription with the hopes that we forget to cancer bs app","rating":1,"reviewer":"browncb33","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3197792570","title":"What the HEIC!","comment":"I was not aware that saving as HEIC stripped the photo of portrait mode and any other filter/effect that has been applied to it. This led to me losing a ton of great photos!\n\nCould have at least warned.","rating":1,"reviewer":"rnathkdev1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3197094382","title":"Concerning","comment":"I downloaded the basic plan thinking it’s free. I do not want this and do not use it! If you charge for the basic plan it should say upfront. I do not see where you charge for the basic plan but see other reviewers say you charge $99.00 after I downloaded it! I have deleted this from my iPhone and iPad and will not use it.","rating":1,"reviewer":"Jd'snana","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3196949222","title":"The worst app","comment":"Bad customer support","rating":1,"reviewer":"Iamawesome29","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3191742408","title":"What did you do ?","comment":"I went to bed with 4gb of free space. Tried to upload a 17 min vid I took to my Dropbox app and I wake up to my phone saying storage full and the video hasn’t even uploaded. So what happened because it’s obviously this app!? Please fix asap","rating":1,"reviewer":"AudioGui","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3190908876","title":"Helps Maintain an Organized Life with Safe Reliability","comment":"Using Dropbox has helped me in keeping everything in a safe and easy to use platform space. My favorite feature is the ability to scan an upload documents just by taking a picture of it. So far, so good! I would recommend others to give it a try so they can appreciate the advanced technological features and a stress free tool that’s easy to learn how to use.","rating":5,"reviewer":"C.O.G. Forever","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3190469782","title":"Somebody needs more schooling. The last update is just a bust.","comment":"Used to work. Now just glitches out. Bad","rating":1,"reviewer":"Flickr is broke","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3189929236","title":"Annoying","comment":"It’s kinda cool to have personal files and everything but every time someone sends me a link for Dropbox it’s always telling me to sign in or get the app, even though I have it and haven’t signed out since I got it","rating":3,"reviewer":"Warfstache2020","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3186443571","title":"It's sooo slooooow...","comment":"About a year ago I tried to use Dropbox for photo and video backup from my iPhone so I could clear up some space....It was so slow it was useless. I literally had to upload 1 file at a time or it flat out would not work. Fast forward to today. It's the exact same thing. I've been trying to backup 64 files (videos less than 60 seconds long shot on my iPhone 5) and it's exactly the same thing. To make sure it wasn't my connection I sent a 1.5 gig file to a client via WeTranfer to test and it only took about 20 minutes. \n\nOn the laptop I have no problems but the iPhone  app just doesn't cut it.","rating":3,"reviewer":"thebasher","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3184930514","title":"Useless","comment":"This is without a doubt the most useless app I have ever encountered. It has single handedly destroyed and made every picture inaccessible. I’ve deleted it from every device I own.","rating":1,"reviewer":"Actorguytim","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3184745181","title":"Scam","comment":"This app used to be free. I didn’t know there’s a monthly charge which I really don’t need. I uploaded this app because it’s the only way I can view the pics my friend forwarded to me. I’m not interested in using this app. How can I cancel the membership I’m being charge when I only used it once just to view the photos forwarded to me. There should be a way for us non-members to be able to view the photos shared to us by a member of this apps... :(","rating":1,"reviewer":"JCZumba","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3182341697","title":"Cancel please","comment":"I need to cancel this. I keep getting charged and have no idea what this is for.","rating":1,"reviewer":"Blessedviravira","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3181663180","title":"Omg","comment":"This app is amazing","rating":5,"reviewer":"wenner123","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3179630672","title":"Can’t save to photos","comment":"Can’t save a photo from Dropbox to Photos. It doesn’t ask for permission, and there’s no option in preferences to allow Dropbox access to photos.","rating":1,"reviewer":"Jamesdrewafhihxdyjbdr","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3179359450","title":"Don’t upgrade!","comment":"They will take your money with NO WAY to contact them. I had the basic for a while and once I ran out of space I upgraded to the premium. My purchase will not sync to my account and now I’m out my money and still have no access to my account. Then when you try to contact them you find out that there is no way to directly contact them and no categories to match you issue which in turn mean you are screwed. So incredibly ridiculous.","rating":1,"reviewer":"Gracefulpawg","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3179325707","title":"The best app!","comment":"Thanks, Im using Dropbox long time ago, but the scanner is the best feature! Thank you so much! 🖤","rating":5,"reviewer":"dansdclens","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3176056649","title":"Unsubscribe","comment":"Like the previous reviewer,I only wanted Dropbox for the small amount of free coverage   I have not used ANY service to my knowledge but I am charged $9:99 every month  I am 76 years old I want you off my iPhone and off my charge card.","rating":1,"reviewer":"Dropyou","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3173293193","title":"Downloaded","comment":"I haven’t been able to create an account after trying for 2 days.  It tells me I don’t have internet connection, which I do.  When I get this working I’ll update my review.","rating":1,"reviewer":"ManasesPreacherLA","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3172712089","title":"Extension stopped working","comment":"When I try to save a file (say a pdf from safari) it no longer asks where I want to save it. Instead an email box pops up.","rating":1,"reviewer":"njd4k","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3171937600","title":"I want to cancel but Dropbox won’t let me","comment":"It’s impossible to cancel and they keep billing me","rating":1,"reviewer":"AAA- unhappy user","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3167997358","title":"Please refund my card!","comment":"I agree with the previous poster. I also noticed a charge for this app that I actually don’t use. I have tried several times to get in contact with this company to be refunded and have had zero success.","rating":1,"reviewer":"Arose fairy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3167267226","title":"The app won’t let me sign in","comment":"When I log in on my computer, my account is there and just fine. I updated with the recent app and try to sign in, it says no internet connection on my phone, but I clearly have internet. Tried signing in with google and still did not work. Need an update!","rating":1,"reviewer":"Appdoenstwork","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3165284888","title":"Crashes before signing in!","comment":"Pleas update this, it’s so bad","rating":1,"reviewer":"Rondo31","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3163699319","title":"lightroom","comment":"it wont let me share to lightroom. which is the only thing i need it for","rating":1,"reviewer":"p0135","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3161531611","title":"Attachment","comment":"Make an update for IOS that allow to attach from dropbox to Gmail directly without creating a link like what’s in the android","rating":3,"reviewer":"Hussa_hada","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3157820220","title":"Cancel subscribe","comment":"The app never said anything about charging any price or anything . It automatically enrolled me into a subscription and I was paying monthly and  I probably used the app once and it have been deleted off my phone for months now . \nSo my  question is how will I be refunded for those months that it was not installed on my phone, and also how to cancel the subscription?","rating":1,"reviewer":"stm340","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3157041527","title":"What is the point if you cannot download the files? Updated","comment":"I have been trying to download a file from a paid account to my unpaid account. I am unable to download any files from my Dropbox account to the local storage on my device. This gets one star until Dropbox realizes its existential purpose if transferring files from one computer to another computer and not one account to another account.\n\nReview of paid trial version.\nNow I am not able to select more then one file.\nI have the option of downloading a file but that’s not that helpful to me if I need to download gigs of content for work. \nAdditionally it limits the file size you are able to download to something between 50 and 100 megabytes. That what.. a minute of 1080 video? \n\nWhy do I not have the option of downloading an entire folder of content. I am willing to pay for the Dropbox experience I had in 2012. I am frustrated when the basic law of modern economics that things get better and cheaper over time is rolled backwards by greedy present hedonistic executives.","rating":1,"reviewer":"user 272475728","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3156400988","title":"Crap!","comment":"It deletes everything. Every time. I save my pictures to it and it’ll delete all of it if I log out or delete the app. When I log back in everything is gone. I’m so sick of it.","rating":1,"reviewer":"Alexbe95","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3156227897","title":"Just signed me up for a subscription","comment":"I downloaded drop box on an old phone almost 2 years ago(when it was free), got a file sent to me, never used it again, got a whole new phone and forgot about it, I just noticed on my credit card bill about 5 months ago I got upgraded without my knowledge and have been paying 10 dollars a month and now Dropbox is like “oh I’m sorry We have nothing to do with that it’s the Apple store” and I’ve been trying to get my money back for a month and there is no way to get a hold of anyone because it’s such a big company they can just take your money and you’re forced to deal with it. Not cool at all. I even cancelled and it still took my money this month, AGAIN.","rating":1,"reviewer":"caylaatx","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3154762767","title":"Dropbox Deleted all my Pictures","comment":"They deleted 2,299 pictures and some files. Everything is gone and they don't know what happened. After researching this, I found out it has happened to a lot of others so I DO NOT recommend storing anything on here or using it.","rating":1,"reviewer":"Leggari","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3154000840","title":"Useless","comment":"Doesn’t work with any apps. Can’t even move files from Dropbox to the mail app. Completely useless wouldn’t recommend for anyone.","rating":1,"reviewer":"Sean370175","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3151535503","title":"Can’t save files anymore","comment":"I use Dropbox almost everyday but for the last couple of weeks I haven’t been able to save any files to my phone ☹️ other than that and fact you can share a file unless the other person has a Dropbox, this app is great.","rating":4,"reviewer":"Cvsey_","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3151018919","title":"ZERO IF I COULD","comment":"I’ve been with Dropbox for over five years, using the same account (email and password), and out of the blue I am no longer able to log in. \n\nI use this service for work, so it is an active account. My correspondence with their “support team” is unfruitful, as she keeps giving me the same instructions over and over again on how to reset my password when she knows full well that my account is no longer accessible. \n\nI am not able to work at all without my files, and I am beyond upset with this “company.”\n\nThe bigger question that disturbs me to consider, is where in the hell all of my personal and business information is, since I can’t access it?!?\n\nDO NOT DO BUSINESS WITH THESE PEOPLE, NOBODY ELSE SHOULD HAVE THIS HAPPEN TO THEM. \n\nYou’re better off backing your files up the good ole fashioned way, but please use 2-3 solid (non cloud) sources when you do. \n\n0/5 Stars","rating":1,"reviewer":"L_Ci","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3135998672","title":"“Camera Roll” is not the same as iOS’s Camera Roll","comment":"Reply to the Developer Response:\n\nThe Developer’s reply discussed automatic photo upload. However, I was not talking about automatic upload and did not use the term. I have modified my review to clarify.\n\n—- Review —-\n\nWhen manually selecting photos for upload from an iOS device, Dropbox is shows an iOS Moments view of iOS photos. Dropbox calls this “Camera Roll” even though it does not match the iOS Camera Roll. Worse, Dropbox does not offer a way to select photos for upload using a view that’s in iOS Camera Roll order. You have to remember the date you took a photo or do a whole lot of scrolling if you have more than just a handful of photos (scrolling because of the screen space wasted by an iOS  Moments view). This is a not user-friendly approach.\n\nThis is not the only usability issue I have with Dropbox and I use Dropbox less than I would like because of these. However, it still remains somewhat useful to me so I gave it three stars for the somewhat usefulness.","rating":3,"reviewer":"SeriouslyDave","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3134908096","title":"Great app but recent glitch","comment":"Dropbox won’t sign on - says there may be a problem with my iPhone’s internet connection. Nope. Can connect to internet easily and even was able to check on web if Dropbox was down. It isn’t. What gives??","rating":3,"reviewer":"weffjiersma","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3134083162","title":"What the heck?","comment":"So I’ve been trying to look at my files on my phone and iPad and none of them are updating. It says I updated this file today but when I click on it, it shows me a month old version of it. I keep clicking on ‘files’ and it won’t stop automatically taking me to a random folder. This is an unusable nightmare. Do I need to be pro or something to see the most recent version of my files and for the app to work???\n\nOh geez the website isn’t even syncing my files..I’m just going to use google drive. Geez.","rating":1,"reviewer":"Liz S 88","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3131620695","title":"Can no longer recommend","comment":"Paid for multiple subscriptions for my family for years, but dropping support for our encrypted home folders on Linux means we'll be dropping Dropbox and will no longer be able to recommend.","rating":1,"reviewer":"eyrieowl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3131233551","title":"Dropbox lost my childhood","comment":"I had tons of photos on my Dropbox account and I needed to leave for 2 years on a religious mission, and now that I’m home, I tried opening up my Dropbox account again and it doesn’t exist.\n\nI checked my emails for anything from Dropbox and apparently I had received an email from them saying that they were deleting my account due to it not being used for an extended period of time.\n\nI just lost all my teen years worth of photographs, and I will never get them back now. ;(\n\nDropbox let me down.","rating":1,"reviewer":"Connor Dean","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3126471456","title":"Too many updates!","comment":"Too many updates are not as bad as no updates at all, but come on Dropbox. It’s almost making me suspicious with the volume of updates.","rating":3,"reviewer":"iMark D","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3125476737","title":"Strips filters off photos","comment":"If you shoot pictures with an app or the default camera app and filters are applied automatically. Those filters will not be uploaded, only the raw photo, which can't even be seen in the app.\n\n-Edit- after dropbox replied: \nImages from the photo app are saved on phone with filters. Only time i see it unfiltered is in my Dropbox.\nsomehow services like google can upload photos with filters. Go with google photos instead.\nSince I can't lower my stars below 1. It will be one for now.","rating":1,"reviewer":"Atius","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3120233210","title":"I can’t cancel my Dropbox after free trial. It is impossible to cancel or get in touch with them","comment":"It is impossible to cancel this plan easy to sign Infor free trail and impossible to cancel.","rating":1,"reviewer":"hatedropbox","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3118508004","title":"It’s charging me","comment":"Hi I got this app once and deleted it the same day and recently in my gmail it says that in my receipt I payed for this app when I uninstalled it literally weeks ago. How do i make this app not charge me? Thanks","rating":1,"reviewer":"WesternSlayer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3116708746","title":"Could be better","comment":"Of the few paid cloud services that I suscribe to, Dropbox would be the first one that I would close. Fewer returns for the buck. The cloud service is clunky and counterintuitive, inc. it’s search engine. Uploading and managing files, as compared to other services is a chore. They haven’t upgraded the available storage space in years (1 Tb).\n\nIt continues to be great, for what most of us signed-up for, to begin with— sharing docs with others, and for syncing frequently used files/folders in our hard-drives. But this is now also possible w other cloud providers.","rating":3,"reviewer":"Marley-blu","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3113616234","title":"Crashes a lot!","comment":"Having an app on my iPhone that lets me view all my Dropbox apps? Great idea - that part works well.  I’ve used it heavily for several years. \n\nHaving a built in scanner to scan and upload documents directly in Dropbox?  Great idea - but that part does NOT work reliably.  About 2/3 of the time, the app crashes while I am trying to scan a document. \n\nI have an IPhone 6+\nMy IOS is up to date, and has been for the last several years. But over that time, the scanner has consistently crashed. I’m fed up. I thought they could eventually get it right, but after a couple years, I’m ready to give up. I have Tiny Scanner on my phone, and it has NEVER crashed. Why is the Dropbox scanner so inept?\n\nOh, plus, this app is 156MB. What a bunch of bloat ware!","rating":1,"reviewer":"Falcon6","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3112151180","title":"App didn’t work","comment":"Tried this for a month. Couldn’t get the app to work most of the time. Zero customer support. Reluctantly gave up and canceled my service. I had high hopes for this app and data storage service, in fortunately it’s junk.","rating":1,"reviewer":"Shanelien","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3106418817","title":"Frustrated with the most recent update","comment":"I’ve really enjoyed Dropbox. It makes accessing my files across multiple devices so easy. After the most recent update I’m no longer able to attach files to emails through the “attachment” option in the mail app on my phone. Not everyone has a Dropbox account and I hate sending links to the files as it seems unprofessional to me. I’ve looked into it and it seems many people have experienced this issue. I hope it is resolved soon.","rating":4,"reviewer":"DanieF1020","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3104046602","title":"Stolen funds","comment":"I downloaded this app didn’t know it was a subscription. I seen the $99 from my account and immediately tried to cancel it. I never used it but was told I could not get refund for 11 months. This company is a Complete Deceptive. I don’t why the United States Attorney General have not filed a Class Action Sue Against it.  I will be looking into filing my own due for I am a Disabled Consumer....\nTHERE US NO WAY THIS CAN BE AN 4.8 RATINGS FOR A -99.99 APPLICATION....","rating":1,"reviewer":"Cranebabe","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3100274085","title":"DO NOT PURCHASE FROM APPLE","comment":"Do not purchase or upgrade paid plans for this app in the iTunes App Store. The developer has a glitch that does not allow upgrades that are purchased through Apple to be processed, even though your credit card will be charged and Apple will claim the upgrade is complete. Upgrade paid plains through the developer’s website instead.","rating":1,"reviewer":"F l n r","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3093562468","title":"Cancel my subscription please !","comment":"Don’t need it ! Hate they don’t respect your request to cancel.","rating":1,"reviewer":"AnandaVardhani","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3093376392","title":"Camera Upload Bug in iPhone 6","comment":"This is a great app except for one bug I’ve noticed when using automatic camera uploads on my iPhone 6: photos taken with a filter setting get uploaded as an unfiltered standard image, so pics with a filter get lost if you’re not paying attention and you delete pics on your phone to save space after uploading. Very annoying but to an otherwise excellent service. Once fixed I will rate back to 5 stars","rating":2,"reviewer":"Edot1588","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3091472090","title":"Cargas extremadamente lentas😔","comment":"En mi iPhone las cargas son extremadamente lentas.. me gusta esta app tengo años usándola pero estoy considerando usar otra ya que últimamente al cargar los videos estos pasan días y días en subir😔","rating":1,"reviewer":"josierl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3086637790","title":"Afraid to download","comment":"The Voxer app suggested that I download Dropbox but after seeing all these negative reviews, I'm Leary of changing it.\nPlease advice. Thanks, Allan.","rating":5,"reviewer":"MR. AK59","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3083847692","title":"Big problem with sharing files","comment":"Everything with Dropbox is cool but whenever I want to share a photo from gallery or a pdf there’s a big problem that I can’t just use “share via” cuz when I select Dropbox I have to assign an email address to share the link with. It can’t just upload something directly to Dropbox without sharing. And another problem is that I can’t share a file directly from Dropbox; I just have to send the link","rating":4,"reviewer":"Farahzadi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3082106725","title":"Seriously?!","comment":"I just need to upload two folders from email so I can view them, and save them to camera roll. The problem? IT NEEDS MORE STORAGE!! People are not going to want to buy things like more storage. Why? IT’S RIDICULOUS! This app should give people more free storage. I haven’t even seen most of the things I need to upload! People are going to use different, better apps that give them more storage, instead of Dropbox. I think I just will.","rating":1,"reviewer":"Ava's Meteor🌑","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3068841367","title":"Fix Please!!!","comment":"Hello I use dropbox to keep and store my music and beats, but I also use the app to upload the beats I have to GarageBand (I use it to record my songs) this new update will not allow me to drag my songs into GarageBand anymore I dont know if this is a bug or something but, Can you please fix this!!!!! I been using Dropbox ever sinced it has been released and this is my only problem I have","rating":4,"reviewer":"FlairThePhenom","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3065893604","title":"Not Happy At All","comment":"I don’t even have a lot of pictures in my Dropbox n yet am being charge all the time for more space it’s crazy and then not all my pictures got saved I’m missing years of my kids pictures when they were babies I just have recent ones so it’s very upsetting that yet even though I have clear my space it’s always full and I have no memories saved I would of never purchased if I knew I would lose a lifetime of memories I can’t get back 😪","rating":1,"reviewer":"Bunny Bunnz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3065161539","title":"IPhone X","comment":"Love the app but it would be nice if their was a button to cast to my chrome cast.","rating":5,"reviewer":"wgstever","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3064583476","title":"I have a problem with Dropbox","comment":"Every time I put in my RIGHT EMAIL AND PASSWORD I press sign in and then it asks me if I’m a robot than it tells to to press pictures of cars and then it says incorrect email and Ik it’s right so can u get the robot thing out it’s called “reCAPTCHA”","rating":3,"reviewer":"elihershy30","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3064346372","title":"TRASH","comment":"I SAVED PICTURES OF MY FAMILY MEMBERS AND ME ON THIS APP AND WHEN I LOGGED BACK IN LATER ON NONE OF THE PICTURES WERE THERE..SO I DO NOT RECOMMEND THIS APP AT ALL","rating":1,"reviewer":"Anonymus1234566","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3064155637","title":"Issue with paid account saying it’s full when it’s not.","comment":"I am the admin of a Dropbox plus account.  We pay for 1,030GB of storage. We are having an issue with the Dropbox for iPad (pro) app saying that Dropbox is full and to contact the administrator, except I am the admin and the app is logged-in with the admin credentials.  I have tried signing out and signing back in as well as uninstalling and reinstalling the app. Very frustrated as we use Dropbox on a daily basis for our small business... currently are using 6.7% of our allocated amount which is nowhere near the 1TB we pay for...","rating":1,"reviewer":"Artist Couple","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3045796423","title":"Good but needs some things","comment":"I use dropbox entirely on my phone and would like to see a few features added:\n\n- The ability to download an entire folder’s contents, without doing it file by file\n- When renaming a file, show the old filename above the textbox where I’m entering the new name\n- Let me rename a file even if the only thing I changed is the capitalization","rating":4,"reviewer":"pdRydia","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3045467173","title":"Ease dropper !!","comment":"DROPBOX IS ALLOWED TO DO WHAT?!\n\nTake control of your computer.  Yes.  If you have Dropbox, check Privacy in your System Preferences:","rating":1,"reviewer":"What's up user that 1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3041365844","title":"Dropbox holding my fikes hostage","comment":"After recent update it has become impossible download my files from Dropbox to work on them offline.  Dropbox has put that feafure behind a paywall without any warning.  What a ripoff!","rating":1,"reviewer":"Grla_99","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3041246202","title":"Absolutely amazing, I’m just nitpicking","comment":"Now this app itself is amazing. I have been able to use it to listen to music offline, and not have to pay for any subscription service. This honestly earns it 4.5 stars in my opinion, but sadly I can’t rate it as that. \n\nThe only thing I can think of that I have a problem with is that when you are listening to audio clips, there is no button available to loop the sound. \n\nOtherwise, absolutely amazing!","rating":4,"reviewer":"Dissiponted","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3037559628","title":"Disappointed after all these years","comment":"I recently tried to cancel my Dropbox account and download my photos.  I am an elderly grandma and can’t afford the $9.99 a month.  The problem is nobody responds to me and I keep getting the message to “upgrade” for more than $120.\nSince I am not a business person, why can’t I have my photos and leave?  I have paid for several months extra hoping I could send the photos to myself but it doesn’t work.  It is either pay the money or they keep your photos.\nIs that extortion?","rating":1,"reviewer":"AM92660","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3032975795","title":"Do not enable two-step verification!!","comment":"Customer service is useless if you get locked out of your account!","rating":1,"reviewer":"Use Google Drive or OneDrive","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3028514581","title":"Deleted","comment":"I don’t get what is up with all of these subscriptions and paid trials nowadays I had this app years ago on my other phone and they backed up photos for me since I had it. So I recently downloaded the app on my phone about two years and all my old files were still there now I download it and all of my past photos are gone I don’t get it","rating":1,"reviewer":"OssifiedElf","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3028110383","title":"Great way to access cloud files","comment":"Having this Dropbox App is a great way to have accessto your (Dropbox) cloud documents; specially since it integrates with the built in Files app. It's also a great way to upload things to your Dropbox account. \n\nStarting out with 2GB of free data is pretty silly in this day and age, but that describes the service, not the app. \nWhat I do find ridiculous about the app is that a simple feature like \"Make available offline\" is hidden behind a paywall. Really? I need to pay to maintain files on my device so I don't have to constantly use up your service's bandwidth whenever trying to open such files? Just ridiculous..","rating":3,"reviewer":"Jedidude","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3027216200","title":"Connect A computer","comment":"Oh my gosh! I was having a difficult time logging in on my desktop - trying to remember my password and it wouldn’t let me in. I figured I’ll just continue to use the app on my phone, until I saw the “Connect A Computer” button. I pressed it and in a matter of seconds (I’d say less than 45secs) I was able to get into my account on my desktop computer. It was just three easy steps! \n\nI’ve been using Dropbox for almost 8 years and thought it was good but nothing outstanding enough to write a review until now. I just hate the little badge icon that appears on a document when saved in Dropbox. I hide it but it comes back... All good tho!","rating":5,"reviewer":"Hotshtuf","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3023166976","title":"Force me to download your app, that’ll be great","comment":"I love being forced to download your app to use your subpar product. My employer dropped box to use your product and it’s been a never ending nightmare of terrible.","rating":1,"reviewer":"Brandon67432","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3020596111","title":"Why?","comment":"This app does not show all of the files and folders as the app on my Win10 desktop.\n\nWhy?\n\nStill waiting for reply! Aug 5, 2018","rating":1,"reviewer":"jeighcee","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3013692510","title":"Hate hate hate this app","comment":"I needed to download this app in order to access some photos uploaded by a group. I was forced to make an account and try the free trial. Without any notice I was subscribed and had charged after my trial ended. I would be less mad if I had notification before my trial ended and was charged that way I could make make an effort to end the account. Wouldn’t recommend this app to anyone who isn’t planning on using it for an extended period of time.","rating":1,"reviewer":"ultimate tiger🐅","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3013396045","title":"Nice!! But...","comment":"I love the app so much. Especially the creating a doc with a picture. But can there be a way to convert or share a file into the app files iOS?","rating":4,"reviewer":"Zhhwjdbbfbsjdvfnjs djdjssnd","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3005589499","title":"Why does background back up need my location and why doesn’t it save live photos as live","comment":"This app would be perfect if the background sync didn’t inexplicably need to track my location to work (which I refuse to allow on principle) and if it could automatically save live photos with their corresponding video files.","rating":4,"reviewer":"MMdMarkham","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"3002505730","title":"Helpful","comment":"Helps me get the music for my team😝","rating":5,"reviewer":"Ideongamer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2999931168","title":"The ultimate low functionality walled garden app","comment":"Since their IPO announcement Dropbox has been going downhill. We're getting a taste what life in the Dropbox world is going to be like once investors, vs users, are the priority. I have had enough of Dropbox' walled garden approach and am now looking for another service. \n\nFor me, a long time Dropbox user, it's been a reliable service that's well accepted by other apps. On the downside, there are some disturbing issues:\n1) Privacy: DB opens with the Recents page, including deleted files. If there's anything in there you don't want people to see, you need to make sure your device is not accessible by anyone else. There's no way to change this. People have been requesting DB address this weakness for years and nothing gets done. \n2) Support: As in zero. \n3) New features: Just the opposite, every year brings another reduction in features. \n4) Browser incompatibility: Must use Safari as DB is not fully functional with Chrome on a desktop. \n5) Interface: Gets worse every year. \n6) Errors: Once you permanently delete a file don't expect it to go away. On the second attempt I get endless spinners or a message that it could not perform that action. Months can go by with that file still showing -- and accessible.\n7) It's getting too difficult to get anything out of Dropbox. They force you to use the Dropbox app. Yet it lacks far to much functionality to do anything. Can't even email a file to myself so I can work on it. I get a link to open it in Dropbox where I've already established there's insufficient functionality. \n\nVery poor choice for a professional/working service. All of the above has been around for years. The DB community complains. Nothing gets done.","rating":1,"reviewer":"xgh","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2998651389","title":"Don’t understand why anyone would pay for slow, glitchy Dropbox when google photos is free?","comment":"Explain?","rating":1,"reviewer":"fdtparty","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2993502502","title":"Folders don’t sort","comment":"It’s been over 15 years and modern apps and operating systems can sort folders by date modified, yet Dropbox app can’t?  I will change my review to 5 stars if they can do it!","rating":1,"reviewer":"Long time user 4473628","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2992851585","title":"Can’t integrate to the files app","comment":"The app doesn’t have the option to save to files app on ios. So I cannot upload files from dropbox to the internet when safari uses the files app to upload. Other than that it has really good functionality for viewing and editing files.","rating":4,"reviewer":"Ryneezy481","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2992389151","title":"Background upload","comment":"The whole point of camera upload in the background is to not have to constantly open the app and get it to start uploading. Extremely annoying, having to remember to open the app just to upload my recent photos","rating":1,"reviewer":"Asydia","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2980410527","title":"Caution!  Don’t trust the memory Drop Box offers you - Get close and locked up!","comment":"I don’t appreciate this on bit - with memory still left you can NOT add unless you buy more storage space.  This is deceitful in my opinion.   Suggest going to Google drive or somewhere else before spending your money with these characters.\n\nIf you think I’m kidding, here’s part of the actual response they send before asking you to Annie up more $$$:  This is a friendly reminder that your Dropbox is almost full! Sadly, it won't save any new changes until it's back in shape.","rating":2,"reviewer":"Buck Phillips","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2975061757","title":"Did something change in the past 2 weeks?!","comment":"I looked up Dropbox and the only reason I installed it (on my iPad) was so I could have a very little bit of space for the brushes I was going to upload to Procreate. Not much space at all. That was an option I could choose and not pay anything for it. I would NEVER have downloaded the app if I was going to be charged at any time. I *don’t* do subscriptions. I knew the amount of space was really small, but so was the amount my brushes needed. I then see $99 on my credit card statement! I knew the amount seemed odd. I see people reviewing it saying $75 is too much...NONE of this was on there before I downloaded it. I looked at everything. I chose to use the free version that had very limited options. It did not say this was a trial and would change. I don’t want this and I would really appreciate it if you would refund that $99. I don’t buy apps or subscriptions like that for a reason! What’s written now is different than when I downloaded the app. Again, I never would have downloaded it. Please, please refund my money!","rating":1,"reviewer":"35madscientist","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2973272489","title":"No prices","comment":"They want people to upgrade and do no tell them how much it is.  It is a free 30 day upgrade and ur card will charged on renewal.  But how much is renew.  Deceptive marketing","rating":2,"reviewer":"thereareno nicnames available","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2966752912","title":"Exporting","comment":"I am not able to Export files anymore I’ve uninstalled it, reinstalled it and it still doesn’t work.","rating":1,"reviewer":"Juann999","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2960297012","title":"Five stars for completely disappointing me!!","comment":"I’ve had this app for a while now. They promise to keep all your pictures safe “NO MATTER WHAT” which is all a lie! Let’s say u lose access  to the account for a bit so you are inactive with it. Well without them even asking for your permission, they decide to erase your account and all the pictures you saved with it!! I completely believed them like an idiot and deleted my pictures and gave it to them so they can “KEEP IT SAFE” and without even consulting me or thinking about the fact that I have important pictures and things I actually wanted them to keep safe, they just erase and pretend like nothing ever happened. I completely do not recommend this app!! PLEASE DO NOT DOWNLOAD IT!!! GET EVERALBUM OR EVEN GOOGLE PICTURES BUT DO NOT USE THIS!!!","rating":5,"reviewer":"keilaa.17","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2955830807","title":"Are You Kidding Me?","comment":"There is seriously no way to manually add individual photos or videos to my Dropbox? I have to set up auto add? Seriously? What if I only need to upload 1 video and don't want to waste all day uploading the hundreds of other things I have on my device? What an absolute joke.","rating":1,"reviewer":"Fourthtimesthecharm","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2941568483","title":"Disappointed","comment":"I have had this app for a couple of years and for someone of my little knowledge of \nComputers and applications that you use with them this seemed to do what I needed.  But now something has changed because I am getting this warning that dropbox application will no longer be of any use but I have downloaded every update and now my files will not open up and I donot know how to contact Dropbox developer to see what to do.\nI use all Apple products, cellphone,Ipad mini 4 and Apple Macontosh laptop computer.","rating":1,"reviewer":"Jan Ellen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2940796615","title":"Removing features in \"updates\"?","comment":"My use case is mostly managing music and pdfs on an iOS device, since as a Linux user apple makes that baseline literally impossible. Dropbox sort of helps with that miserable situation.\n\nBut AFAICT Dropbox removed the \"make available offline\" feature in an update. Removing features in updates? That's terrible anti-user behavior.\n\nOther problems: doesn't seem to do incremental downloads, so is hopeless on slow or flaky networks. Interrupts downloads when you close the app.\n\nDropbox and apple, surely you can do better.","rating":2,"reviewer":"security researcher","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2939847313","title":"Very poorly made","comment":"This app was very poorly made, very confusing to use and sends photos 10x smaller and ruins the quality of them.","rating":1,"reviewer":"AllySunshinee","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2939711842","title":"Upload document to gmail from mobile","comment":"Please provide feature to upload dropbox doc to gmail directly.","rating":5,"reviewer":"AnshJain001","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2936391390","title":"Recent update 104.2 a bust","comment":"Update 104.2 has changed the dates on all files to “2 months 1 week ago” What a big whoops!","rating":1,"reviewer":"Nurse Teacher9801","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2931502372","title":"Useful but not worth $75/mo","comment":"This is a very useful app but for $75/mo I expect a much better experience that doesn't require a weekly uninstall and reinstall to clear several gigs of cache. Currently looking for an alternative unless they shape things up😡","rating":3,"reviewer":"tbryanm","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2926212582","title":"Crappy","comment":"This app is horrible why you got to pay to use this app like that make no sense so just saying wow why you gotta pay to use this app!","rating":1,"reviewer":"bsadar","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2918836340","title":"Brushes x Dropbox does not work","comment":"Dropbox in the popular drawing app Brushes does not work and has not worked for over 6 months. Is Dropbox planning a fix?","rating":1,"reviewer":".AM.","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2913972497","title":"Simplemente genial","comment":"Dropbox es una excelente manera de almacenar y gestionar archivos, es ideal a nivel personal y profesional!!\n: D","rating":5,"reviewer":"Rcyelmo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2912727624","title":"Multiple file exports possible?","comment":"I have been using Dropbox for years and love that it is accessible through an app for IOS. I am having a major problem, however, which may be a deal breaker. I am unable to find a way to export multiple files to a device at once. Currently, I have to save each file separately, and when dealing with hundreds, or thousands of files, this is just not practical by any means. I will gladly change my review if this fault is truly user error, but I have found many others with the same complaint.","rating":3,"reviewer":"Aaron1989","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2909177031","title":"Review","comment":"The AI has deteriorated to the point that the uses has to guess the German gender of a word \nIf you guess wrong no recourse the a few frames later same clue and same answers but previous answers wrong because they wanted the other gender. \n To me the crowns XP and gems do nothing and are useless. I will not use gems to buy health as this bypasses the learning in practice. The old habit of using practice to introduce new words or concepts continues. \nI tried using groups only to discover spent time getting right answer to get more XP‘s again bypassing learning. So dropped that. \n\nThe apps AI used to allow for spelling errors but that feature has been lost. The practice section is useful but this section has a huge amount of repetition, which is a time waste to get a health. \nI have compared answers given in app with other translators and don’t get the apps results. I have used other translators results in app sometimes getting a correct sometimes getting a false. Therefore, not sure how much to trust the app and/or the other translator. Still sorting this issue out to determine trustworthiness of app or should it be dropped. \nFor reference I only use the app with aids, not sure spending money for aid free buys me anything.","rating":3,"reviewer":"big-prof","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2908675646","title":"Can't disable comments","comment":"An update added comments, which take up screen real estate in my devices. I have not found a way to turn it off.","rating":3,"reviewer":"Der Golem","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2908161701","title":"The one app I can’t live without","comment":"What can I say about an app that gives me access to everything I have from my cell phone- simple intuitive fail-free. The biggest tech mistake of my life was switching briefly to another service which lost my data and treated my like dirt when I asked for help. There are few things I’d like Dropbox to change but they aren’t specific to the app. The only app bug I’d like to see changed is the folder size limit which does not apply to desktop versions. it has been an inconvenience to break up one of my large folders, but still worth it to have my whole life with me anytime anywhere.","rating":5,"reviewer":"Kaiaim","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2902570779","title":"Unuser friendly garbage.","comment":"The features are hidden so you have to click all over to try and find what you’re looking for. Once you upload files and create a folder to put the files in, it doesn’t let you add files to folders. You have to start the whole process all over. It restricts you to only sharing once a day, but they have the system rigged to tell you that you exceded the once a day limit when you haven’t shared anything at all today. If, I’m able to share this file today, I’ll never deal with this junk again. I’ll keep using the wetransfer website.","rating":1,"reviewer":"Natural Action Center","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2901043143","title":"Reclamo","comment":"Me estan cobrando cosas de esta aplicación y yo ni siquiera la utilizo 👿","rating":1,"reviewer":"ksbdinsklso","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2896205253","title":"Dropbox is Awesome!","comment":"I use this app all of the time and it’s exceptionally useful. I have found no bugs so far. It’s just excellent.","rating":5,"reviewer":"Zak Pugh","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2892460206","title":"It’s useful BUT...","comment":"My main complaint is the “recents” tab.\nI *REALLY* hate that there’s no way to disable or at least clear it. I use my Dropbox for a variety of files, from scanned docs to my pets photos, and sometimes opening the app to see a bunch of scanned bills when I just want to show my cat to an acquaintance can be frustrating, to say the least. \nBTW, the iCloud disaster should’ve reached everyone to not store nud3s in the “cloud”... 😂😂\nWith that said, Dropbox is useful. There’s little to discuss in this matter. \nBUT - and there’s always a BUT - use it with an extra layer of conscience. The “cloud” is just another person’s computer, after all. Don’t store your most private information there, especially in clear text or without any kind of cryptography. Think in-depth security, even though DropBox “promises” not to peek at your stored information, nothing really guarantees that someone will be able to access your info there.","rating":3,"reviewer":"Rhobson","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2890962779","title":"Current version super buggy","comment":"NEED A MEDIA PLAYER!!!\n\nKeeps playing whatever song I was playing last at random times, even after killing the app. Has also been doing a lot of freezing and restarting. Maybe if you had a media player....\n\nOtherwise app is an absolute life saver. Being able to coordinate large files with others and send links in a snap is fundamental to my professional existence.","rating":4,"reviewer":"Roy Willyfish","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2888540614","title":"can not set password","comment":"i can not set password for my dropbox , it’s embarrassment","rating":3,"reviewer":"nissan motor","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2887966777","title":"Too much money for notta lotta “service”","comment":"After the recent update, DropBox stopped working properly for camera-roll upload on my iPad. Their solution? Remove the app, forget the network, fully restart the iPad, re-connect to the network, and re-install the app. Seriously? Good thing I have nothing else to do ... oh, wait. Basement flooded. So yeah, I have something else to do that's rather urgent. Good news is that yes, this did in fact resolve the issue, but really, I have other things to do in my life than reset apps with updates that fail. Especially when paying $75/month for the business version. \n\nFor $75 a month I expect a MUCH better UI, amazing support, in-file search (not just the file titles), and so much more. Instead, we get the un/re-install merry-go-round, an ok UI, low-availability support (US normal business hours only), and an amazingly klugey sync setup. \n\nHeaven help you if your Mac has an external drive. What happens when you get a new Mac? It downloads everything from Dropbox again, even though all I did was remove the USB plug from the old machine to the new. \n\nGood job, Dropbox. Well done. Now I gotta wait for 4T of data to re-synch. Their super awesome support response? Well, we told you external drives might not work as expected. \n\nI’m totally looking for another service. Seriously, $900 a year for this? I feel like an idiot for locking myself into this “service”.","rating":3,"reviewer":"The Notorious t.i.g","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2878440917","title":".xml files show raw code - no longer preview correctly","comment":".xml files show raw code - no longer preview correctly\n\nrecent update broke viewing .xml files\nwebsite and app show raw code\n\nwill change my rating when this is fixed","rating":1,"reviewer":"psykken","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2872988616","title":"I don’t want it","comment":"Yet you charged me for it!!","rating":1,"reviewer":"djss12","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2865030848","title":"Won’t open","comment":"My Dropbox started to not functioning.. either won’t open or not uploading my photo from camera roll anymore.","rating":1,"reviewer":"Dickson Bearcomesout","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2860874918","title":"Bugs","comment":"The current version has bugs and keeps shutting down!","rating":1,"reviewer":"Dj Whizlam","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2848488356","title":"Love the app","comment":"Dropbox is a great app to store all memories in a safe place. You will enjoy the detail in each memory is saved in addition to allowing maximum space on your phone","rating":5,"reviewer":"Rastayouth83","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2844263546","title":"Slow","comment":"Went from awesome to slow as hell opening photos","rating":1,"reviewer":"FubarSki58","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2844187259","title":"Limit","comment":"Your limit on the amount of media being stored for free is not good at all","rating":5,"reviewer":"CmasterY","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2842556532","title":"102.2 Version. Closed Automatically","comment":"Update does not work! It will close automatically.\nErase the App and reinstall.... does not work!","rating":3,"reviewer":"Mfridzon","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2839888942","title":"Dropbox app","comment":"Invaluable communication tool! Very fast for how much it’s loading!","rating":5,"reviewer":"DancenetTV","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2837370240","title":"Latest update brakes photos (iPhone X 11.3.1)","comment":"Photos take up to 30 seconds to load when touching one while in grid view. This used to be basically immediate.","rating":2,"reviewer":"Sgxftwx","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2837303455","title":"Acting up","comment":"Usually this app works seamlessly but lately has been giving me issues with saving files. When I try to save (or export) an image to my phone, it starts the process but then the “exporting” pop up doesn’t go away and I can’t continue to browse photos because the pop up blocks it. I can only continue using the app after I close out completely then I have to go scroll back to where I was. It’s a bit of an inconvenience to have to close down the app after every photo I view/save.","rating":3,"reviewer":"131mon","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2837057431","title":"Last Update a Bust","comment":"I used Dropbox all of the time. Sadly each update slows it down. The latest update freezes the program or slows it down enough to be ineffective. I stopped using it. Fortunately I backed up my files on other clouds.","rating":1,"reviewer":"Skierbarry","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2836611715","title":"Cannot fix email","comment":"I put my email in wrong. Tried to creat a new account with the correct email and it says it is already used.  This is a huge problem.","rating":1,"reviewer":"KIHCRKB","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2834696985","title":"latest update broke text viewer for files with certain extensions","comment":"latex files with .tex extension can no longer be viewed in the text viewer. now have to view them in web browser. the older behavior is much better. all text files should be viewable in app directly.","rating":1,"reviewer":"kwxu","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2831122704","title":"iPad no longer allows me to easily attach DropBox files to an email.","comment":"I have done lots of research on this and have yet to find a solution that easily enables my iPad to attach Dropbox files to an email. So frustrating, what was once a great app is now almost useless.  Since when does a tech solution company make it their business to frustrate customers and send them running????? WOW! UNBELIEVABLE!!","rating":1,"reviewer":"Rarirod","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2829924534","title":"Frustrating","comment":"Like it because all my old pics are in it but haveing to verify 20 car\\bus\\sings images when u sing in is very frustrating","rating":3,"reviewer":"IsabellMomma","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2826871855","title":"Fast. Efficient. Convenient.","comment":"Much faster than syncing from my iMac. My iMac is older so Airdrop isn’t compatible with my iPhone X. Dropbox gets the job done in a pinch :)","rating":5,"reviewer":"deandreaxox","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2825204588","title":"Dropbox app not working since last update!!!","comment":"So frustrating. Since the newest update it is NOT working on my phone at all! Please please fix!! I’ll have to Star this a one but prior to the last update I would say a 5!","rating":1,"reviewer":"TD9988","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2824950015","title":"New Update Made App Unusable","comment":"Love Dropbox. The app doesn’t let me do anything now though. Just keeps trying to load.","rating":4,"reviewer":"R1A2E3","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2820753934","title":"Hate the nagging links every time you have to share!","comment":"I am so sick and tired of Dropbox making shareable links every time you need to share something. I have to share chess files in .pgn format. All I want it to share a 20-30 line text file so that it can be imported in another app for review. Instead the app forces and forces and annoys the heck out by offer a stupid link. Why can’t I just copy text. Either make a native way to run .pgn files or make the stuff easier. Very annoyed","rating":1,"reviewer":"Ritwick","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2820254025","title":"Where are my files????","comment":"I have old Dropbox files saved in Word & Excel on my iPad. When I go to the Dropbox app to delete the old files they're not there, therefore I can't delete the files; where are they? The old Dropbox files are clogging up my Word & Excel apps. I don't need or want those files anymore and the apps won't allow the files to be deleted from the app. Someone please help me delete the old Dropbox Word & Excel files?","rating":2,"reviewer":"pdcali38","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2819734925","title":"Dropbox","comment":"Una aplicación excelente","rating":5,"reviewer":"Franek41","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2809978314","title":"It has trouble.","comment":"After being updated in ios new version. When it is started it needs so long time.","rating":1,"reviewer":"용발이형","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2806654750","title":"Verification","comment":"This needs to be fixed ASAP.","rating":1,"reviewer":"IAMNGVII","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2806604606","title":"I love it","comment":"I have won a few auditions by video submitting. I always send the to theater using a DropBox link.\nIt’s easy for me to use.","rating":5,"reviewer":"Mujahid66","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2800442040","title":"Bad","comment":"Slowest  uploads ever takes so long to upload 50 pictures or videos","rating":1,"reviewer":"zSyntax","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2797303636","title":"The firewall","comment":"Fire wallllllllll","rating":5,"reviewer":"Jay2bell","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2793107204","title":"Awesome","comment":"So excited  to start using Dropbox to study. It’s great being able to use it anywhere!","rating":5,"reviewer":"Kat2019RN","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2791794646","title":"This app used to be great","comment":"Now it doesn’t properly upload photos. I’ve talked to their “support” many times and they basically throw their hands up and blame Apple. Google Photos is a lot better. And more powerful. Dropbox is getting Crappier and crappier, especially since the company itself does not care about its paying customers.","rating":1,"reviewer":"preferprivacy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2790861074","title":"Hate the new picture verification that I ca Hate the new picture verification","comment":"Hate absolutely hate the new picture reculpa verification that I can’t ever get right","rating":1,"reviewer":"roryjm","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2790383331","title":"No more free offline files","comment":"This is kind of a no no. You at least want to have your costumers have some offline files, but blocking it entirely doesn´t seem wise. Having so much other cloud options that actually do let you do that.","rating":3,"reviewer":"manfredvonrichtophen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2784377621","title":"Won’t work","comment":"Download went smooth. Upload my first set of files. Try to email them. Immediately says “ couldn’t share folder, you’ve hit the limit of invites you can send per day. Try again in 24 hours”. Waste of time.","rating":1,"reviewer":"nopenopenopenope2","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2778963948","title":"Easy to scan","comment":"I find Dropbox so much easier to use from anywhere I am than a conventional scanner. Best thing going.","rating":5,"reviewer":"revolations","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2778032308","title":"Music","comment":"When downloading music and playing in the app can you make an option where instead of coming out of the song to change it to another one, there’s an option to change the song while still playing the music.","rating":2,"reviewer":"Vhshhsjsvdvd.","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2776850171","title":"Really?!","comment":"If i couldn’t open my account for one year you are gonna delete it ?! \nI was in the hospital how i am supposed to open my email to check it?! \nI need my account back. You have to help me recover my data.","rating":1,"reviewer":"Pharmacist abrar y","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2770451950","title":"Help!","comment":"I’m unable to open, download, and/or print files.","rating":1,"reviewer":"Dwetha69","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2764920315","title":"Won’t let me save videos from my laptop to my phone","comment":"I used to be able to just transfer videos from my laptop to my phone just using Dropbox. MP4s and MOVs always worked but now it’s saying it can’t support those file types. What happened?","rating":2,"reviewer":"Twister the cat","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2757138100","title":"Multiplatform Solution","comment":"It gives what I need both in mobile and in my Linux desktop.","rating":5,"reviewer":"HugoLPECR","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2754965227","title":"Apples nasty little secret.","comment":"Data and cables.  When they just got their wrist slapped for admitting to slowing down phones, they were so apologetic they pulled the “manage iPad storage” button with the last update.  Leaving you with either chaos for data scattered throughout different brands than of “cloud” or use “the cloud” .....    scam. I can’t believe a co. Gets away in the guise of “protecting “ my data In 2018. They’re saying the cloud is more secure than my hard drive at home?  Here’s where it’s interesting. They’re holding your data hostage.  Those are my thoughts. That’s my family in those pictures. That’s my music and imagination. Not apples to Donald trump my data and tell me it’s in some interest of being green.  That’s the scam.  Green peace. Yes. Green peace. (Who I respect for their enduring passion and many accomplishments. Their failures are also epic. But more good than bad has come from their awareness, IMO...BUT) we’re walking..l Green peace Is the reason your cables are 35 dollars and last two weeks. U need to look it up. It’s too long. But relates to Dropbox. I’m not off topic. why isn’t everyone on earth speaking up? It’s actually a lack of freedom of information on the first tier: it’s inception. Your mind.  I’ve been hacked along with tens of millions that have hacked your cloud, even with the fee I pay you monthly that should insure my information at the VERY least. .   you funnel us... with really no other option at 9.99 month, to Dropbox. Who are you hiring for positive reviews ??  Recap: slapped on the wrist for slowing down phones. Had to admit it publicly.  Pride lost. Retort: data storage on an iPad was already a nightmare... no other options. your thoughts and you, paying them to protect what is yours and yours alone to choose where and what to do with. Read those user agreements. Sucker.  We are all sheep 🐑.  And I have no choice but to use it too... a musician for a living. Your secure and wonderful version of forcing chaos or compliance has cost me thousands ... and I’ve been hacked on your iron clad security.  Fraudulent charges and the whole bit. That’s not why I’m writing this though. I have a different point. why did my bank take care of what you are supposed to protect at ten bucks a month x’s ten million strong (10,000,000 x 9.99= a lot) . Just because they use the term green doesn’t mean they’re using the term to be green and impress you. It means it’s profitable to use the the word Green” as a tool , they are using to stick it in a place that’s bad for our society. Because you’re buying it without complaining.   Or at least intelligently arguing the topic. Defend your thoughts. It’s not a joke.  Dropbox shouldn’t need to exist.  And how about all those GB’s of data cable and apple make you shuffle on the internet and then pay for again for heavier usage ?  Dude. Think. Drop Dropbox and tell apple you’re bot happy. It matters.","rating":1,"reviewer":"Biznatchio","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2754616246","title":"Good","comment":"Good","rating":5,"reviewer":"Andrew park zz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2747702138","title":"Export button missing.","comment":"There is no way to select multiple images and export them to other apps (Photos on iPad)","rating":3,"reviewer":"Duncandraw","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2746991423","title":"Great service","comment":"Excellent and efficient service","rating":5,"reviewer":"Rplight","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2742860636","title":"Adding photos is a pain","comment":"I use apple devices and for me the hardest problem to get around is the fact that you have to add one photo or video from an external source at a time. For example, if I took five photos of my cats, I would have to add all five separately. Even google and apple lets you add more than one at a time. Other then that the app is great with the amount of storage it holds.","rating":3,"reviewer":"operations mgr miracle worker","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2741683111","title":"It just  doesn’t work well","comment":"They need a lot of work on this app","rating":1,"reviewer":"DisappointedUser1234","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2736211299","title":"Why","comment":"Hello Dropbox \n\nWhy can’t I download directly to my iPhone?","rating":2,"reviewer":"Bigsexydjnyc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2731911825","title":"Used to be a great app","comment":"This app no longer works with the PDF Max Pro app.  Now I will have to move everything to Google Docs. Why wouldn’t Dropbox update the app to continuing working with other apps.","rating":2,"reviewer":"Dragonjvn","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2731442866","title":"Fantastic app!","comment":"Dropbox is simply amazing !","rating":5,"reviewer":"Grm 77","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2727186767","title":"Long time user","comment":"While in app - With a recent update it is far to easy when scrolling to put a folder into another folder by mistake. \nThis causes problems and didn’t happen awhile back. Please look into changing back.","rating":3,"reviewer":"tcne","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2726838286","title":"Doesn’t work well. Broken support for share-to and drag-drop","comment":"Drag-and-dropping files from the Files app into the Dropbox app (you know, to upload something) doesn’t work. The file just disappears.\n\nAlso, the share-to extension menu crashes too. This means that you can’t send a file to Dropbox from another app either.\n\nThe only way to upload to Dropbox now is to either use the in-app uploader (which isn’t that great for access) or to use a third-party app that you’ve linked to Dropbox, and upload from inside that third-party app.\n\nHere’s hoping the devs see this. Hope it helps. Love the app otherwise!","rating":2,"reviewer":"A902450928543","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2723526489","title":"App frequently will not open","comment":"App will open about 1 out of 10 attempts. Have to keep rebooting device and hope that it opens.... App frequently will not open when saving photo to pdf through the print option  iOS 11.4 iPhone 6","rating":1,"reviewer":"OhhhDave","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2722400422","title":"Reader Mode and Editor Mode","comment":"I really want to know if there is any possibility to have a Reader Mode Option. While I am reading file through Dropbox, I always miss-touch the edit icon. If there will have a reader mode and editor mode option, it would be great!!!","rating":3,"reviewer":"Ester131106","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2717849715","title":"Fraud","comment":"Wife used drop box now for about two months. It as taken over 4 months to cancel the subscription which they are still charging us for. Only option left is to cancel the card number they are pulling it from. DO NOT BUY!!!!","rating":1,"reviewer":"Treeshaker0004","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2713854580","title":"The best storage device.","comment":"I keep photo files and documents that I can’t afford to loose on this.  It gives me peace of mind and access across my devices.  I depend on it.","rating":5,"reviewer":"Coucill","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2708792601","title":"Ripoff","comment":"Did a search for cloud storage and Dropbox was in the list. Just clicked to look at the info and was hacked. Mining software that charged my credit card, which I never entered the info, $45. I tried to contact them only to find out they have no legitimate contact info. It just runs in circles.  That was a month ago. This morning I get an email on an account I don’t use for my phone saying thank you for renewing your Dropbox account and charged my card another $45","rating":1,"reviewer":"dcdetector","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2695100253","title":"New Features","comment":"You guys need to add better features for audio files. I want to be able to have a section for my downloaded audio files and be able to play the song on repeat for that one song and be able to skip to the next song as well. It’s very limited and annoying that I have to swipe up every time and press play once the track has finished so it can replay again.","rating":4,"reviewer":"wvvyX","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2689953602","title":"New Dropbox and new phones","comment":"With the new iPhone 6.5and surface foldable phones and tablets Dropbox will be a hot item for every thing the bigger and faster items people want secure all in one place and storage that easy to use .I can see your phone and important bills going only to drop box someday,","rating":5,"reviewer":"zanwz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2689428423","title":"Does not Save to designated Folder","comment":"Can’t find docs in the Folder I moved them to. \nNo ability to rename PDFs, eg, 1254ZXC-298-DRMKL-667 is a typical example of how some files are saved as, which makes the Search option irrelevant!!\nPlease improve.","rating":1,"reviewer":"beangroovy2","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2688855833","title":":(","comment":"Almost all my pictures got deleted when the app updated and it is very difficult to contact them.","rating":1,"reviewer":"green868Fish","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2688728217","title":"Still no Live Photos support for Camera Backup","comment":"Dropbox is a reliable and great product for syncing but I have been asking them for years to enable the backing up of Live Photos and the feature just never appears.  I would be so happy if they used my feedback to make this improvement.  Google Photos does it, so I would imagine that Dropbox could offer this feature as well.","rating":2,"reviewer":"Jazz Thompson","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2685558023","title":"Perfect way to stay in sync with my files","comment":"Dropbox is the perfect way to stay in sync with all my files.","rating":5,"reviewer":"See KT","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2684850671","title":"Nice","comment":"Very Useful","rating":4,"reviewer":"Crackarmz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2684844516","title":"Am confused","comment":"I am not literate on a computer, and you make all these changes and I do not understand what is going on, so do not avail myself of all the things that can be done.    You really should have some simple way of explaining the changes you make and how to benefit from them","rating":2,"reviewer":"Coral cake","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2684142774","title":"More fluidity","comment":"As the title suggests, the app could benefit from more fluidity while scrolling and skipping through images etc. (I'm using an iPad Pro so it's definitely the apps fault). Otherwise it's very good.","rating":4,"reviewer":"The Rhythmist","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2684029584","title":"Dropbox critique","comment":"Supreme","rating":5,"reviewer":"mrs scruffy muffin","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2683637664","title":"Photo upload issues","comment":"Dropbox for whatever reason decided to use 5+ gigs of cellular data which I can only assume was from camera uploads. Dropbox support was non existent and now I’m $40 poorer from cellular data overage charges. First time I’ve had a problem like this in 10 years, pCloud and other photo backup apps haven’t had this issue.. I’ll be looking to switch to another service now","rating":1,"reviewer":"Cheerioboy25","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2679315837","title":"My favorite app!","comment":"I use Dropbox for all of my recipes. I have it on all my devices. At the grocery store and need ingredients for one of my recipes? I got it on my phone!!!! Many of my friends use this app to share recipes. It is also interactive with other apps. This is my favorite third part app!!!","rating":5,"reviewer":"Gammy na","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2679226465","title":"Pretty good","comment":"Still overpriced for wha you get. Wish the experience was as clean as google photos is for the photos. Files are ok. Decent iOS integration.","rating":3,"reviewer":"Johnny666x","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2678216897","title":"Trash","comment":"I found it very inconvenient. It wouldn’t take the email and password to sign in that I have used for years. With prior experience it is very tedious to do anything involving saving and sending files.😡","rating":1,"reviewer":"180patsyhegoat01","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2676173930","title":"Stine’s BD Party","comment":"Great pictures","rating":5,"reviewer":"Ernies 90th BD Party","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2674307228","title":"Capricious","comment":"Very capricious, won't open many of the types of files that I use, so ends up being unreliable and not very usable.  \n\nThis feedback dialog is an example of Dropbox user friendliness: I couldn't find a way to send it and luckily a Dropbox person was next to me, and I asked him and he told me I had to fill in the title.  Well, indicate it with a red star or something!  Geez....,","rating":3,"reviewer":"me1112112","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2672619627","title":"Slower Than DIRT!","comment":"With over 22,000 photos on my 128GB Apple iPhone 6s, now running iOS 11.4, I now have about 18 hours into my first backup, with just over 6,000 photos remaining.\n\nIf my home Wi-Fi backups are this slow, a restore won’t be any faster.\n\nNo thanks!\n\nI will continue with Google Photos, etc.","rating":1,"reviewer":"rod.musselman","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2672254677","title":"My go too solution!","comment":"Love the access to my data.  I dj so having access to my music and sharing my mixes is essential in growing my brand.  Dropbox provides the ability for me too do so.  Only option I would like is the ability to play more than one file at a time....essentially build playlist.","rating":5,"reviewer":"Phelo47","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2672119259","title":"Avid user","comment":"I have been using for years now without worry of being someplace in some meeting without necessary information. Does not matter which of the 3 computers am or am not using information is available by signing in, whether using Windows or IOS.  Love having documents available offline; planning for meeting in places without internet access.","rating":5,"reviewer":"Saywhy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2671926924","title":"Great","comment":"For me Dropbox is not an simple app to love, this is a great system that work hard.\nThere are many many years that is helping me as a really friend!\n\nThanks to Dropbox equip\nDariusch Zamani","rating":5,"reviewer":"Dario1st","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2670833301","title":"Lame commenting/activity function.","comment":"The commenting/activity box at the bottom is useless for me, and blocks the bottom portion of image files when in landscape orientation, or when zoomed in on portrait orientation. Why is there no way to get rid of it? I'm not sharing that image, nor collaborating on it, and am the only one with access to it. WTH?\n\nAnd even though I'm signed into the app, if I go to settings, help, contact support... I need to sign in again? WTH?","rating":1,"reviewer":"TweakRacer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2668129736","title":"Excellent","comment":"I have been a Dropbox user for many years. Many excellent features. One is the multiple backups to a file. That saved a very important file that crashed. Went to the file on Dropbox chose the backup prior to crash and was restored. Saved a panic attack.","rating":5,"reviewer":"plcman1914","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2667014425","title":"Cannot ever cancel!","comment":"I declined my renewal offers 10x, then went into app store and cancelled my subscription. YET i continue to be billed!  6 months later.  With no response.\nDONT TRY ‘FREE’ TRIAL!","rating":1,"reviewer":"mdwils","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2664998559","title":"Good","comment":"Please add a way to trim songs or videos please","rating":4,"reviewer":"LOL!!! ","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2659365367","title":"The best","comment":"Perfect","rating":5,"reviewer":"Jerome713","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2659198096","title":"Does not allow me to share!","comment":"Keeps telling me “You’ve hit the limit of invites you can send per day. Try again in 24 hours”. I haven’t been able to send 1 invite so I don’t know how I’ve hit my limit.    Fix it!","rating":1,"reviewer":"Edsgirl7","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2655849337","title":"Suggestion","comment":"If possible maybe add a continuous player to the app..  so subscriber can continuously listen to music.  Thanks","rating":5,"reviewer":"Vive1232","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2654705835","title":"#1 app!","comment":"This app is the best and the most secure. Have never had a problem with it and store all of my photos and docs. Love that I can pick and choose what to share and with whom. Super easy!!!","rating":5,"reviewer":"ESLAA33","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2653450295","title":"Almost Perfect...","comment":"Everything about the Dropbox app just works. It’s great. I’d love to see more functions added to the player for audio files (a repeat button, skip forward/backward 15 seconds, etc.). I hope they add this in future updates or even a paid version.","rating":4,"reviewer":"ColtsFanJQ","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2652506024","title":"It’s painful to move files to diff folders","comment":"It is so hard to move files from one folder to the other. On top of that I can see only five selected folders and then it keeps changing every time if I have more folders then I need to do so many clicks to copy in my case I have more than 10 folders it’s really painful. Your algorithm is not working well in terms Self learning.","rating":1,"reviewer":"Muki Regunathan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2651296784","title":"I LOST MY STUFF","comment":"I uploaded a freakin file and a few minutes later after downloading the file, I reload Dropbox and I lose my stuff. Help","rating":3,"reviewer":"Ejwndiwbdojd","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2650907424","title":"Dangerous - not secure","comment":"Upgraded to 1TB. After a few month ALL my files disappeared. If you are going to use Dropbox make sure you have offline backup.  You files are not secure in Dropbox","rating":1,"reviewer":"Rolfei2","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2648401671","title":"Just great","comment":"I’ve been using DropBox for years now. It just helps. It’s an amazing design and in the media design industry I can’t imagine working without it. Thank your Dropbox and team for all that you do!","rating":5,"reviewer":"Cinsound","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2648046394","title":"Important pictures","comment":"You never want to lose them. It great to have a location to go back for review and retrieval!","rating":5,"reviewer":"JFC in Maryland","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2647943793","title":"Why can’t this pull photos from google photos?","comment":"Haven’t really been able to use the app because all the pictures I want to upload are on google photos and it won’t let be pull pictures while on my iPhone.","rating":2,"reviewer":"derekkg12","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2647251046","title":"Great app! But allow hidden folders?","comment":"Dropbox is hands down amazing. I love the compatibility between devices, but it would be awesome if you could make folders hidden, maybe with a passcode? So that I’m the photos tab, not EVERYTHING is visible. Thank you!","rating":4,"reviewer":"canyonhunter1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2646845846","title":"Okay...","comment":"Hello,\n\nI just wanted to say that Dropbox is actually a really great place to store Office files, sorry if I was harsh earlier. I wouldn’t trust it with all of your files, because I’ve had a lot of issues with the iWork things and all that. The app itself works fine this way. Just wanted to say that.\n\nSuggestions:\n-Maybe we can do a one-time payment for a little extra storage? Like pay $1 for 2 extra gigs. I would definitely pay a few dollars for that.\n-Support for Apple files. As I’m writing this, there’s no way to edit Pages/Numbers/Keynote files from Dropbox. I use Pages a lot and so do a lot of other people, so you need to add support for those.\n-Once, I opened the Dropbox app and found that it wouldn’t let me create any Office files. (Like when I clicked “new file,” the option for creating Office files wasn’t there.) I signed out of Dropbox and tried to sign back in, but it said “there was an error” when I tried to sign in even though I got the sign-in info correct! This wasn’t a huge deal since I was able to log back in a half hour later with the create files feature back, but you might want to make sure it doesn’t happen again.\n-PowerPoint files take FOREVER to load up! (At least for me they do.) Please make it quicker.\n\nThank you for reading!!!","rating":4,"reviewer":"SwordInTheLight","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2646414337","title":"Useful but not cheap","comment":"It's l like owning your own little piece of the Cloud. I set up my back up utility to make an automatic nightly back up of my important directories. So I have total peace of mind even if my house burns down! I wish I could get more storage for my money!","rating":4,"reviewer":"Jphil23","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2644211173","title":"Good","comment":"I like","rating":5,"reviewer":"ngi lay","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2644196992","title":"Convient","comment":"I can see my documents anywhere I am.","rating":5,"reviewer":"DG Weiss","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2640766722","title":"Space getting smaller","comment":"The screen space at the bottom has a permanent comment section. Why?  I need the screen space so please make that section optional.  Please allow me to remove it.","rating":1,"reviewer":"grdavid","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2638306618","title":"Great App","comment":"This app is awesome. Totally recommend it.","rating":4,"reviewer":"Vicmd5678","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2638251563","title":"New update has ruined app!!","comment":"Dropbox used to be easier that I could attach my files in an email and download + open the file to my mobile phone. But this new ridiculous update has removed the easy attach file/download feature unless I upgrade to dropbox pro; which I can't afford. So angry I'm uninstalling this app!!!!!!","rating":1,"reviewer":"arcane16","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2638213414","title":"Please fix the problem","comment":"I use Dropbox for numerous things online, both business related and personal. In all circumstances I need to be able to interact with people on shared documents and the most recent update has made that impossible for some reason on my iPad. I’m sure I’m not the only one with this problem so it should probably be fixed right away. If not people like me will have to find other programs to use. That aside, before the problem occurred Dropbox was my go to on all of my devices. I sincerely hope this problem gets fixed.","rating":4,"reviewer":"D.James.E","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2633334376","title":"Wow so good","comment":"The app helped me a lot with stuff great app","rating":5,"reviewer":"Fonze8433","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2632357182","title":"Fix File Sorting","comment":"When I sort folders they never actually sort. Always sorted by alpha this stunts my teams workflow so much I had to stop and make this post. Everything else works fine. Fix Folder Sorting!","rating":1,"reviewer":"Street Cam","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2631994970","title":"Functionality to create Slideshow","comment":"I would love to have that utility.","rating":4,"reviewer":"Coles GP","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2630224134","title":"g","comment":"good laak","rating":4,"reviewer":"ccsd221","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2628741807","title":"Improvements","comment":"Appreciate that Dropbox is investing in some R & D and slowly it s paying off. Keep up the good work....miss carrousel! ....a lot!","rating":5,"reviewer":"john k g","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2628138117","title":"Crashing Issue","comment":"The app keeps crashing while saving after I scanned a document. Terrible loss of time.","rating":1,"reviewer":"Need This Function To Work","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2627960341","title":"WHY REDUCE THE SPACE","comment":"iCloud, OneDrive and other cloud storages give more space but you choose to reduce the space from 5GB to 2GB. Worst service strategy EVER!!!!!!","rating":1,"reviewer":"Bibini kwæsi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2626875852","title":"Horrid","comment":"This app on iPhone is just horrible not user friendly at all hard to add pics to folders and if you need to delete a lot of files at once  then clear out the rest of your day","rating":1,"reviewer":"Lew76","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2622120256","title":"iPad version screen real estate","comment":"The latest version of the iPad app does not handle documents well in full screen mode. The comments section obscures parts of my documents. I am a songwriter/musician and I use Dropbox to show my lead sheets. I have them all formatted to fit the screen perfectly. Now with the HUGE comments section, I have scroll like a half an inch. I’d be fine with zooming out but that doesn’t really work. What happened? \n\nPlease fix....I’d be happy to show a developer what I’m talking about. It’s very frustrating.","rating":1,"reviewer":"dorian-cane","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2621159892","title":"Dropbox","comment":"Hard to see photos on app on iPad.  Pictures seem like they are out of order.  Need better ways to download they off of Dropbox.","rating":3,"reviewer":"LizzyTish2 HHI","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2619162280","title":"Tre”s Graduation","comment":"Wonderful pictures . You captured your brother wonderfully. The colors look great .great job.","rating":5,"reviewer":"big sister jan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2618553273","title":"Dropbox","comment":"Dropbox is amazing.  Can’t say enough good things.","rating":5,"reviewer":"clkuser","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2617512087","title":"Still can't play more than one file at a time","comment":"Every update says \"we're always looking to make things better\" but after all these years it still only plays one MP3 file at a time. No shuffle and it won't even go to the next song without me hitting the back button and selecting the next song. Ridiculous.  I hate Dropbox.","rating":1,"reviewer":"Paul Haney","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2617472009","title":"Architect","comment":"Couldn’t exist without it.  !!!!!!!!!","rating":5,"reviewer":"Montana native","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2616508545","title":"Doesnt integrate with Excel on ipad","comment":"it appears the latest update disabled Excel from recognizing dropbox as an outside source file.","rating":2,"reviewer":"jte ktditf.i","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2616429457","title":"I love your willingness to help","comment":"How can we work better together?\n\nGustavo V\n(415)969-0096","rating":5,"reviewer":"GBMV6Speed","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2614375393","title":"DropBox is great. This App is not.","comment":"I use Dropbox every day, and love it. But this app is lacking: poorly designed, hard to get around confusing. \n\nThe only thing that makes Dropbox usable on iOS is, somewhat ironically, Apple’s cloud aggregator app, Files. It’s far easier to access Dropbox files from there.","rating":3,"reviewer":"Saltp1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2614258526","title":"Single best sync tool available","comment":"After testing every major sync provider, even rolling my own, Dropbox wins hands down. Other providers have issues consolidating multiple users’ edits, and multiple offline edits. Never had a single issue with Dropbox! Have been using it for years and cannot live without it.","rating":5,"reviewer":"IpsissimusMarr","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2613821297","title":"Download to camera roll","comment":"Ability to easily download multiple photos to iPhone camera roll has been removed. Please add.","rating":1,"reviewer":"Timbo907","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2613339869","title":"Great app","comment":"Very usful!","rating":5,"reviewer":"Eidas0815","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2613008621","title":"I wish...","comment":"I really wish Dropbox would include a media player for playback of all of my mp3 and media files. Not for public use, just my own private song list for me to playback and listen to..\nRobb L.","rating":5,"reviewer":"Walkin soundguy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2612960303","title":"Love this app","comment":"Great way to save all you’re pictures love this app!!","rating":5,"reviewer":"jP ELPROTOTiPO","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2612746591","title":"Love my Dropbox","comment":"Most excellent way to send a lot of photos.","rating":5,"reviewer":"Judy Bugs","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2612380764","title":"Dropbox audio","comment":"Dropbox needs to build accelerated speeds into its audio listening portion. 1.5x, 2x","rating":3,"reviewer":"free_adnan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2610484827","title":"Awesome app!!","comment":"Has saved me so much time. I used to download pics all the time but now it is done automatically! Love it!","rating":5,"reviewer":"B Sturgill","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2609979028","title":"great app","comment":"Dropbox is truly an amazing app.","rating":5,"reviewer":"Ljbnyc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2609938099","title":"I love Dropbox!","comment":"I have been with Dropbox from the very beginning and just love the accessibility to my files.\nThank you\nLHLindberg","rating":5,"reviewer":"Lyn Lindberg","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2609076065","title":"Can’t export more than one","comment":"Dear, \n\nWe can’t export more than one photo or videos one time","rating":3,"reviewer":"Faisal3lii","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2608527059","title":"Dropbox for photography","comment":"I do not know what I would do without dropbox. \nAs a photographer, I need to send large images to clients, which cannot be done through email. \nDropbox allows me to store the files, send  and view them at any time.","rating":5,"reviewer":"Kenstuf","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2606471008","title":"Great App 👍","comment":"This is a great app it lets you see your drop box files and docs make changes and share it.  The only thing is the chat box blocks done content.","rating":5,"reviewer":"Gorgeous hair","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2605520192","title":"Dropbox","comment":"Good app","rating":5,"reviewer":"m8v3n","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2604859499","title":"Dropbox","comment":"There are a lot of cloud-based storage systems on the market. Every application want to force there’s a Ponyo. But the one that works best across the platforms are use his dropbox. It’s the most easily organized, accessible, and shareable. And it works for all of my multiple lives in helping them work seamlessly but separately.","rating":5,"reviewer":"TRIII NY","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2604452465","title":"Dropbox is just awesome!","comment":"Dropbox keeps me well organized with all types of data by allowing me to sort them out into files & folders. It also allows me to share with others selected data, files, folders or all of it and even to allow others to make changes to selected or all data. Furthermore it allows one to share large files & folders. \nDropbox is just AWESOME! I can’t wait for the next improvements to come by!","rating":5,"reviewer":"mayerou","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2601039310","title":"Documents On The Go","comment":"Always there, online, offline, moving documents from one platform to another, Dropbox is your quick, easy, no fuss solution. It’s one of the cleanest layouts ever created (in my opinion). I would defiantly suggest giving Dropbox a try for anyone going to school or working in business. Other platforms exist such as google docs, or Microsoft office, which I also use, but Dropbox has them beat in speed of upload and download, and loading of page, AND ease of navigation.","rating":5,"reviewer":"Fan L33","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2600737398","title":"So useful","comment":"I love Dropbox, been using this app for awhile, so easy to use, makes moving pics or files from iPad to PC a breeze. Also sharing files and pics with everyone!","rating":5,"reviewer":"Desjoy4522","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2599923694","title":"Good but some glitches","comment":"I have had this app for over 8 yrs and have loved it but now I have had problems with files disappearing which I now I have accessed in the past weeks and afiles are missing this has been happening for the past year and a half the good thins is that I back up my docs on my hard drive \n\nIt’s good but lately they have some glitches to fix","rating":3,"reviewer":"leydz11","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2598843529","title":"Love Dropbox, But Less and Less w/ Time","comment":"The old Dropbox was magnificent in its simplicity but like all programs, gets bloated and messy as its management overthinks it and adds features and complexity. \n\nParticularly irksome is this relatively new feature of cluttering up the screen with all your recently added files before you can get to your main folder. Why, Dropbox, why? Just let me get to my folders, please, without having to scroll down. :-(","rating":3,"reviewer":"Hernando Conwi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2596982621","title":"Would be perfect if a basic editor is added","comment":"Instead of opening text and markdown files using other Dropbox-enabled apps, it would be great if a basic text editor is included with the app","rating":5,"reviewer":"TarekHoteit","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2596619234","title":"Not stable","comment":"Sometime Dropbox kicked me out of my viewing document then I lost my place when I went back in the same document and started at the top.   It also took long time to open an document.","rating":3,"reviewer":"lillychang","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2595675656","title":"A “must have “","comment":"I enjoy having such a great avenue on all my devices.","rating":5,"reviewer":"GrandpaNC","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2595437193","title":"No thanks Google","comment":"I deleted google from all my devices. Politarian BS. They squelch conservative values in place of communist ideals. Later! Dweebs","rating":1,"reviewer":"Eric mercer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2595272391","title":"Why use?","comment":"Why use this? Google Drive gives more free storage and their app is much better.","rating":1,"reviewer":"Whyterose7","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2585855035","title":"Dumb app. Don’t get premium","comment":"Doesn’t even really work.\nI subscribed to the free trial of the premium service but it still tried to charge me for it, even after I cancelled.","rating":1,"reviewer":"thunderheart396","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2583375150","title":"I don’t want to comment on anything","comment":"Get rid of the completely stupid comment system.","rating":2,"reviewer":"Deadpool616","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2583123491","title":"Crashed after 40 pages scanned","comment":"App would be good, but it crashed after taking pics of 40 pages while saving doc, had to redo from scratch. Horrible experience","rating":1,"reviewer":"Disappointed 12368459","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2580887868","title":"Excelente nube pero...","comment":"Todo está muy bien con esta app pero lo único que deberían corregir es la descarga en segundo plano, es incómodo cuando descargo un archivo pues debo esperar a que la descarga se complete para poder continuar.","rating":4,"reviewer":"Hdak","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2579478831","title":"y","comment":"الرجاء تحميل الدروب بكس باللغه الانكليزيه وليس بتلك اللغه اللي مو معروف قرعه ابوها من وين","rating":1,"reviewer":"يوجد اخطاء","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2578611590","title":"Export as file, not links","comment":"The app in former versions would export actual files, not just links to Dropbox.\n\nThis is a major hassle as a lot of the business I work with are unable to load external links. If I have a PDF in my Dropbox, I can only send them a link from the iOS app, not the actual file. \n\nIt won’t even allow you to export a PDF to iBooks as a work around. \n\nPlease address this issue, your paying business customers will take great advantage of this option.","rating":1,"reviewer":"Apple Admin Svc.","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2566524652","title":"Great mobile app","comment":"A great app that keeps me productive even when I am on the go!","rating":5,"reviewer":"jasonlyman","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2565078415","title":"great","comment":"great","rating":5,"reviewer":"kafranklin","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2564563112","title":"Horrible","comment":"I've used Dropbox for years and loved it but for some reason they've changed something majorly and it's horrible. I've texted and emailed and gotten no answer....i used to be able to see my files when i was on the road from any of my devices, they used to sync nicely\nNow nothing syncs, plus a feature i loved veggie was being able to edit or add something to a file, no more :(\nIf anyone has a clue on getting these two features to work again, I'd love to hear it. I'm a realtor and need to see and work on my files enroute without having to drag my pc everywhere","rating":1,"reviewer":"LindaF520","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2564422686","title":"Love the doc scanner","comment":"So convenient to be able to scan my papers and receipts and have them go straight to Dropbox!","rating":5,"reviewer":"Dislikes crashes","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2560705768","title":"Awesome app","comment":"So easy to get to my files from anywhere!","rating":5,"reviewer":"Faceless iPhone User","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2560500568","title":"I can do work from anywhere!!","comment":"Thank you Dropbox. I love how I can get so much done while I’m commuting to and from work. Allows me to have better work life balance!","rating":5,"reviewer":"Pixee83","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2557498918","title":"Poor Support","comment":"I have to rate you low to get your attention.\n\n- I’ve been hacked, home computer compromised, all accounts accessed. Hacks utilize java, hidden xml code in file names as an \n\nextra extension on file names i.e. \nNormal - vs. - Corrupted  \njournal.doc - vs. - journal.doc.date\n\nApp appears to be sudo secure, but my dropbox once had documents. They cleaned them out, and I bet they did bypassing your security. They have the GOD Network Admin for pushing out windows updates. You’ll see, if you notice at all, java update lower right corner of your screen. there is some sort of java exploit and everything is vulnerable allowing Java.\n\nSpeaking of which; I am amazed and bewildered that company’s put so much money, time, and effort... into building a robust superior application, yet provide inferior support from the app. A simple tagline in users account of the app “Need Support, Report A Bug? Click here” \n\nBTW Your website is Java coded which I have block on this iPhone, thus not able to contact you through standard procedures.\n\nSO MY QUESTION TO TECHNICAL SUPPORT;\n- If I did not delete documents from my account.\n- Dropbox did not delete documents from my account.\nQ: WHERE DID MY DOCUMENTS GO?\nQ: WHY COULDN’T YOU DETECT THE COMPROMISE?\nQ: ARE MY DOCUMENTS RETRIEVABLE ON ANY SORT OF BACKUP?\n-? Is there a report showing that their was once documents their??\nFeel free to contact me: seattle area code 7158950.","rating":1,"reviewer":"LeonHambrook","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2556884350","title":"Good, but no photo albums anymore","comment":"The app is good, actually great, except they took away the ability to create photo albums. I discovered this when I went to go view my albums and they were all gone!! 😡 Bring the photo album option back and I'll rate it a 5, but for now, it doesn't meet all of my needs.","rating":3,"reviewer":"Nickname better be available","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2555182654","title":"Features","comment":"Please bring back Facebook Login Support to the Dropbox App...: I loved years ago how your website also allowed me to Login using my Facebook Credentials too... I vividly remember in the past being able to select a file in the Dropbox App and the Open With command enabled you to open say for instance a PDF file in any eBook reader app or being able to use it for opening a MS Word Document in Apple's Pages for iOS too.","rating":4,"reviewer":"Craigwd_2000","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2555182654","title":"Features","comment":"Please bring back Facebook Login Support to the Dropbox App...: I loved years ago how your website also allowed me to Login using my Facebook Credentials too... I vividly remember in the past being able to select a file in the Dropbox App and the Open With command enabled you to open say for instance a PDF file in any eBook reader app or being able to use it for opening a MS Word Document in Apple's Pages for iOS too.","rating":4,"reviewer":"Craigwd_2000","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2554320914","title":"A fraction of OneDrive functionality","comment":"I haven’t seen the issues of others but Dropbox is simply a poor value compared to a service like onedrive. Dropbox give 1 TB for 100 a year. For that cost, you can get a family plan of onedrive with five 1 TB accounts plus full MS office and an hour of Skype calls for each of the 5 accounts. Dropbox will have to drop its price in half to remain competitive with these other services or it will not be around in 10 years.","rating":3,"reviewer":"Simdude","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2554055678","title":"Great service, Terrible App","comment":"I just hate everything about it.","rating":1,"reviewer":"tgwaste","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2553300678","title":"Important","comment":"I want to know about why am I sending and sharing files through your app. And I haven’t receive any information on how to get paid for the streaming part of Dropbox. I pay for the service but in return we need to discuss about streaming music.     I need answers or I will switch to another developer","rating":1,"reviewer":"SplashMan 713","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2549910387","title":"Makes me have too much of a headache","comment":"The apps one purpose is to be used as storage and it dosent even get stored no help if what it less help more of a pain in the back this is the first app I have rated and this app deserves a bad rating the people who read the ratings first before downloading are smart.\n\nThis app overall is just a waste of time good ratings are people who havent found the good apps yet.","rating":1,"reviewer":"idhd83","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2544458807","title":"AWFUL","comment":"They never let you cancel!!!","rating":1,"reviewer":"Tiajan11","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2544268174","title":"Awful if not impossible user interface","comment":"I paid for this for one month and now it is impossible to unsubscribe. You make it impossible so you can keep taking money from people. Cancelling my card just for this stupid app. Wish I could give it 0 stars.","rating":1,"reviewer":"kt5825","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2542026227","title":"LIVE PHOTOS!!!!!","comment":"It’s a good app to me, i just wish they did something about live photo’s. If i export it back to my camera roll, it isn’t a live photo anymore. if they update it to make this happen, this app would be perfect 💯💪🏾!!!!!!!!","rating":4,"reviewer":"Meech‼️","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2533308017","title":"Destroys Live Photos silently","comment":"If you use Dropbox to backup your photos, you’re losing Live Photos. I lost all the movements of my new born and thank god I was using Google Photos in parallel, so I recovered some of them there. More recently Dropbox free refused to backup my photos unless I signed up for a paid plan even though I referred 10+ customers over 10 years. So I have decided to become a paid customer — of Google Drive.","rating":1,"reviewer":"Sfpirate","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2532852996","title":"Didn’t want this","comment":"Had to download this app just to view 1 pdf someone shared with me. Can’t just let me view it in the browser?","rating":1,"reviewer":"Logan_Lagoon","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2524934269","title":"stupid","comment":"Why not support drag and drop？","rating":1,"reviewer":"滑稽无处不在","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2524698771","title":"App not working","comment":"Some error code keeps popping up","rating":1,"reviewer":"Pusscat6558","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2520167324","title":"Good but can be better","comment":"Primitive user interface. Old generation. My advice to Dropbox, learn from others. See their apps.\nExample of bad interface; if I want to create new folder; 1. Select(+). 2. Select create folder. 3. Select new folder. 4. Type the name of the new folder. 5. Press done. 6. Select Create. My God, six steps. It should be like this; 1. Select (+). 2. Select New Folder. 3. Type the name and Done. That's it.","rating":3,"reviewer":"حكيم الملك","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2519915955","title":"IOS and Dropbox integration so buggy","comment":"This used to be a great relationship but now every document can’t be stored or renamed the way one wants because Dropbox and Pages are trying together to become metastorage for everything. It’s confusing and bad for organizing materials.","rating":2,"reviewer":"littlepuck","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2515913680","title":"You are not going to believe this","comment":"I am a person that make a living with pictures and videos, I have been doing this for 8 years, and all those 8 years looking for an app that saves all of my data, that is free and has unlimited storage, GOOGLE PHOTOS has saved my life, but 7 months ago I have been having problems uploading, it randomly deletes my uploads... I tried everything and now I have no choice but to look for another one, I said okay, let me try dropbox for the 5th time AGAIN and see what happens.... its still trash, takes days to upload videos and pictures when I need ONLY SECONDS like my other apps did, I cannot believe this app has not gotten better for 8 years!!! I had to write this because its beyond my belief how hard it is to keep photos and videos forever.","rating":1,"reviewer":"Julijulijulijulii","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2512773742","title":"Terrible service. Deleted all of my family photos without permission.","comment":"Wish I could go back in time and never uploaded my family photos thinking they would be safe.","rating":1,"reviewer":"Chipgau","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2511968225","title":"Mad, Frustrated and Disappointed at Camera Uploads","comment":"I have Dropbox Business and Dropbox Personal. I pay for my Business account but it will not allow me to have camera uploads. To do that you need a personal Dropbox. I downloaded the personal Dropbox and in order to use the camera upload it wants me to upgrade to Dropbox Plus! I am a preacher close to CUSSING because of this stupidity!!!","rating":1,"reviewer":"cmaneice","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2511242629","title":"Really bad","comment":"Just keeps getting worse","rating":1,"reviewer":"Bah bahahaha","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2509247147","title":"No slideshow","comment":"Moved my photos to paid Dropbox account - overall happy but no basic slideshow is a showstopper for me :(","rating":3,"reviewer":"kevin6412","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2505856591","title":"Not working for me","comment":"I cannot add one file to that box, not recomended","rating":1,"reviewer":"Iki123458976","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2505096827","title":"Love the app","comment":"Use the app frequently on my iPhone.  Need an Apple Watch app!!","rating":5,"reviewer":"ousue","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2501293583","title":"Folder FIAL","comment":"What did you do?? The entire planet organizes data hierarchical but you decide to just load recents and years?? FIAL! Fail wicked haahd. Bring back my folder structure like Apple and OneDrive do.","rating":2,"reviewer":"Rob4G1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2500065959","title":"Deleted files access via app","comment":"I have an iPhone 5s. The version of your app on my phone does not allow for the deleted files to be viewed. If it weren't for this I would give the app five stars.","rating":4,"reviewer":"JWOss","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2499988732","title":"Cost for Plus","comment":"I am very annoyed with the App in that they are pushing the Plus versión but do not publish the cost. I’ve used the tool a long time. Not problem paying for a bigger version if the price is right. But I’m not going to hit a FREE TRIAL button without knowing the cost at the end of that trial. \nAlso, Apple should insist on an OPT-IN option at the end of the trial period, versus the current need to OPT OUT before it Bills whatever the price is.","rating":3,"reviewer":"Bob Hunt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2496894835","title":"Pretty good!","comment":"Overall it’s a well made app, perfect for moving files between devices. I don’t use it very often, but when I do it’s handy. Personally I wouldn’t recommend the paid version, but besides that, very well made and easy to use!","rating":4,"reviewer":"009milo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2496766704","title":"Constant crashing","comment":"The app will constantly crash when I’m offline or online, I even tried uninstalling the app and reinstalling it, it didn’t work at all, please respond and fix the issue please.","rating":3,"reviewer":"JTH ONE","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2492780872","title":"Not user friendly- hard to use with other apps","comment":"I cannot figure out how to take pictures from here and put on Instagram. You would have to save to camera roll first. It’s just not user friendly. I only use this app when other people send me pictures this way. Otherwise, I find it very limiting.","rating":2,"reviewer":"Cmlohnes","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2492777369","title":"I hate it","comment":"It’s hard to use. I just started using it and they are already asking for payment. I never wanted the professional version in the first place. I wanted the free version but never located it in the Apple App Store. I’m on a limited budget so I can’t afford to pay extra for anything.","rating":2,"reviewer":"jkolmen50266","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2490216451","title":"Won't say how much it costs","comment":"The base app doesn't allow me to access files offline. If you want to do that it pops up a screen where you can click to \"learn more about plus\". When I do that it converts a bunch of information I don't care about (1tb storage, yes goes will be available offline, would do some stuff with my phots if I gave it access -- which I wouldn't!) But it doesn't indicate the one thing I want to know: price. \n\nIt's free for 30 days -- and how much after that? \n\nComing to the app store, it also doesn't indicate price. It just says free for 30 days. But I think if you click on that button, you're agreeing to let them rebill you monthly at whatever they think the rate or to be. Nice","rating":2,"reviewer":"w0nderd0g","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2484169492","title":"Service=good, App=bad","comment":"I synced all the files I needed for my trip to both my iPad and iPhone, so that I would have backups. >10 gigabytes on each. I put them in airplane mode to check that I had access - so far so good. \n\nOn the actual trip, the files I had “made available offline” were not available offline, and I wasn’t able to do what I had planned. And yes - I checked storage on my iPhone/iPad - both showed Dropbox taking up >10 gigabytes of files I could not access. \n\nEither make files available offline, or don’t. The worst you can do is tease reliability and then punish your users for trusting you.","rating":1,"reviewer":"Thalesian","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2484154931","title":"The latest update ruined this app","comment":"This app is now garbage. I can no longer view any of my files conveniently. Instead I am told that I am offline. I thought updates were supposed to improve functionality.","rating":1,"reviewer":"Kesando","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2481057672","title":"CEO","comment":"Ripped us off for $400 !","rating":2,"reviewer":"rhodeslane","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2479480099","title":"THE Best Backup SoftWARE","comment":"真是太好用了 比如在线观看视频 还能窗口化 边做笔记","rating":5,"reviewer":"ruikeimba","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2477037158","title":"Meh","comment":"Paid user here. No proper file sort. Horrific use of space design-wise after how many years? Excellence in file management / server based storage isn't rocket science.","rating":1,"reviewer":"diiiiiiiil","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2475519974","title":"Years","comment":"Takes years to upload anything.","rating":1,"reviewer":"Rusherhehrhrhhe","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2463461376","title":"F is for file names finally!","comment":"Updated: Thank you for giving users the ability to read the names of files on an iPad screen!\n\nUpdate: Why can’t I read my file names on a gigantic iPad?! Why do you keep issuing update after update after update without addressing the fact that users can’t READ THEIR FILE NAMES. This is just basic. Wo...d t...s re...w be b...r if I w...e it like this? No. Fix it. I can read more on an iPhone. \n\nIt is astounding that after all this “design” work, you still cannot read a long file name on the iPad. The screen is more than 8 inches wide. This is ridiculous.","rating":4,"reviewer":"nellysisgone","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2459221829","title":"chuck","comment":"So you don't hear our mishaps or wants ,but ther is a update and nothing shows me how to upload anything into drop box self explaining?","rating":1,"reviewer":"Chaster18","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2458995951","title":"Refund","comment":"I did not want to be charged for the service and the app did not specify how and when I need to delete/cancel my service","rating":2,"reviewer":"Bb. iight","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2455023965","title":"Died when uploading photos","comment":"Unexpected shut down when backup my photos from Iphone.\n\nHappened very sadly after recent upgrade.\n\nplease fix this bug!","rating":1,"reviewer":"你是一个钱包啊","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2454277255","title":"No accountability","comment":"Received an email about them upgrading my account and charged my listed form of payment through apple. Also states they can’t issue refund or provide an invoice. It doesn’t even have the cost that they charged me. What a unethical cowardly way to make money. Business tactics deserved to be investigated and shut down.","rating":1,"reviewer":"zantasty","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2450655690","title":"Great at syncing bad at organizing.","comment":"The biggest problem within the app for me is the sort by “modified date” especially for photos. The sorting is neither done by the date the photos were uploaded to dropbox or the date the photos were taken or modified. Basically if I want a photo that I uploaded from my camera roll a week ago i would not find it easily, because dropbox is confused, sometimes it would by the date uploaded or the date taken(like in iPhone camera roll). Anyway, it is confusing.","rating":3,"reviewer":"Ald7mi2007","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2447225958","title":"Horrible","comment":"I did not want to subscribe and can’t unsubscribe and my card keeps getting charged","rating":1,"reviewer":"RedRealli","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2446697241","title":"LMMDay","comment":"From product design, to strategy development, alongside shared marketing materials, Dropbox is our go-to large file sharing tool. As a global organization, World Bicycle Relief works in several time zones with various levels of robust to nil wifi access. We need efficient connectivity which multiple officers can access and without the stress of digging thru emails in search of links. It's all there, well composed, at our fingertips.","rating":5,"reviewer":"LMMDay","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2446696937","title":"Only works intermittently with Apple’s Numbers apps","comment":"I have been using Dropbox for longer than I remember and have dozens of Numbers charts saved there. Recently, when trying to overwrite an existing spreadsheet with a newer version I began receiving an error stating it was an invalid file type and could not be saved. What!? I ALREADY HAVE THIS EXACT FILE SAVED IN DROPBOX, HOW IS IT AN INVALID FILE TYPE? If I keep trying multiple times, like a dozen sometimes, it may eventually work and overwrite the existing older version of the spreadsheet but I don’t always have the time nor the patience to continue trying multiple times. FIX THIS!!!!","rating":2,"reviewer":"LtlRedX","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2440911390","title":"Keeps Crashing","comment":"Will not work, it keeps crashing. I deleted and reinstalled but will not stop crashing.","rating":1,"reviewer":"JKM2159","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2438306028","title":"Horrible Update","comment":"Updated drop box a moment ago and nowhere did it say it would take the auto camera roll upland. Now you either have to upgrade by paying for a subscription or connect to your computer. The point of downloading the app was the convenience of being able to upload and back to my camera roll away from home.","rating":1,"reviewer":"lunamoon25","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2438009915","title":"The everyday must","comment":"This is my first app review. And Dropbox well deserves it. Simply put, this is the best app of the hundreds on my iPhone. Can’t live without Dropbox for a single day. Better than all the other cloud services I use. The only issue that occasionally happens is that files uploaded from iPhone can’t be opened on the computer. It causes a little inconvenience, but not a big deal as long as you have a backup cloud service.","rating":5,"reviewer":"Dazedpuppy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2437598456","title":"no rtf text edit functionality","comment":"I was convinced to start using Dropbox.  I have thousands of rtf (text edit) documents.  I cannot edit them in Dropbox app, which makes the promise of mobile work pretty useless for me.  This is THE native text format for Apple.  You’d think Dropbox would have it functional in their iphone app?","rating":1,"reviewer":"Bengilworth","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2437060447","title":"Horrible customer service","comment":"I purchased and paid for the upgrade and it has not shown up on my Dropbox account. They did manage to take my money though. I have been trying to contact someone for 5 days and have gotten no response. 😕","rating":1,"reviewer":"mobugsmom","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2435921811","title":"Screwed their original customer base","comment":"They decided to target businesses years into inception and made it utterly impossible for PAYING LOYAL individual consumers to do anything to organize, albumize, or smart label and search their photos. I’m taking off work to do whatever it takes to copy and transfer my thousands of pics and videos over to GOOGLE PHPTOS, and will be canceling this service and demanding a full refund with my credit card company backing me. It takes a lot for me to negatively review anything but I thoroughly hate and abhor and am disgusted by dropbox","rating":1,"reviewer":"robinlilly423","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2435171415","title":"Saves me EVERY DAY","comment":"I have three email accounts. I have a laptop and 2 computers at home and when I worked, I also had a work computer and work laptop. Keeping up with file transfer between home and work was impossible. Then, my IT guru introduced me to dropbox.\n\nI can now access all of my files thru Dropbox from my PHONE! When I need a medical research article to explain a treatment decision, I simply pulled up my Dropbox, went into the specific file, took a screenshot and sent the picture. I also filed my PowerPoint lectures and I did the same thing, namely take screenshots of key data to inform my colleagues.\n\nOne other very useful feature is that I have drop boxes with some of my financial advisor’s. I can upload secure documents without having to worry about secure transfer if sent by email.\n\nThis is the greatest thing since sliced bread. I don’t know what I would do without it.  \n\nA very satisfied user!","rating":5,"reviewer":"Dropbox Fan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2434850868","title":"Woohooo Drag and drop finally!","comment":"I’ve been waiting for drag and drop and today feels like Christmas","rating":5,"reviewer":"A typing monkey","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2432689955","title":"They don’t care about identity theft.","comment":"I reported an unauthorized account, suspecting someone stole my PayPal information. I immediately reported it and was able to get into the account from resetting the password on the email. I then secured it. I was able to cancel the membership I never asked for. When I did that, the fee was reversed. So I essentially fixed my own problem—except I wanted to make sure the account was deleted and that there weren’t other accounts that I didn’t know about. I didn’t hear from Dropbox for days. They are closed on weekends, which is bad for identity theft situations. When they did respond, their rep (Dan) tried to say I signed up for a trial. I never did and had indicated I had zero contact with this company prior to this. He was condescending, rude, and completely callous to the fact that my personal account information was compromised. He offered zero solutions and did not answer my questions. I responded back in a pretty upset way and he continued to insist I must’ve done it, taking no responsibility whatsoever to assist me in making sure I was not in further jeopardy. His actions have guaranteed I will never patronize this business and will tell everyone I know to not do business with them. Dan has no business dealing with customers and is an embarrassment to service professionals.","rating":1,"reviewer":"the_wordgirl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2427709069","title":"Storage","comment":"I used Dropbox for years. Basically ever since 2012-2013. You guys gave me 50gb when I invited others and connected Dropbox to my laptop. How could you take away all my storage. That’s so messed up.","rating":3,"reviewer":"Pinoy hipster","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2424642886","title":"Forced to download app to view photos","comment":"I couldn’t view an album shared with me on my phone without being forced to download the app. 1 star rating until this abhorrent business practice is stopped.","rating":1,"reviewer":"Andreww009","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2424638585","title":"Great but","comment":"This app is great but it would be better if they added a replay and shuffle button for song files","rating":5,"reviewer":"candy popin","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2419387893","title":"Photo moving","comment":"I tried to move photos from my Dropbox to my iPhone and unfortunately I was only able to do so by selecting photos individually instead of selecting groups of photos. I recommend this single selection NOT be a thing for the next update.","rating":2,"reviewer":"Tink-95","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2419012516","title":"Can’t save a file to photos anymore","comment":"You can’t download or export a file to your photos app on iPhone.  The only way to do it is use another app and then download it to photos. Pretty useless at that point if you have to use a second app to send a file to someone.  You can share access to the file but it confuses the person you send it to them they can’t download either.  \nWas a good app but now useless for my needs.  Will find a more user friendly app.","rating":1,"reviewer":"gdp1320","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2403528517","title":"App Won't Load","comment":"Using version 90.2 on iPad Mini 4, Gold, 128 GB, on iOS 10.3.3. The app opens to blank white and never loads the app. Restarting the iPad doesn't fix the issue. My iPod 5 launches the app fine on version 24.2.","rating":4,"reviewer":"LoganL2","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2399991040","title":"Latest update...hmmm","comment":"Ever since you changed the icon, been having issue finding files. I find them, but takes waaaay longer than I'd like. I guess someone thought this would be a great idea, but they obviously don't use the app everyday!","rating":2,"reviewer":"fullbird06","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2398990024","title":"Making Digital Media Easier","comment":"As a digital pro I am so happy to have access to files from literally anywhere. Thank you!","rating":5,"reviewer":"Nchantedrain","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2396891930","title":"Latest version for iPhone","comment":"Printing from Dropbox on the iPhone works fine but for the love of God please allow me to print “all” files within a folder with the click of a button.  For instance, if there are several PDFs in a single folder on dropbox, I shouldn’t have to print 1 at a time.  I’d like to be able to select all the PDFs in a folder and print them with 1 or 2 pushes of a button on my iPhone.  As long as the files are of all the same format, for instance jpegs or word files.  It would make the app so much better","rating":4,"reviewer":"Pixelwizard","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2395923260","title":"Worst app ever","comment":"I can’t do anything on it. Way to hard to understand","rating":1,"reviewer":"lunatunajr","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2395607384","title":"DropBox API","comment":"Dropbox API app console to increase your apps user limit. \nWould like to Link my app to a Could Music Box but can Not","rating":3,"reviewer":"sueannrobinson","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2394091510","title":"Breaking up is hard to do","comment":"I’ve been using Dropbox for years and years, but it doesn’t want to sync my excel spreadsheet changes across platforms any longer. This is a real problem with my household budget changes. In fact I lost my data of the past three months last week and had to recreate from memory. Not to mention the when I open excel to make changes, some really weird color changes happen that makes it difficult to even read my spreadsheet. Here’s hoping I don’t bounce a check. I hate to breakup but you’ve lost your functionality Dropbox and we just can’t go on like this.","rating":2,"reviewer":"Laurie in Jersey","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2392916768","title":"Okay app","comment":"Mine also tends to show many missing dates and also doesn’t delete photos properly the first time!","rating":3,"reviewer":"Gilfromtx","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2389183154","title":"Charge money","comment":"Hello, I use basic for free, but today app tried to charge me 3 times!!! I didn’t have enough money on card. Anyways, I didn’t buy anything why did you want to charge me?","rating":1,"reviewer":"Наталия Вольхина","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2388472242","title":"Lame app","comment":"To much verification to log in. What a pain in the butt.","rating":1,"reviewer":"USU EE for the win!","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2387957196","title":"Photo upload is terrible","comment":"After all those years, photo upload is still terrible on iOS compared to android. Otherwise, it is an excellent syncing app.","rating":3,"reviewer":"Tirkwaz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2381108831","title":"Best cloud storage - hands down!!","comment":"After using google drive, box, iCloud, OneDrive, this is by far the most elegant cloud storage available.  90% of businesses shouldn’t even consider local on prem file sharing servers.  With full Compliance, data integrity, back up, disaster recovery, permissions, ease of use, and your data wherever and whenever you need it... off any platform... nothing more to ask for!! Thank the you for years of continued storage across all my computers and devices.  I do miss carousel!!","rating":5,"reviewer":"macmaven234","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2380595425","title":"Unexpected error has occurred","comment":"The app worked great, at least for what I’ve always used it for. The latest update all I get is “Unexpected error has occurred”. It worked just fine one of my iPads, just not the other one. I was curious on if it was the latest update, and stupidly I updated it and my curiosity was confirmed.  It no longer worked on the previously working iPad. Please fix this!  The Dropbox community website offered zero help on this situation. I’ve tried signing out, deleting the app, reinstalling, and restarting my iPad to no avail.\n\n I guess this will never be resolved. I loved the simplicity of Dropbox, but this is getting ridiculous.","rating":1,"reviewer":"Former Greedy Republican Fat Cat","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2380335928","title":"DropBox is a feature","comment":"This app is okay, but so are the 40 other file storage apps. If you are paying for drop box, ask yourself what differentiates value are the providing. Don’t get comfortable because this is all you know or have used it for five years. There are various other apps and services that easily accomplish what is being charged for in this case.","rating":2,"reviewer":"Arvhix","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2379296227","title":"Bugs","comment":"I’ve use Dropbox for a while and I’ve seen bugs all over the program but lately I’m not able to sign in on my phone at all. I get “phone internet connection” issues from all options of signing in with google or creating a new account. My phone doesn’t have any internet issues and I have the latest version of drop box using on iPhone 10. I’ve been on all forums and nothing helps. Poor poor programming. Not sure why even create a mobile app like this. Deleting.","rating":1,"reviewer":"ZelonB91","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2377160221","title":"Useful and incredible tools!","comment":"It really makes my life easier!","rating":5,"reviewer":"Paiiii","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2372525099","title":"Ugh","comment":"This movie is TRASH","rating":1,"reviewer":"OGGABOGGANIGGA","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2368939107","title":"Photos not sorted correctly","comment":"I might use it if It didn’t sort hundred of photos as “missing dates”. Somehow google photos manages to sort everyone of these same images correctly. Dropbox support will say it must be missing from the metadata. If that’s the case, how is google photos able to sort all of them correctly?","rating":2,"reviewer":"yarnalt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2367607624","title":"Constant freezing","comment":"This app was previously fine, but ever since a recent update, it’s nearly impossible to get my photos uploaded. The app freezes almost constantly while uploading.","rating":1,"reviewer":"Rob328e36","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2367187485","title":"Batch photo save feature?","comment":"App is overall good. Hope I could save multiple photos on dropbox to camera roll without clicking export for every single one of them.","rating":4,"reviewer":"tuna1037","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2362277401","title":"Worst Customer Service EVER","comment":"I downloaded this app. Synced my notes from another note app into Dropbox. When I looked for my notes, all the titles of the notes are there. However, every folder is empty. I’ve done everything I’ve read to do, but still no notes. I wrote to the company asking for help. I have heard NOTHING back from them. I had some personal notes that I wanted to print, when my printer is fixed. Now it seems they are gone forever. I was using the free basic version. Maybe that’s why they don’t have time for my problem. Terrible app and terrible customer service - actually in my case - no customer service!!!","rating":1,"reviewer":"The Grammy of 5","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2360423692","title":"Not an okay business practice","comment":"Normally, I wound never rate an app poorly unless it flat out didn’t work. Dropbox has really dropped the ball with their sharing options, though. I can’t receive a shared folder with out upgrading and paying money. It’s not even a large folder. Take a hint from google drive and give us a larger default space, or at least let us view files stored in someone else’s Dropbox with out paying.","rating":1,"reviewer":"Parkergorecki","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2358333047","title":"Reliable. One improvement suggestion","comment":"I have used Dropbox for 5 years now. I have played around with iCloud and google photos and my files - I always go back to Dropbox. With my workflow for my job I am constantly exporting photos and organizing them in Dropbox to download to my phone. Dropbox does this instantaneously and I have never lost anything in Dropbox or had a crash or bug malfunction in 5 years of using this app between mobile and desktop. My only wish is that you had the ability to export multiple files at once and save them to your phone. I now use airdrop to let me do this and just save everything to Dropbox to organize and have files on the go on my phone. This would be so helpful though when airdrop isn’t functionally well.","rating":4,"reviewer":"ZC1319","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2356885278","title":"Keynote Not working on Apple’s Files app","comment":"I just updated Keynote and I am not able to open my keynote files that are in Dropbox inside the Files app. I need to move them to iCloud Drive for them to work.","rating":3,"reviewer":"rosemariesanta","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2354450863","title":"App","comment":"Love that I can access all my files from any of my devices and mac computer","rating":5,"reviewer":"Mytun3s","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2353885970","title":"Not compatible with files app","comment":"Having to go inside a folder and make each individual file offline is a bit cumbersome when I need the entire folder to be off-line. I would like the ability to make an entire folder off-line.\n\n3-27-18\n\nI’m not able to drag and drop from the files app on my iPad Pro 12.9” which has all of my relevant documents into Dropbox. Instead I have to go through the cumbersome task of going to my laptop and dragging manually which is not always on me. Please fix this..\n\n( the dropbox app is not compatible with the native files app from Apple. When I go into files it states that I can’t access my data because of the passcode lock... )","rating":1,"reviewer":"Parriejames","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2353298119","title":"Its ight","comment":"Its decent just a lil hard to use pero other than that its ight","rating":4,"reviewer":"Carloscc001","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2352943715","title":"Support is a pain photos req a to: field to add.","comment":"Why do I need to add a to: field to add my pics to my Dropbox? I thought pics were just another type of document? Also, why do I have to traverse your support database? \nLet me leave you a message and you search the database for me. I don't want no spoopy chat bot either. Have the chat bot email me, make it asynchronous. I do not want to wait on the \"...\" For a chat bot.","rating":1,"reviewer":"Mrtonyd","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2349908291","title":"Issues","comment":"Awesome app but, lately everytime I open the app, I have to open from App Store.","rating":3,"reviewer":"Kwill0409","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2347061391","title":"Out of sync error","comment":"Every time I try to up upload a file to Dropbox I keep getting out of sync error even though I have the latest version can you guys try to fix that so I can upload my files to it thanks","rating":3,"reviewer":"123ANX","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2343518996","title":"This Exists!!","comment":"I am usually not the one to spend a few minutes writing a review but after I found out that you can store GB totally for free, I had to thank them.","rating":5,"reviewer":"thorny guy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2338636843","title":"Love it!!!","comment":"Works flawlessly with my laptop - pix, text-edit-docs, folders of stuff... and I love the new \"scan\"!","rating":5,"reviewer":"SamiHIan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2336954443","title":"New update is the worst update ever","comment":"New update is the worst update ever! It was so handy to create a list with logins so you chould choice which account you wanna be. Now it log you in automatically. All my work comes on my sisters dropbox! Please turn the update back!","rating":1,"reviewer":"Soulandmuse","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2335793635","title":"Great App!","comment":"Dropbox has always been a great app and even better with the addition of Dropbox Paper, but I think you should have better storage options with pricing along the lines of google drive or apple. A lot of people don’t need 1TB. Apple’s 0.99 for 50GB a month sounds good or even Google’s 1.99 for 100GB sounds appealing. I don’t mean to plug or anything just wish this outstanding app had better choices and I know those companies are a lot bigger but at least one mid range option would be great. Keep up the good work.","rating":5,"reviewer":"Kaine318","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2334187456","title":"Crashes","comment":"App always crashes when trying to scan documents that are already in gallery after 7 pictures","rating":2,"reviewer":"onateag","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2332152879","title":"I really want to depend on this, but...","comment":"My photos aren’t loading. Just a bunch of blank boxes.","rating":1,"reviewer":"TRose88","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2331260713","title":"Dropbox is full, can't purchase more room!","comment":"It won't let me purchase more space for my Dropbox! And some of my pictures that were in my Dropbox are now missing and I didn't delete or move them!!!! 😡😡😡😡","rating":1,"reviewer":"Salcshells","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2330099639","title":"Perfect","comment":"I do not understand the bad ratings.  I have all my client files separated into folders, can easily access them at any time, can forward a file  to a client with ease as well as speed from my Mac, iPhone and iPad as well. iCloud does not backup all my files; and google drive counts deleted files as part of the storage plan.  No app is perfect for all needs, but this is close.  I rate Dropbox with a 5.","rating":5,"reviewer":"Pensionmaven","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2329032041","title":"Thank you","comment":"I almost strictly use this app from my mobile device. Thank you for listening to people’s reviews. My last review was to bring back access to the settings on the mobile device and now I can! Thanks again","rating":5,"reviewer":"REAPERakaLJ","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2328122783","title":"iPhone X portrait mode","comment":"Doesn’t properly upload the correct photo for portrait mode.  Uses photo without any of lighting conditions.  That is different than iMessage or other sharing apps","rating":1,"reviewer":"Scooter Donovan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2319649180","title":"Favorite Cloud Storage App","comment":"I have Google Drive, OneDrive, and iCloud in addition to Dropbox. Out of these options, Dropbox is my go to for storing nearly everything. It’s cross-platform and has the BEST ability to quickly push updates across my devices out of any of the cloud storage options I’ve tried. It’s way easier to organize things in Dropbox than in Google Drive. It’s also way easier to quickly access files (that are stored online) from Dropbox than it is from iCloud or OneDrive. In my opinion, OneDrive and iCloud are both defective when it comes to accessing files that aren’t stored offline.","rating":5,"reviewer":"Danyel R","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2319102699","title":"Not working properly","comment":"After selecting an image to view I can't go back to menu/folders etc. Have to close app to close image view.","rating":1,"reviewer":"Icy flower","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2315494801","title":"Fails to load images","comment":"We use it entirely for photo/ video storage for the company, and it fails to load half the images in our directory. Just won't do it. For something seemingly designed almost entirely around being able to store that kind of thing, you’d think that wouldn’t be an issue at this stage. Their browser app isn’t much better really.","rating":2,"reviewer":"Rwdphotos","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2314952791","title":"New interface is garbage.","comment":"For two reasons:\n\n1. Before, you could switch between files if they were full screen without having to close the app. Now, if your files are full screen and you want to switch files, you must close the app, select the file you want, and then full screen. Rinse lather repeat. What a hassle.\n\n2. No more categorization for offline files. You must manually hunt them down rather than have them all in one nice folder.\n\nDropbox, please don't sink to the level of iOs11 with your interface.","rating":2,"reviewer":"Justin fong","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2313775659","title":"What a piece of crap!","comment":"Just like so many other products for mobile devices, these crooks have figured out how to set my Dropbox app so that it grabs all of the photos off my devices and uploads them, then it keeps annoying me with alerts telling me that my Dropbox account is full and I need to buy more storage.  I have tried to find the settings icon on the Dropbox app so that I can turn this off, but it is nowhere to be found.  An online search for a solution gives me only dead ends that don’t match what I am seeing.  I gave up and have stopped wasting my time with this worthless product.","rating":1,"reviewer":"SequimWA","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2309927531","title":"Google sign In","comment":"Every time I sign out with google and sign in it signs me into my same account I’m trying to aim into a different one but won’t let me","rating":1,"reviewer":"Hjbkkv","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2306239519","title":"2 fixes that are needed to get 5stars","comment":"1.) You are not able to download multiple files at once. On WiFi or data service. This will save a ton of time. \n\n2.) when you download pictures at least to iPhone you have to crop or edit or make a change to them in order for the file to be recognized and be clear before uploading it. \n\nI would like this fixed because i actually pay for space. And since time is money a lot of my money(time) is being wasted downloading one by one or editing for files to be recognized.","rating":3,"reviewer":"Dayday104","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2302855137","title":"No longer worth it","comment":"Turned to garbage about a year ago. Don't bother.","rating":1,"reviewer":"Tea-biscuits","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2301984918","title":"Has been helpful but now no back button","comment":"I have been enjoying this app for what I need it for, but just recently I open a file document, make it full screen & then I cannot get back to my other files, because the back button has disappeared. So I have to close out of the app & reopen it every time I need to switch to another document, which is often.","rating":2,"reviewer":"Zyngie","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2300670964","title":"I waited for years....","comment":"Dear Dropbox, \n\nYou made me wait an hour just to tell me that my files were not uploading because i had no storage. I hate you now. \n\nSincerely, Everyone.","rating":1,"reviewer":"hank summers","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2298312428","title":"Reseña.","comment":"Me parece excelente aplicación.\nTambién me parece amistosa e innovadora.\nFelicitaciones.\nLuis","rating":5,"reviewer":"Luis Montalvo Veliz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2294824054","title":"Please update with basic playback tools like","comment":"1. bigger play, stop, pause in audio playback\n\n2. loop function\nThis is particularly important as we use the app a lot to listen back to mp3s in development, however it is a huge safety issue to locate the tiny little play button every time to restart playback when driving for example.\n\n3. Can you make it possible to please choose weather we want the audio to remember where left off or not.\n\nIn meetings this is particularly annoying when it starts somewhere else than the beginning.\n\nI have sent messages about this before and years ago without any updates and am now adding a review about this for the first time in hope that you take it more seriously.\n\nPlease fix these basic things so us professionals that rely on your app quite a bit can have a more seamless and safe experience.\n\nThank you immensely and have a fantastic christmas!\n\nUpdate.\n\nHave not had connection with dropbox outside wifi. Please fix this. Its been months and you keep updating without fixing your connection over LTE/4g\n\nOh.. any movement on the other issues above?\n\nThanks again for listening..(i think)","rating":4,"reviewer":"RnbLover!","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2294449522","title":"THE cloud app","comment":"I’ve been a dropboxer for years and nothing beats it. Works on any device, seamlessly creates shareable URLs, good access control. All around awesome! A little annoying when sharing folders with users without enough storage... I hope they resolve that at some point. Use this, enough said, it rocks and it’s always getting better","rating":5,"reviewer":"Estonia4Life","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2288695025","title":"Shuffle","comment":"I play music from time to time on this app and I am unable to skip or shuffle and it’s really annoying. \n\n    Love the fact that I can play music on this & it’s not even music app.","rating":2,"reviewer":"A-waar","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2283843542","title":"One stars because offload app💔","comment":"Now i want to use the dropbox but \nIn time to upload my photos and video\nThe app was offload I don’t know\n😔😔😔 my photos very important 💔","rating":1,"reviewer":"steven hemn","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2282645233","title":"Moving backwards","comment":"iOS integration between Dropbox and Outlook is now completely broken. Can no longer attach Dropbox files to emails within outlook, and clicking \"insert Dropbox link\" doesn't work either - just sits and spins, forever. Didn't anyone validate this change before going live with it? \n\nCopying this to Microsoft Outlook app review - would be nice if you guys could learn to play nicely together.","rating":1,"reviewer":"chris fjvnvijv","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2281581606","title":"Best app ever!","comment":"This is the best app ever made in existence! I’ve used this app for 6 years and I’ve never had a single problem with it. I wish I can give more stars, keep doing what you’re doing Dropbox! ❤️❤️","rating":5,"reviewer":"Edgar1718","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2281312016","title":"Does not work with BeatMaker 2 & 3 apps!!","comment":"For some reason the Dropbox app does not work with BeatMaker apps. I thought the update Dropbox just put out would have fixed that problem but it didn’t. I allow the apps to work together but it just keeps showing a loading icon. Not sure what happened to these apps for them to not work together anymore. I just got a new iPad Pro, so I know it’s not that.this hasn’t been working for more than a few months now. This is annoying. Needs to be fixed.","rating":1,"reviewer":"Dune-E","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2281085466","title":"Playlist","comment":"It’s a good app, but I wish there was a way to make a playlist for music so that we can play more than one song at a time and not have to go back to find the next song.","rating":4,"reviewer":"MrDemolition","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2277774684","title":"MS Outlook Integration Problems","comment":"I use my iPad Pro constantly for workflow production with Dropbox and MS Outlook. I also have some other file storage accounts linked to my MS Outlook but I would prefer not to... But I have to because the Outlook app will not allow me to insert a file from within the app from a Dropbox location. This. Is. Crippling. I cannot overstate how much of a problem this is for me, daily. I often need to reply to emails and insert modified documents but utilizing Dropbox as my storage venue for those documents prevents me from doing so. I have to export the file FROM Dropbox and place it on a different service (such as google storage or other) and then insert it from there. I’ve paid for storage on Dropbox for a couple years now and I think this will have to be the last year if this issue does not get worked out. I realize Dropbox may not in control of how Outlook handles attachments from the Dropbox service but regardless I may not be able to continue with Dropbox if the issue isn’t resolved. Starting a new email from within Dropbox to simply send a file doesn’t work for me and frankly, I feel I shouldn’t have to come up with another workaround to make the system work the way it should already.","rating":2,"reviewer":"The Reviewer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2277561726","title":"Deleted my files","comment":"I’ve been a fan of Dropbox for many years now but today I went to login to my Dropbox account I haven’t used in awhile because you know sometimes life gets you in the moment. Well apparently if you don’t use your account for 1 year they delete your account including all your files. Literally years of graphic design work and memories with loved one just gone. Absolutely horrible. 😢","rating":1,"reviewer":"Uniboobie","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2275579416","title":"Unusable app","comment":"This app is garbage and a waste of time!!!","rating":1,"reviewer":"Amzie D","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2274812840","title":"Wth....","comment":"Can’t convert videos to audio anymore. Ughhhhhh","rating":5,"reviewer":"bougie_bella","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2274242353","title":"Mandatory","comment":"I wouldn’t use this app if I could access their site from my mobile device.","rating":5,"reviewer":"Principessa86","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2274217429","title":"Audio file playback needs updating","comment":"I use Dropbox almost entirely for listening to my marching band and string orchestra music, so here are some things this app (and also the windows 10 version) needs (which by the way I put 4 stars rather than 5 due to the time I’ve been waiting for these to be added): \n-Allow the audio files in groups of/folders with only audio files (such as mp3s and mp4s) to be looped through automatically, and allow singular audio files to be played through on loop as well (and especially do these for audio files downloaded for offline, since I use audio files offline like 90% of the time so that would really help).\n-Add a way to make playlists of audio files that can be looped through (and again, make sure playlists can be downloaded for offline for the reasons I mentioned before).\nOtherwise, okay app!","rating":4,"reviewer":"bagaboiebailey","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2272336950","title":"Dropbox constantly crashes and has for months","comment":"I’m using the most recent Dropbox on an iPad Air 2 and currently use the most up to date Safari version 11. Dropbox constantly crashes every few minutes when scrolling through folders to view images (jpgs, pigs, tifs, psd) and has for months through its many frequent upgrades (although the term ‘upgrade’ is being far too generous given it’s declined utility and functionality) It’s infuriating and completely unreliable. I need an ap that is stable.  Grade: F\n\nUpdate:  After 2/20/18 update Dropbox cant upload or download to IPad Air2 apps. DOA. SMH. It still crashes regularly   as noted in my original review above.","rating":1,"reviewer":"Lgqwerty","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2271962797","title":"Can’t Dropbox to interface with my Fudget App","comment":"I have worked hard to get Dropbox and Fudget Apps to interface. I have know idea how to make this happen and it very frustrating.","rating":1,"reviewer":"Anna617","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2264885121","title":"Cannot even sign in","comment":"(The operation couldn't be completed. Error 400) all the time. Password is correct, no problem on any browser. The is possibly the worst app I've ever used.","rating":1,"reviewer":"Yulun Wang","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2264862813","title":"Let down","comment":"This app used to work great. Now I can’t even sign in. I keep getting an error 400","rating":1,"reviewer":"Vankrazy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2258630334","title":"Best Office File Storage System","comment":"Honestly, my boss was using a local external hard drive to “back up” data, but then I happened. Considering the fact that I can actually build a on-site file storage system that concurrently checks for changes and syncs to the drive, I realized dropbox is a better solution. \n\n1. I am never in the office.\n2. Reinventing the wheel is no fun.\n3. Seamless syncing between office from anywhere in the world (not universe, maybe if it is linked to the same WAN used on Earth).\n4. Back up of back. On my Mac and or Windows, I can actually create snapshots of a specific directory with downloaded files like dropbox’s and save all the files once a month in the external disks. (That’s quite genius of I, as I just thought of this and will do this).\n\nAlso have business class internet. So all in all, the app and service is amazing for 99/year. Just wish I could get a little more space than just a TB, but ay, it does the trick!","rating":4,"reviewer":"iShakeSpeari","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2258307440","title":"Don’t want it!","comment":"I don’t know how I got this. Please unsubscribe me! Thank you.","rating":1,"reviewer":"Afmaddie","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2256164214","title":"Ehh!","comment":"Not the easiest to use! Will only send as a link to your PDF on Drop box which most can’t access!","rating":2,"reviewer":"sbolock","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2249808888","title":"No drag and drop for iOS11?","comment":"Really????","rating":1,"reviewer":"Applecocoa","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2247503622","title":"cannot perform the most basic functions","comment":"Such as: \nIf you create a folder within a folder you CANNOT move a file from the general folder you’ve created (eg: “Baseball”) to the new sub folder (eg: “Mets”).\n Pathetic!\n\nI gave it 2 stars because you can create folders, store files in them, share files or folders via links, etc. But this is 2018 folks. No sub folder utility? \nTen minutes of typing for a coder?","rating":2,"reviewer":"smhcine","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2246532390","title":"Should be optimized for iPad","comment":"I'm baffled that there seems to be no way to view your file system in full screen! The space for preview of files takes up 3/4 of the enormous iPad screen, which is just absurd. Please look at Google Drive for iPad, or heck, even iCloud. This isn't a photo gallery, it's a cloud file manager.","rating":3,"reviewer":"voidofcourse","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2245869713","title":"Suggestion","comment":"I love the Dropbox app, and here are two suggestions for improvement:\n- It would be nice if we could attach the file to an e-mail and not just the Dropbox link. Most of the companies prohibit their employees to access the Dropbox website to minimize the possibility of them stealing data. So, when you are at work and you need to send a file from your Dropbox app, it won’t be useful to send just a link, as no one in the office will be able to access the link. It would be really nice with you could improve that. \n- is there a possibly to block some folders with password?","rating":4,"reviewer":"4223d","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2244298213","title":"Comes in handy!!","comment":"I use Dropbox primarily for temporary storage. I created folders which work great. With all the updates the preview of the items no longer shows. Now if I don’t know the document by name, I can’t scroll through to find it. Bring the preview back, or at least make it an option in settings to give a choice. I like using DropBox better than Google Drive.","rating":4,"reviewer":"Hdmcbiker","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2244268708","title":"Easy to Use","comment":"Love how easy it is to use on all my devices and between multiple platforms. Never a worry about accessing my files.","rating":5,"reviewer":"SMargolin","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2242635773","title":"Horrible!!","comment":"I accidently hit synch from iPhone and unable to stop synching ALL of my downloads and personal photos. \n\nThere is NO way to stop the synching. I have spent hours trying to find the solution.","rating":1,"reviewer":"Oceanbaaby","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2241628813","title":"like","comment":"down","rating":5,"reviewer":"Vojang","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2238590991","title":"Indispensable","comment":"Even with free Google Drive and Box through work I principally use a Dropbox, for its superior integration with other apps and for ease of sharing files.","rating":5,"reviewer":"David1112","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2233338719","title":"Fix the Auto Upload!!! 😡","comment":"Update 2-21-18: Still has *extremely* slow upload and won’t upload unless you’re phone stays unlocked. Next to useless unless you want to sit and stare at your phone for hours, constantly tapping the screen. Would be wonderful for it to auto upload as soon as you add to Photos (like iCloud does...). \n There have been one or two updates since I wrote my original review, and these problems still have not been fixed. I have more than a hundred photos waiting to upload, and only three photos have uploaded even after keeping the app opened on the phone for an hour. Ridiculous! \nWhy did you remove the auto upload? I hate having to manually select photos, and then it takes days for them to upload because they will only upload when Dropbox is open and the phone is unlocked. I used to love this service, but, if it stays like this, I will look for something else.","rating":1,"reviewer":"mysterygirl75","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2233238860","title":"it works…","comment":"…amazingly well.","rating":5,"reviewer":"annag42","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2232937127","title":"Thumbs down","comment":"The new updates are horrible. Taking away functionality. No more syncing.","rating":2,"reviewer":"The Buddman","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2231116119","title":"Can’t export multiple documents at once","comment":"Title says it all—you can’t even export folders so if it weren’t for another app all you could do is go in and export each thing individually—if you have hundreds of things in your Dropbox, then I guess you’re just f$&%ed","rating":1,"reviewer":"Paulo719","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2230019800","title":"Dev doesn’t respond to reviews.","comment":"With an average reading of 3.3 you would think someone from Dropbox would respond to a few reviews. But no one does. Shows they don't care.\n\nDon't store your photos here. They are too valuable for Dropbox to just lose them for you. Flickr stores 1TB of photos for FREE! No, I don't have any connection to Flickr; just a user. \n\nEarns a 1-Star review.","rating":1,"reviewer":"I Don't Want To Have A Nickname","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2229976825","title":"Dropbox preferred","comment":"I have used a number of cloud drives and Dropbox is tops. I am a long time customer and recommend it highly.","rating":5,"reviewer":"Teacherosb","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2229921004","title":"Needs to support smart invert","comment":"Good app but needs to support smart invert!!","rating":3,"reviewer":"_Michael_666_","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Dropbox","id":"2226973966","title":"Bulk downloads not an option...","comment":"Useful upload feature, but it is extremely frustrating to try to restore files to your device. To do so, you must select each file individually and save it to your phone. Hope you didn’t consider using Dropbox for backing up your photos...","rating":1,"reviewer":"ElPigeon3000","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"}]