[{"app":"Evernote","id":"3326269897","title":"Disapointed","comment":"I just updated my evernote app, and it doesnt seem to work.. crashes all the time.. and i have also tried to delete and reload.. still no result .. am i going to lose  all my notes ...??? Whats going on .. i had been using this app since 2014... it never gave me this kind of problem ..","rating":1,"reviewer":"des-sg","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3325396654","title":"It’s wonderful but frustrating","comment":"I hoard information. I always get back to it eventually, but it’s extremely frustrating when Evernote takes forever to load older notes. \nIt’s hard enough at home trying to view them- don’t get me started on trying to view old notes in meetings. I may have written something a few months ago, but when someone asks about it, it takes too long to be able to bring it up. I don’t even try anymore.","rating":3,"reviewer":"Frances A.R","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3320908803","title":"Very disappointing","comment":"Wow. Seems like they are going downhill fast. Doesn’t even seem to be supported anymore. Was happy user for many years and I am looking for alternatives now.","rating":1,"reviewer":"Kdog1210","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3319424643","title":"Best Notetaking App but ...","comment":"The best app for taking notes. Easy to use and lots of content.\nHowever in the last couple weeks, it has been shutting off. As soon as I open it and try to open a note, it shuts off. Aside from that it’s one of my best apps.","rating":4,"reviewer":"Reebee27","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3318795434","title":"Evernote unusable in ios12","comment":"Typing delay is so laggy I can’t use it.  Please Evernote fix this.  You are losing people.  Look at the forums.","rating":1,"reviewer":"MTC in NJ","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3317217088","title":"Must add handwriting support - without leaving page","comment":"As handwriting becomes more mainstream, you continue to force people to type notes. The token \"drawing\" capability doesn't adequately support handwritten notes as the primary source of input.  If you had integrated handwriting support, I bet you would add 20% more users on day 1. Other note taking apps are eating your lunch because you force keyboard input as the method for note-taking. OneNote, Notability, GoodNotes... they all are top selling apps because they have capitalized on handwritten notes - as surface pro 6 was announced with pen support and new ipads and new pencils seem eminent it is time to broaden your thinking on forcing keyboard-only content input","rating":1,"reviewer":"Caddisbug1994","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3316924910","title":"Great app","comment":"I love it","rating":5,"reviewer":"Married2Angie","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3316311260","title":"Mad!!!","comment":"I am so mad that I can’t undo something in the app!!!!!!","rating":3,"reviewer":"RBonilla21","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3316126521","title":"Disappoints","comment":"Updates too-often break core functionality, and it takes months at best to fix.   It’s really irritating to see this basic mistake recurs at epidemic levels with evernote, whilst most all other major apps  kicked this bad habit.     It will be fatal for this company.","rating":1,"reviewer":"tb2112","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3312701887","title":"Evernote","comment":"The most frustrating apt; holds out great opportunities, but no direct contact when problem arises; who do you talk to!\nImpossible in my experience to print out memo!!\nPeter","rating":1,"reviewer":"Caps photo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3309829304","title":"premeum","comment":"excuse me? but um i just downloaded this app and it said something about evernote premeum and i just want to make shure that i am not paying for something or if it is just a plus feature idk? can some1 pls help me?!?!","rating":5,"reviewer":"Wearemorans","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3309734966","title":"I can’t understand the in-app purchases","comment":"So when I log into my Evernote free account, it asks me to upgrade, but it doesn’t tell me the options or cost. So I came to the App Store. Costs are everywhere from $3 to $45, and I have no idea what I might be buying. So I tried to email the developer and ask, but the few options would not allow me to do so. I would give it 5 stars if I could figure it out. I use it to hold song lyrics with chords.","rating":2,"reviewer":"Carolxxx","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3309707752","title":"Device limit reached","comment":"Lol bye.","rating":1,"reviewer":"seandrivescars","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3308246725","title":"It Was The Best","comment":"My husband and I have heavily used Evernote for over 7 years. However, over the past few months the app keeps getting more and more glitches. The most frustrating one is that you cannot properly past into a note unless it is brand new. I regularly copy large chucks of text into notes and paste many times into the same note. I can’t use it at all for this right now without restarting my entire phone after every copy and paste. I tried reaching out online a few weeks ago and have heard nothing. I will have to find something else if this cannot get solved soon. I wish it would. Before this, I LOVED Evernote.","rating":2,"reviewer":"Travis Sinks","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3307505158","title":"Please fix the bug; time invisible","comment":"I think your app is really very elegant,\nbut the left sidebar is so dark that it makes the time at the top left corner invisible.\n\niPad 2018 with iOS 12.0.1","rating":5,"reviewer":"Weiver Etirw","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3306992758","title":"Since IOS12 I can't move curser or Copy/Paste Most Notes on Random Pages??","comment":"On certain notes After I place original curser in position I can't move it anywhere else on page without closing page and re-opening...It also won't let me copy/paste...IE Select/Select all...some notes I can...most I can't...tried duplicating notes...that didn't work...please HELP...very frustrating when I have to re-write notes repeatedly rather than being able to copy/paste\n\nCurser gets stuck on a line and I cannot move it elsewhere on the page...PLEASE FIX","rating":1,"reviewer":"BennyBlanco18","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3306075781","title":"Major Flaw","comment":"If you use a corporate email address, you leave or get fired and forget the password, there's no way to recover your password.","rating":2,"reviewer":"Luis HVM","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3305164378","title":"Great App!","comment":"So easy to use and add notes, quotes, pictures and so much more!","rating":5,"reviewer":"Redlee456","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3303926695","title":"It’s a great tool","comment":"It’s a great tool for various different reasons. I think an interesting set of features would be a kind of automation, e.g., the ability to set up conditions so if I write certain words the note is added to certain folders or has certain reminders set to it or maybe even triggers a notification to specific people, etc.\n\nAlso, something I think should be implemented is title caps in .… well, the TITLES of notes. Why is that not a thing? Or at least a toggleable setting?\n\nLastly, why is it that the icon badge notification number is not at all connected to the actual trigger of the notification. I should open the app and it should be totally clear what the notification number is referring to, whether it’s reminders or updates or whatever. The user is just left adrift once he taps on the icon and then has no clue what triggered the notification. It’s just plain bad UX and your UX folks should really be talked to about that because it’s rather fundamental stuff they are missing.","rating":5,"reviewer":"doxzero","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3300655187","title":"Limited","comment":"Limited functionality, how could it be useful when i could only sketch one page per note! I want unlimited scrolling like a notebook","rating":1,"reviewer":"Baraa Modallal","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3298404937","title":"Device limit reached glitch?","comment":"As a basic user I thought I was able to have up to two devices before I needed to upgrade. I have Evernote on my Mac and iPhone and yet when I open the app it tells me my device limit has been reached. The app lets me close this window, but it’s annoying to have to see this every time when I have not exceeded the device limit.","rating":3,"reviewer":"kpoulor","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3294746215","title":"Slow SLOW SLOW","comment":"It should not be this annoying to use and take notes with. Im using an iphone x biggest gig model and it STILL refreshes to the all notes folder every time i open it to add to a note I was previously writing in. And whats worse is it takes very long to get back into that note. \nWondering if you guys still care? Not too sure.","rating":1,"reviewer":"snowman?","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3294002666","title":"Latest revision needs work!","comment":"I love the addition of templates, but some basic editing functionality was broken in the latest app or iOS update. \n\n- can't reliably check boxes when the keyboard is out\n- can't reliably change cursor position when the keyboard is out\n- trying to move the cursor to the last line of a note or click on a box in the last line sometimes causes it to behave like I clicked on a provided context note\n\nPls fix","rating":2,"reviewer":"Verdy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3290987406","title":"Poor Accessibilityb","comment":"Menu labels could be improved for better use of Voice Over. This would improve the usage by people who are blind","rating":4,"reviewer":"Efta","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3289747466","title":"Super fast","comment":"I can find my notes so fast","rating":5,"reviewer":"Nickname for me to use23","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3286996770","title":"Great app, just one problem","comment":"So this app is awesome. I use it to write down all my notes, almost every day. However, I've run into an issue with syncing the note, where it doesn't sync correctly between devices and for some reason creates duplicates of the same note. Idk why this might be, but it would be pretty cool if you fixed this as soon as possible. Thanks.","rating":4,"reviewer":"SKM1081","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3284157623","title":"I have to upgrade??","comment":"I got a message today saying I would have to upgrade in order to keep my devices synced. I have to pay monthly now for evernote to continue to function as it always has?? The purpose of evernote is to keep all your notes on all your devices or any web connected pc. Paying monthly is required now or the app is just a notepad?? This app is garbage now.","rating":1,"reviewer":"rex1030123","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3282683149","title":"The latest update is terrible!","comment":"I have been using Evernote for several years so I’m used to the occasional iOS app bugs, but this last version has to be the buggiest ever! The app will only sync in one direction, which pretty much defies the purpose.","rating":1,"reviewer":"VW Owner2golf","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3281715960","title":"So buggy","comment":"The bugs continue and are getting worse. It’s unbelievable how unreliable this app is. Run far and fast.","rating":1,"reviewer":"Dallin V.","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3279746757","title":"Horrible - steer clear if you value your data","comment":"It was always a slow resource-hog; and when they get tired of you not upgrading, the app suddenly doesn’t let you edit notes and nobody will tell you why. \n\nThis is also one of those companies that refuses to give you any contact information to make a complaint or even ask a question","rating":1,"reviewer":"This'n","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3279444975","title":"Trouble on iPhone w/current build","comment":"Down from five stars. I am a huge fan of Evernote on almost every platform. Just tried to use it on my iPhone, however, and finally gave up.I couldn’t get it to edit and it continued to try to login to LinkedIn for the context feature (?). I can’t find a way to disable that.","rating":3,"reviewer":"V_Walker","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3279064585","title":"evernote","comment":"best app for notes.. best accessibility","rating":5,"reviewer":"mohamadsajedi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3276222528","title":"Issue with note formatting","comment":"Recent update removes spaces in notes.","rating":2,"reviewer":"Tho1091","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3275947266","title":"I need this but it frustrates me","comment":"The features are great but extremely buggy so I have to be verrrry careful.  I never know how this app is going to behave.  Today I was trying different ways to make flash cards and store them in Evernote.  I learned:\n\nIf I add a Microsoft Word file with cropped images to a note and view the file in the mobile app, the cropped out-parts will show and the aspect ratio will be wildly distorted. \n\nIf I create a note with a table and add an image to a cell in that table, the image will disappear after a few minutes and I will be left with an empty table. \n\nLast week I learned of I sort one folder by title, it will sort all folders by title.  This is a bad defaul feature, with no way to turn it off that I can find, so I just have to constantly re-sort notes when I switch folders. \n\nFurthermore, I’ve gotten into the habit of syncing on one device and when I move to another device, shutting Evernote down completely on the new device before opening any note, because I have had older notes overwrite newer notes before and I don’t know why.  \n\nNevertheless I am kind of in awe and will keep using it.  Microsoft Word will crash on a girl too, so I guess it’s a matter of picking your poison.","rating":3,"reviewer":"RettaO","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3275833480","title":"What the he** happened??","comment":"IPhone Xs Max and X, this app used to be excellent. Now it's full of lag and has a lot of trouble with my SwiftKey keyboard. Almost unusable now with IOS 12.","rating":1,"reviewer":"Fishmac Who","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3274751771","title":"Don’t honestly know why I keep paying them","comment":"Bug of the week club.  \n\nToday: trying to save a simple pdf I’m viewing in chrome using the send-to menu. Evernote’s cute little dialog comes up. But it never finishes. Sits there with the wheel spinning forever. Hit cancel and “unable to save note” shows up for a moment in another dialogue. Really?!?!?  I couldn’t tell.\n\nStill a problem.","rating":3,"reviewer":"timesucker","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3272962778","title":"Super buggy","comment":"Whenever I load the app, the devices screen pops up and fails to load the my notes. Disappointed","rating":1,"reviewer":"asx777","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3266762333","title":"iPhone app not syncing","comment":"I’ve been a subscriber since 2011 and LOVE the Evernote service. I use it for everything - meeting recording’s, receipts, web clipper, outlines, you name it. However, I submitted a ticket almost 2 weeks ago and still not heard back on why my iPhone app isn’t syncing with my account. I also submitted an inquiry via @EvernoteHelps Twitter handle and still have not heard back regarding that ticket number.  How else am I supposed to communicate the challenges that I’m having?","rating":2,"reviewer":"Hurrikoehn","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3266697703","title":"Tags in Tree Hierarchy","comment":"I love Evernote desktop and I have tried to love Evernote for iOS for years now. I have my 10000+ notes organized by a hierarchy (tree) of tags. This works great on the desktop version because the tag tree can be nicely displayed on the left side of the window. \n\nI wish iOS Evernote had the ability to display that same tag tree. It seems the iOS design is a completely different product than the desktop version.\n\nI have searched for Evernote alternatives because of this and each are missing some key features. The one alternative I like the best is Synology Note Station. You do need Synology NAS hardware and they do not have all the Evernote features, but at least their desktop, web and iOS apps are almost identical in usability.\n\nPlease Evernote, make your iOS version more like the desktop version with a collapsible tag tree view.","rating":2,"reviewer":"JayApper","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3266270847","title":"Where’s the dark theme?","comment":"Join the club, I white screen gets tiring on the eyes.","rating":3,"reviewer":"Christian-stone","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3264812289","title":"Can’t even change the font color","comment":"How is this supposed to be on of the best note softwares when you can’t even change the font color?! 🙄 why can’t something just be simple.","rating":2,"reviewer":"alwaystheannoyedone","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3263989794","title":"Current Version Freezes up on iPhone 6","comment":"Love Evernote, but ever since the last update I can’t access my notes without it freezing.","rating":3,"reviewer":"Coljn707","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3263646763","title":"Good app, the WORST support","comment":"Don’t get me wrong, I like the functionality for note taking and ease of syncing between devices but these guys literally have ZERO support on any issues. I have 4 open tickets and 3 weeks worth of requesting support with literally no response from Evernote. It’s BS seeing as though I paid for Premium subscription. \n\nVERY DISAPPOINTED","rating":2,"reviewer":"Stevaughan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3263546095","title":"ANOTHER subscription-based app","comment":"Everyone wants to do subscriptions now. No thank you. I’ve uninstalled this app.","rating":1,"reviewer":"SotRH","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3263156012","title":"Some problems and a feature request","comment":"On a 10.5 ipad, often I can’t add anything to the end of a note. cursor just freezes.\n\nCreated Siri voice shortcuts, made on iPad, to specific notes can’t be be accessed using iPhone. There should be parity between devices for using voice.\n\nFeature request:\nOpening a note will automatically scroll you to your previous location in the note, so you can pick up where you left off. Would be fine as an optional toggle","rating":3,"reviewer":"capedape","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3262608703","title":"Recent update has bugs","comment":"Recent update is buggy. When reading a note, EN hangs and needs to be rebooted. Please fix.","rating":1,"reviewer":"Andybenbow","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3261882959","title":"Pinwheel of death","comment":"With the most recent update, I have had to wait a bit to get to my notes, which means I can no longer quickly jot down my thoughts. This is a problem for me. Please remedy.","rating":2,"reviewer":"Jhgkc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3261374762","title":"Broken cursor control","comment":"The last set of updates seem to have broken cursor control. I’ve been an Evernote user for several years and this is the first time that basic functionality has been so broken with seemingly no fix in sight. Has me testing out MS OneNote. Thinking maybe it’s time to make the switch.","rating":1,"reviewer":"dmcpple","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3260263500","title":"Mobile version needs undo button","comment":"The mobile version really needs an undo button \nMillion of times, it happened that accidentally I selected part of text and then hit a word on keyboard, and it was all gone \nNo Return on everything I typed \nSo please add this feature","rating":5,"reviewer":"Farahzadi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3326269897","title":"Disapointed","comment":"I just updated my evernote app, and it doesnt seem to work.. crashes all the time.. and i have also tried to delete and reload.. still no result .. am i going to lose  all my notes ...??? Whats going on .. i had been using this app since 2014... it never gave me this kind of problem ..","rating":1,"reviewer":"des-sg","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3325396654","title":"It’s wonderful but frustrating","comment":"I hoard information. I always get back to it eventually, but it’s extremely frustrating when Evernote takes forever to load older notes. \nIt’s hard enough at home trying to view them- don’t get me started on trying to view old notes in meetings. I may have written something a few months ago, but when someone asks about it, it takes too long to be able to bring it up. I don’t even try anymore.","rating":3,"reviewer":"Frances A.R","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3320908803","title":"Very disappointing","comment":"Wow. Seems like they are going downhill fast. Doesn’t even seem to be supported anymore. Was happy user for many years and I am looking for alternatives now.","rating":1,"reviewer":"Kdog1210","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3319424643","title":"Best Notetaking App but ...","comment":"The best app for taking notes. Easy to use and lots of content.\nHowever in the last couple weeks, it has been shutting off. As soon as I open it and try to open a note, it shuts off. Aside from that it’s one of my best apps.","rating":4,"reviewer":"Reebee27","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3318795434","title":"Evernote unusable in ios12","comment":"Typing delay is so laggy I can’t use it.  Please Evernote fix this.  You are losing people.  Look at the forums.","rating":1,"reviewer":"MTC in NJ","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3317217088","title":"Must add handwriting support - without leaving page","comment":"As handwriting becomes more mainstream, you continue to force people to type notes. The token \"drawing\" capability doesn't adequately support handwritten notes as the primary source of input.  If you had integrated handwriting support, I bet you would add 20% more users on day 1. Other note taking apps are eating your lunch because you force keyboard input as the method for note-taking. OneNote, Notability, GoodNotes... they all are top selling apps because they have capitalized on handwritten notes - as surface pro 6 was announced with pen support and new ipads and new pencils seem eminent it is time to broaden your thinking on forcing keyboard-only content input","rating":1,"reviewer":"Caddisbug1994","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3316924910","title":"Great app","comment":"I love it","rating":5,"reviewer":"Married2Angie","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3316311260","title":"Mad!!!","comment":"I am so mad that I can’t undo something in the app!!!!!!","rating":3,"reviewer":"RBonilla21","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3316126521","title":"Disappoints","comment":"Updates too-often break core functionality, and it takes months at best to fix.   It’s really irritating to see this basic mistake recurs at epidemic levels with evernote, whilst most all other major apps  kicked this bad habit.     It will be fatal for this company.","rating":1,"reviewer":"tb2112","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3312701887","title":"Evernote","comment":"The most frustrating apt; holds out great opportunities, but no direct contact when problem arises; who do you talk to!\nImpossible in my experience to print out memo!!\nPeter","rating":1,"reviewer":"Caps photo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3309829304","title":"premeum","comment":"excuse me? but um i just downloaded this app and it said something about evernote premeum and i just want to make shure that i am not paying for something or if it is just a plus feature idk? can some1 pls help me?!?!","rating":5,"reviewer":"Wearemorans","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3309734966","title":"I can’t understand the in-app purchases","comment":"So when I log into my Evernote free account, it asks me to upgrade, but it doesn’t tell me the options or cost. So I came to the App Store. Costs are everywhere from $3 to $45, and I have no idea what I might be buying. So I tried to email the developer and ask, but the few options would not allow me to do so. I would give it 5 stars if I could figure it out. I use it to hold song lyrics with chords.","rating":2,"reviewer":"Carolxxx","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3309707752","title":"Device limit reached","comment":"Lol bye.","rating":1,"reviewer":"seandrivescars","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3308246725","title":"It Was The Best","comment":"My husband and I have heavily used Evernote for over 7 years. However, over the past few months the app keeps getting more and more glitches. The most frustrating one is that you cannot properly past into a note unless it is brand new. I regularly copy large chucks of text into notes and paste many times into the same note. I can’t use it at all for this right now without restarting my entire phone after every copy and paste. I tried reaching out online a few weeks ago and have heard nothing. I will have to find something else if this cannot get solved soon. I wish it would. Before this, I LOVED Evernote.","rating":2,"reviewer":"Travis Sinks","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3307505158","title":"Please fix the bug; time invisible","comment":"I think your app is really very elegant,\nbut the left sidebar is so dark that it makes the time at the top left corner invisible.\n\niPad 2018 with iOS 12.0.1","rating":5,"reviewer":"Weiver Etirw","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3306992758","title":"Since IOS12 I can't move curser or Copy/Paste Most Notes on Random Pages??","comment":"On certain notes After I place original curser in position I can't move it anywhere else on page without closing page and re-opening...It also won't let me copy/paste...IE Select/Select all...some notes I can...most I can't...tried duplicating notes...that didn't work...please HELP...very frustrating when I have to re-write notes repeatedly rather than being able to copy/paste\n\nCurser gets stuck on a line and I cannot move it elsewhere on the page...PLEASE FIX","rating":1,"reviewer":"BennyBlanco18","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3306075781","title":"Major Flaw","comment":"If you use a corporate email address, you leave or get fired and forget the password, there's no way to recover your password.","rating":2,"reviewer":"Luis HVM","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3305164378","title":"Great App!","comment":"So easy to use and add notes, quotes, pictures and so much more!","rating":5,"reviewer":"Redlee456","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3303926695","title":"It’s a great tool","comment":"It’s a great tool for various different reasons. I think an interesting set of features would be a kind of automation, e.g., the ability to set up conditions so if I write certain words the note is added to certain folders or has certain reminders set to it or maybe even triggers a notification to specific people, etc.\n\nAlso, something I think should be implemented is title caps in .… well, the TITLES of notes. Why is that not a thing? Or at least a toggleable setting?\n\nLastly, why is it that the icon badge notification number is not at all connected to the actual trigger of the notification. I should open the app and it should be totally clear what the notification number is referring to, whether it’s reminders or updates or whatever. The user is just left adrift once he taps on the icon and then has no clue what triggered the notification. It’s just plain bad UX and your UX folks should really be talked to about that because it’s rather fundamental stuff they are missing.","rating":5,"reviewer":"doxzero","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3300655187","title":"Limited","comment":"Limited functionality, how could it be useful when i could only sketch one page per note! I want unlimited scrolling like a notebook","rating":1,"reviewer":"Baraa Modallal","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3298404937","title":"Device limit reached glitch?","comment":"As a basic user I thought I was able to have up to two devices before I needed to upgrade. I have Evernote on my Mac and iPhone and yet when I open the app it tells me my device limit has been reached. The app lets me close this window, but it’s annoying to have to see this every time when I have not exceeded the device limit.","rating":3,"reviewer":"kpoulor","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3294746215","title":"Slow SLOW SLOW","comment":"It should not be this annoying to use and take notes with. Im using an iphone x biggest gig model and it STILL refreshes to the all notes folder every time i open it to add to a note I was previously writing in. And whats worse is it takes very long to get back into that note. \nWondering if you guys still care? Not too sure.","rating":1,"reviewer":"snowman?","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3294002666","title":"Latest revision needs work!","comment":"I love the addition of templates, but some basic editing functionality was broken in the latest app or iOS update. \n\n- can't reliably check boxes when the keyboard is out\n- can't reliably change cursor position when the keyboard is out\n- trying to move the cursor to the last line of a note or click on a box in the last line sometimes causes it to behave like I clicked on a provided context note\n\nPls fix","rating":2,"reviewer":"Verdy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3290987406","title":"Poor Accessibilityb","comment":"Menu labels could be improved for better use of Voice Over. This would improve the usage by people who are blind","rating":4,"reviewer":"Efta","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3289747466","title":"Super fast","comment":"I can find my notes so fast","rating":5,"reviewer":"Nickname for me to use23","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3286996770","title":"Great app, just one problem","comment":"So this app is awesome. I use it to write down all my notes, almost every day. However, I've run into an issue with syncing the note, where it doesn't sync correctly between devices and for some reason creates duplicates of the same note. Idk why this might be, but it would be pretty cool if you fixed this as soon as possible. Thanks.","rating":4,"reviewer":"SKM1081","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3284157623","title":"I have to upgrade??","comment":"I got a message today saying I would have to upgrade in order to keep my devices synced. I have to pay monthly now for evernote to continue to function as it always has?? The purpose of evernote is to keep all your notes on all your devices or any web connected pc. Paying monthly is required now or the app is just a notepad?? This app is garbage now.","rating":1,"reviewer":"rex1030123","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3282683149","title":"The latest update is terrible!","comment":"I have been using Evernote for several years so I’m used to the occasional iOS app bugs, but this last version has to be the buggiest ever! The app will only sync in one direction, which pretty much defies the purpose.","rating":1,"reviewer":"VW Owner2golf","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3281715960","title":"So buggy","comment":"The bugs continue and are getting worse. It’s unbelievable how unreliable this app is. Run far and fast.","rating":1,"reviewer":"Dallin V.","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3279746757","title":"Horrible - steer clear if you value your data","comment":"It was always a slow resource-hog; and when they get tired of you not upgrading, the app suddenly doesn’t let you edit notes and nobody will tell you why. \n\nThis is also one of those companies that refuses to give you any contact information to make a complaint or even ask a question","rating":1,"reviewer":"This'n","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3279444975","title":"Trouble on iPhone w/current build","comment":"Down from five stars. I am a huge fan of Evernote on almost every platform. Just tried to use it on my iPhone, however, and finally gave up.I couldn’t get it to edit and it continued to try to login to LinkedIn for the context feature (?). I can’t find a way to disable that.","rating":3,"reviewer":"V_Walker","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3279064585","title":"evernote","comment":"best app for notes.. best accessibility","rating":5,"reviewer":"mohamadsajedi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3276222528","title":"Issue with note formatting","comment":"Recent update removes spaces in notes.","rating":2,"reviewer":"Tho1091","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3275947266","title":"I need this but it frustrates me","comment":"The features are great but extremely buggy so I have to be verrrry careful.  I never know how this app is going to behave.  Today I was trying different ways to make flash cards and store them in Evernote.  I learned:\n\nIf I add a Microsoft Word file with cropped images to a note and view the file in the mobile app, the cropped out-parts will show and the aspect ratio will be wildly distorted. \n\nIf I create a note with a table and add an image to a cell in that table, the image will disappear after a few minutes and I will be left with an empty table. \n\nLast week I learned of I sort one folder by title, it will sort all folders by title.  This is a bad defaul feature, with no way to turn it off that I can find, so I just have to constantly re-sort notes when I switch folders. \n\nFurthermore, I’ve gotten into the habit of syncing on one device and when I move to another device, shutting Evernote down completely on the new device before opening any note, because I have had older notes overwrite newer notes before and I don’t know why.  \n\nNevertheless I am kind of in awe and will keep using it.  Microsoft Word will crash on a girl too, so I guess it’s a matter of picking your poison.","rating":3,"reviewer":"RettaO","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3275833480","title":"What the he** happened??","comment":"IPhone Xs Max and X, this app used to be excellent. Now it's full of lag and has a lot of trouble with my SwiftKey keyboard. Almost unusable now with IOS 12.","rating":1,"reviewer":"Fishmac Who","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3274751771","title":"Don’t honestly know why I keep paying them","comment":"Bug of the week club.  \n\nToday: trying to save a simple pdf I’m viewing in chrome using the send-to menu. Evernote’s cute little dialog comes up. But it never finishes. Sits there with the wheel spinning forever. Hit cancel and “unable to save note” shows up for a moment in another dialogue. Really?!?!?  I couldn’t tell.\n\nStill a problem.","rating":3,"reviewer":"timesucker","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3272962778","title":"Super buggy","comment":"Whenever I load the app, the devices screen pops up and fails to load the my notes. Disappointed","rating":1,"reviewer":"asx777","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3266762333","title":"iPhone app not syncing","comment":"I’ve been a subscriber since 2011 and LOVE the Evernote service. I use it for everything - meeting recording’s, receipts, web clipper, outlines, you name it. However, I submitted a ticket almost 2 weeks ago and still not heard back on why my iPhone app isn’t syncing with my account. I also submitted an inquiry via @EvernoteHelps Twitter handle and still have not heard back regarding that ticket number.  How else am I supposed to communicate the challenges that I’m having?","rating":2,"reviewer":"Hurrikoehn","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3266697703","title":"Tags in Tree Hierarchy","comment":"I love Evernote desktop and I have tried to love Evernote for iOS for years now. I have my 10000+ notes organized by a hierarchy (tree) of tags. This works great on the desktop version because the tag tree can be nicely displayed on the left side of the window. \n\nI wish iOS Evernote had the ability to display that same tag tree. It seems the iOS design is a completely different product than the desktop version.\n\nI have searched for Evernote alternatives because of this and each are missing some key features. The one alternative I like the best is Synology Note Station. You do need Synology NAS hardware and they do not have all the Evernote features, but at least their desktop, web and iOS apps are almost identical in usability.\n\nPlease Evernote, make your iOS version more like the desktop version with a collapsible tag tree view.","rating":2,"reviewer":"JayApper","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3266270847","title":"Where’s the dark theme?","comment":"Join the club, I white screen gets tiring on the eyes.","rating":3,"reviewer":"Christian-stone","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3264812289","title":"Can’t even change the font color","comment":"How is this supposed to be on of the best note softwares when you can’t even change the font color?! 🙄 why can’t something just be simple.","rating":2,"reviewer":"alwaystheannoyedone","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3263989794","title":"Current Version Freezes up on iPhone 6","comment":"Love Evernote, but ever since the last update I can’t access my notes without it freezing.","rating":3,"reviewer":"Coljn707","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3263646763","title":"Good app, the WORST support","comment":"Don’t get me wrong, I like the functionality for note taking and ease of syncing between devices but these guys literally have ZERO support on any issues. I have 4 open tickets and 3 weeks worth of requesting support with literally no response from Evernote. It’s BS seeing as though I paid for Premium subscription. \n\nVERY DISAPPOINTED","rating":2,"reviewer":"Stevaughan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3263546095","title":"ANOTHER subscription-based app","comment":"Everyone wants to do subscriptions now. No thank you. I’ve uninstalled this app.","rating":1,"reviewer":"SotRH","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3263156012","title":"Some problems and a feature request","comment":"On a 10.5 ipad, often I can’t add anything to the end of a note. cursor just freezes.\n\nCreated Siri voice shortcuts, made on iPad, to specific notes can’t be be accessed using iPhone. There should be parity between devices for using voice.\n\nFeature request:\nOpening a note will automatically scroll you to your previous location in the note, so you can pick up where you left off. Would be fine as an optional toggle","rating":3,"reviewer":"capedape","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3262608703","title":"Recent update has bugs","comment":"Recent update is buggy. When reading a note, EN hangs and needs to be rebooted. Please fix.","rating":1,"reviewer":"Andybenbow","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3261882959","title":"Pinwheel of death","comment":"With the most recent update, I have had to wait a bit to get to my notes, which means I can no longer quickly jot down my thoughts. This is a problem for me. Please remedy.","rating":2,"reviewer":"Jhgkc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3261374762","title":"Broken cursor control","comment":"The last set of updates seem to have broken cursor control. I’ve been an Evernote user for several years and this is the first time that basic functionality has been so broken with seemingly no fix in sight. Has me testing out MS OneNote. Thinking maybe it’s time to make the switch.","rating":1,"reviewer":"dmcpple","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3260263500","title":"Mobile version needs undo button","comment":"The mobile version really needs an undo button \nMillion of times, it happened that accidentally I selected part of text and then hit a word on keyboard, and it was all gone \nNo Return on everything I typed \nSo please add this feature","rating":5,"reviewer":"Farahzadi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3257074361","title":"Would recommend to anyone.","comment":"Love it ❤️","rating":5,"reviewer":"Mranonn","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3256069961","title":"Can’t move cursor","comment":"Now when I press on the screen, the cursor doesn’t move. When did this happen?\n\nALSO, ADD FUNCTIONALITY TO SELECT AND REMOVE TEXT WITHOUT HAVING TO OPEN THE KEYBOARD. Try it and you will see what I mean.","rating":2,"reviewer":"flozzel","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3255413015","title":"What happened?","comment":"At one time this was one of my favorite apps. Now search isn't working properly and hasn't for a while. New notes simply vanish. Sometimes I go to a note and it won't load, even with strong wifi. That along with chronic crashes has me thinking of going back to paper.","rating":1,"reviewer":"Carey35209","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3253678798","title":"Terrible customer service","comment":"Paid for premium, won’t take even though paid for it six weeks ago and customer service ignoring emails. Deleting.","rating":1,"reviewer":"dlmnow","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3249751099","title":"iPad could use more functionality","comment":"Tab style navigation would be nice so you could work on more than one note at a time. \n\nMore intuitive tables would make this shine like it does on Mac. \n\nSome basic functionality from Mac should be brought over to iPad so I don’t need to use my computer. \n\nWhere are the pro features?","rating":1,"reviewer":"a1n2d3y7","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3249657107","title":"A Poet/Songwriter’s Dream","comment":"I can record concepts, write, take pictures, hand write notes and even more.\n\nThe greatest part about this is... I can access on it on multiple devices!!! My iPad, iPhone, Mac, work PC, my mothers phone! Lol it’s great seriously.","rating":5,"reviewer":"WenGrace","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3249162000","title":"I don’t know what happened with this new update...","comment":"I have always loved Evernote and even when they’re updates didn’t always service my needs, the app was still useable. I’m not sure what happened with the new update, but it makes editing notes impossible. It actually switches between notes as I attempt to type in one. I think this has something to do with the related notes section at the bottom of every note. This feature is not helpful and I prefer if it were removed or a new update needs to be rolled out to fix this issue.","rating":3,"reviewer":"Hehehe!43","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3248896765","title":"Font size issue.","comment":"Got this app after friends recommended it and I’m loving it. I’m more organized and productive already. Love the notebook layout and the cross platform from Windows to iPhone.\n\nBut there’s an issue that reallllly bothers me. Font sizes aren’t consistent across the app on Windows 10 and the iPhone app.\n\nI ran a test to see what font sizes corresponds to small, medium, and large. Small on iPhone is 10 on Windows app.\nMedium is 14. Large is 18.\n\nExcept something written in “small” on an iPhone, when viewed on a PC and compared to something written in 10 on the Windows app, the text originally written on Windows is larger than the text written on iPhone, despite them both being “10”. If I highlight the text from the iPhone and then select 10 again, it will grow ever so slightly to match the PC font size of 10.\n\nThe opposite happens if I write something in 10 on PC and then view it on an iPhone and compare it to something written in “small.” What is written in “small” is larger than what was written in 10 on the PC.\n\nThis is really frustrating because it results in inconsistencies throughout your notes.\n\nI know you guys care about organization, design, and consistency. So please fix this issue.\n\nOther than that, the app is great, would be 5 stars, but this is really frustrating. You can’t have an app meant for organization have something as basic as font size be inconsistent like this.\n\nThanks for reading this feedback.","rating":4,"reviewer":"1 & only bagel boy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3248230881","title":"New version=can’t paste text","comment":"Overall good app. Recent version is frustrating though because I am unable to paste text to the bottom of my notes. \n\nThe app thinks I’m clicking on a link on ‘Related Notes and Articles”.  When the keyboard appears, this disappears and in theory it shouldn’t be an issue. Well... even though it’s invisible, it’s still there and apparently I keep clicking on an invisible link. Keeps taking me out of my current note. Please fix. Productivity using the app is going down.","rating":2,"reviewer":"Mr E.Z.","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3248185966","title":"Don’t use","comment":"Don’t use Evernote unless you want whatever images and receipts you put in it to disappear. I told them they either had to get my stuff back or I want a full refund. Whats sad is I’ve only used it for a day. I wouldn’t ever give it 1 star.","rating":1,"reviewer":"Christina Fauska","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3246072542","title":"What happened?","comment":"The app used to work great! Recently it’s been slow to load, but the most ANNOYING thing is I look at a recipe, put my phone down, unlock my phone, and Evernote resets everything BACK to the main list. I lost my place and have to find and scroll all the way back to where I was. Please fix this.","rating":2,"reviewer":"Stratoti","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3245672480","title":"More hassle then its worth","comment":"Its a nice idea. But lots of other ways to do the same thing this app does. Has a learning curve which is hard to get over because everything you click on opens a window asking you to upgrade to the paid version. Im trying the free basic version to see if I like it. Bit when I spend more time closing the harassing popups pushing me to Buy the upgrade I spend less time using the app to see if its productive or not. After 4 days I give up! Pop up ads, emails and notifications to upgrade, upgrade & upgrade! Guess what? I deleted, deleted & deleted and will just keep using Google. After all thats all this is is a different version of Google drive.","rating":1,"reviewer":"fladjengineer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3245285976","title":"Long-time user, first-time caller, have fallen out of love","comment":"I have been an avid, paid Evernote user since 2012 and have been relentlessly filling it with my articles, work notes, recipes, etc. on a daily basis. I’ve noticed a decline in quality over the years — a bizarre focus on business users and features I (and apparently many others) find utterly useless, while good features are abandoned (goodbye, presentation mode on iOS!) and widely-reported quirks and bugs are seemingly ignored. I frowned, shrugged and learned to live with the issues. Now that the pricing model has changed I find it untenable, and am moving out, probably to OneNote. I’m sad that this once stalwart app/service has deteriorated to this point.","rating":2,"reviewer":"Citymouse","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3243571416","title":"H - E - L - P","comment":"I can’t Past text that Copy from other sites or applications....\n\nPLEASE HELP....!!!!!!!","rating":1,"reviewer":"RichardGamboa","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3242073207","title":"Add notebooks but they don’t show up","comment":"If you add a Notebook then your at a website and you go to save that site to the new notebook the notebook doesn’t appear. You have to reinstall the app for the new notebook to appear. Seriously?","rating":1,"reviewer":"Mrbrentbt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3240816717","title":"Bugs","comment":"I’m a paid user since 2012. But now I canceled and am looking for alternatives like apple notes. As a heavy user, the bug really bothers me. Small things like I can’t move the cursor when editing or the cursor jump to the bottom of the doc really hurts my productivity. Very disappointing app.","rating":2,"reviewer":"hchdbdhe","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3240669212","title":"Customer","comment":"Please stop breaking the core functionality with updates. We don’t need new features that no one uses. I’m tired of seeing a waiting wheel spin when all I did was open a blank note. This can spin for seconds - and sometimes it never stops spinning. \n\nI love Evernote and rely on it every day. Please get this right.","rating":1,"reviewer":"Jcraig1800","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3240645020","title":"You want to do everything, so you can’t do anything.","comment":"You were the best note app in the past. It’s too big, too slow. It’s a horrible experience to open it.","rating":3,"reviewer":"zgcxysqj","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3240638058","title":"Doesn’t work consistently on Apple Watch","comment":"I got it to show my notes one time on the Apple Watch. To do that I had to open the app on my iPhone. Kind of useless on the watch at that point. When I tried that same process again it didn’t work, and couldn’t get any notes to appear on the Watch.","rating":4,"reviewer":"Legend45","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3240638974","title":"Before paid version; Was an Excellent Useful App. Now it's slow","comment":"09-28-2018: Update, I am noticing using Evernote on my iPad that the cursor (when trying to select text) is now jumping around more often, at times subtly reformatting the text. Hope this glitch is fixed.\n\nI really like Evernote before paid version restrictions went into place-11/16/2017 lately evernote has decided to make me delete content because it exceeds my paid scale 50mb! So basically I have to delete a portion of my note to continue using any other part of evernote! \n\nAfter paid version: Except now it lags/ hangs every time I return to use it, even though I'm not signed out and app is open on iPad Pro. Annoying \nPast review: Version 8.0.3 hangs & very slow to load. Asks for password too often. 02/2017 update: on my IPad Pro: Evernote has gone downhill since it is now by subscription. I am a subscriber. Now I am not able to past into existing note to continue my research. This is terrible. Update app please, it use to work perfectly earlier last year.\nPast review: new paid version; takes forever to load, always asking for my password, slow to sync. Now that I'm paying it is much worse.  1st review before paid versions;Great for notes, saving web pages, text, photos....sharing with a team. Works on iPad great, appears on desktop & phone seamlessly.","rating":4,"reviewer":"Olympia3","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3236251356","title":"The bestest note app at all","comment":"I advice all users to download this amazing app.\nThanks Evernote team 👍🏻👍🏻👍🏻","rating":5,"reviewer":"BoWissaM","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3236243079","title":"What is happening to Evernote?","comment":"I used to be a HUGE fan. Of late quality issues are making the app UNUSABLE. If I write a note, it need to get saved, not just vanish into the ether. I lost some very important notes lately that realistically cannot be replaced. Puts me i a bind,so I’m going back to Apple Notes.","rating":2,"reviewer":"Cool idea, poor implimentation","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3233191790","title":"Need More Privacy at Sign In","comment":"I have my Evernote to require a sign in (or fingerprint) before opening on my iPhone. The problem I have is when I open the app the last note that was used is opened for a moment before the fingerprint is required. This reveals the whole note to anyone standing next to me that looks at my phone. Please correct this. This has always been an issue with me but I thought it would have been corrected by now without my having to complain. Thanks!","rating":4,"reviewer":"AreEGee","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3233011404","title":"Markdown","comment":"When will you support Markdown?\nIt is said that the Chinese version had supported it!","rating":3,"reviewer":"Sho Doko","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3232513147","title":"I have adhd and Evernote saved my life","comment":"Maybe that’s dramatic but I have nothing bad to say. I have never consistently used a note taking or organizational app ever. I just can’t (maybe fickle human. Maybe adhd). Evernote changed the game in that sense for me.","rating":5,"reviewer":"Jlg107","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3230920082","title":"Cost","comment":"They lock you out of all your files and every device until you pay their ransom! I can’t even get in to send a complaint email!!! I’ve been a premium member for 8 years, but $70 is too much.","rating":1,"reviewer":"rhosking","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3230384092","title":"Lower part of the note is un clickable","comment":"Please fix this issue and I will change the rating. On long notes once the top note text is already selected, scroll down to the bottom part of the note and you will notice none of the text is selectable. Paste/Copy menu is not showing up either. \n\nTHIS HAPPENS ONLY WHEN CONTEXT IS ON FOR NOTES","rating":1,"reviewer":"MiMo81","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3230135631","title":"Evernote","comment":"This is getting so freaking fun \nThanks for the updates and especially the dedication to Evernote ..","rating":5,"reviewer":"Kenyukai66","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3229752020","title":"Like the idea of Evernote but.....","comment":"First time i tried to log in, i had the wrong password. No help provided.  The program lists the things you probably are experiencing and wont allow you to suggest it might be something different. \n\nSecondly, i got an email with some new programs we could use, and have no idea how to download them or use them. Again no access to help. \n\nI don’t have time to beg for assistance. I like the idea of the program but the devil is in the details.","rating":2,"reviewer":"tomorrowisgood","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3229726948","title":"Search function had become much slower !!!!!","comment":"Evernote has deteriorated over time.\nI used to be able to search my notes even if not connected to the internet. My notes used to refuse in my phone. Now they are in the cloud and IT IS IMPOSIBLE TO DO A SEARCH IF NOT CONNECTED TO THE INTERNET !!!!!!!\n\nShame on you Evernote!!!!","rating":2,"reviewer":"watsteur","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3229685357","title":"My Favorite App BUT Editor, UI, Font needs Overhaul","comment":"Using Evernote for a number of years I love creating content, saving all my stuff and getting things into Evernote. It has come along way and admittedly one of my most used apps.\n\nBut for almost two years, the font and  writing in Evernote has been frustrating to use. The font has been small. The typography is bland and isn’t a pleasure to use. And the way in which I create content is painful to read. I usually read and write in other apps, leaving Evernote as a searchable storage. Its becoming harder to justify being a premium I’m member and even more challenging to stay on the platform all together. \n\nI feel Evernote could do a much better job with:\n\n- having more variety of premium font options\n- more viewing options with font size \n- cleaner and better looking Editor UI\n- more Editor functions (headers, etc)","rating":2,"reviewer":"omnizen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3229248482","title":"spell check","comment":"still blocks spell check for some reason","rating":3,"reviewer":"AlanHughes","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3228973190","title":"New Template function is fantastic","comment":"Very happy to be a premium user. The ability to create templates and use them as easily as EV has set this up is great. Thank you!!","rating":5,"reviewer":"Dmjkjyg","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3228953688","title":"Bugs...","comment":"There are still so many bugs in the iOS version. It’s impossible to edit a large note. \n\nAnd incredibly, the layout on iPad is still horrible. There is black in the upper left corner where apple has the date and time. Because it’s black in the Evernote’s layout, you can’t see it. \n\nYou have to wonder if they even care anymore.","rating":3,"reviewer":"klowy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3227404505","title":"WorkChat need some love","comment":"Hoping \"Add to WorkChat\" makes it into Siri. But I'd be happy if you just allows us to Share straight to WorkChat from any app.  Also, WorkChat deserves its own tab from main screen. Too many clicks needed to get to it to use it (if one can find it in the first place! Currently it's in the System tab? Why???)","rating":4,"reviewer":"TBB_Dood","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3226258382","title":"AWESOME","comment":"Great for taking notes in class & I like how I can highlight and add photos to my notes if I want. Also love how you can use it from any device","rating":5,"reviewer":"Markooh","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3225744816","title":"Would be great if templates actually worked","comment":"This is a great app for notetaking, but the template feature doesn't actually work. To begin with, I can't save them in the app itself? It's really annoying having to go to do this on the desktop website since apparently I can't even do this on Safari. And you also can't save your own note as a template even though in the official documentation this is supposedly a feature. So -2 stars because this theoretically great feature isn't actually working.","rating":3,"reviewer":"art3m15","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3225486116","title":"Love it, expect...","comment":"I love this app because it’s fast for me to get notes in instead of writing them all down on paper which I’m a slow writer, weird I’m a fast reader, anyways I recently reached my syncing storage limit and I don’t have money to upgrade (probably not going to anyway because I’m broke as it is, sorry). The NOTIFICATIONS are just so annoying, like I get it, you’re trying to make money and all by letting people know that every goddam time they are on the app that you don’t have storage but goddamn, I know I could just ignore it but it just makes me want to delete the app if anything. Anyways, I hope you guys do something about that because I’m broke and this is the easiest way for me to take notes but having that little red notification pop every second makes me want to rip my hair out.","rating":4,"reviewer":"Rhdbbdbdhdjdjehehd","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3224219063","title":"One star until security issue is fixed","comment":"Update: Took a while, but the security issue is now fixed. Thanks E. team. \n\nLove the app. Been using it for years now. But recently I have a huge security problem with the app. I have password protected my Evernote. However when I open the app on my iPhone X, I can see the last note I had been working on for a second before the password screen comes on - long enough for someone to take a snapshot if they wanted to. Please fix this issue immediately.","rating":5,"reviewer":"Amirali H","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3221467322","title":"Uploads duplicates docs, data limit drain","comment":"Evernote just uploaded 2MB of duplicate files that I shared with the app. Duplicate files are very common and use up the users data limit. \n\nThe free service offers a mere 60MB per month. \n\nSwitch to an alternate service while you can.","rating":1,"reviewer":"voice__of__reason","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3213547458","title":"Space for improvement","comment":"Evernote is an amazing note taking software that I’ve been using for ages. But, it’d be even better if I could attach pre-recorded audio files from voice memo for notes...thanks for giving such an amazing application to the world ❤️","rating":4,"reviewer":"Maya Ashllee","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3209968916","title":"Fix this Evernote","comment":"I don’t know what you guys did in last couple updates but every-time i open this app now it shows the notes that i have for a good 2 seconds and then take me to the passcode screen to put the passcode. Completely defeat the purpose of having the passcode. Please fix it","rating":2,"reviewer":"Omi140","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3207766710","title":"Long-time user","comment":"The text input is glitchy and slow post-update. Can’t select text in long notes— can’t get cursor to move half the time. Very disappointed.","rating":2,"reviewer":"Mercenary Writer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3207644661","title":"Won't let me edit","comment":"Deleted and reinstalled multiple times. Cannot edit notes. Won't accept clicks halfway through a note. Oftentimes switches to previous note while clicking into a note. Really odd behavior. Support hasn't found a fix.\nI've been a Premium Subscriber since the beginning and now I'm looking for something else. This stinks!","rating":1,"reviewer":"Ansk","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3204583269","title":"Going out of business. Not user friendly.","comment":"Done with this app, have heard so many awful things about this company. Don’t trust your information to this excuse of a technology company. Do your self a favor and go check out Bear and their user friendly layout.","rating":1,"reviewer":"basscomaus","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3201410628","title":"Great, except...","comment":"I love Evernote, I use it everyday in a sales role to track my daily activities, tasks, customer interaction. However, I wish it had an ‘undo’ button for the app! Ctrl + Z works for the online option but nothing for the app. Also, I use penultimate to write notes when I don’t have service to pull up Evernote, however it hasn’t been updated in a long time and I fear Evernote will get rid of it. Please add a handwriting app to Evernote!! And make it available offline please :)","rating":4,"reviewer":"StarryNights:)","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3199302374","title":"excellent","comment":"A good net notebook.","rating":5,"reviewer":"Baleuta","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3198194870","title":"Essential app","comment":"Love it","rating":5,"reviewer":"Jason8705","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3196053706","title":"Videos","comment":"It won’t let me watch videos that I had loaded on this","rating":1,"reviewer":"Dregirl27","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3195232029","title":"Evernote was an awesome service","comment":"The original version of this app was great, and updates had made it almost perfect. But lately it has just gotten slow and annoying.\n\nThe most recent update now has it doubling most of my keystrokes so to enter any substantial text I have to go to my laptop.","rating":3,"reviewer":"solak.v","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3194449897","title":"Causes my whole iPad to freeze for several minutes whenever I use it","comment":"Title says it all. It screws up my entire iPad. Didn’t have this problem until I installed Evernote. Only happens when I use the app.","rating":2,"reviewer":"DDFrit","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3194329562","title":"Broke","comment":"Used to be great, but now when I try to type in a note, it only goes to the last line and won’t let me type anywhere else. Seriously frustrating! I have to fight and fight to most of the time just fail and wait to go to a pc.","rating":1,"reviewer":"Marknhl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3193967590","title":"Great for taking school notes, but not without the upgrade","comment":"I recently just started using this app, it was recommended by one of my college teachers. At first, I thought it was going to be perfect for taking notes down! And it would be a great app, however for it to really be useful for this purpose, you need to pay for an upgrade. I am a poor college student! I can’t pay for upgrades. You can’t take very many notes without the upgrade, as the free version only allows you to use up so much space, which isn’t much at all. I will be searching for a different app now and deleting this one.","rating":2,"reviewer":"hm9006","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3192885722","title":"Formerly a great app","comment":"This once great app has gotten buggy and buggier. Evernote occasionally crashes or freezes when trying to update notes. Even worse, when bringing up the keyboard in an already created node, it covers up material that is not accessible until  you hit return many times at the bottom of the note to get the entire note above the keyboard area. Another bad feature that has been recently introduced is the hiding of the print button beneath multiple submenus. To print a note, as I often do, requires many steps before finding the print button hidden deep in submenus of the share option. Try Microsoft OneNote or other such excellent apps before using the once tremendous Evernote!","rating":2,"reviewer":"Flyfloats","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3192419487","title":"Used to love it, but now the UI is frustrating","comment":"I use Evernote for tracking multiple notes for work, and I always get SO frustrated when I’m typing a note, leave the app, come back in, and the app refreshes back to All Notes. Then I have to take 3 taps to get back in! \n\nIt’s also not intuitive that you are left the specific folder you are in (I keep a folder for each of the notes I take for a specific reason, such as the client I’m working in for the day) and when the app refreshes back to ALL NOTES, it’s a very jaunting experience to see notes that I are not the specific folder that I was just working in","rating":1,"reviewer":"DaCre8iv1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3190588904","title":"Very useful","comment":"I love this app ! It’s helps me, whenever I could lose notes. It’s extremely good for organization. However I suggest using Scannable to take the pics and then save them to Evernote. I just found it better that way and easier.","rating":4,"reviewer":"Tasani LOVE😍😘😍😘😍","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3185896054","title":"TOTAL SH#T — Don’t get trapped/fooled","comment":"So bad it makes you think of starting a class action lawsuit for legacy users who relied on the app and have now lost so much time and productivity dealing with the horribly designed and painfully slow piece of crap that it turned into. AVOID","rating":1,"reviewer":"LA guy2000","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3180045319","title":"Wonderful app, until the last update","comment":"This has been a wonderful app until the last update.  I can’t even highlight words anymore without the screen jumping and jumping and jumping.  I use an iPhone 10 btw.  Please fix this, it’s hindering my study and I have a subscription with ya’ll also.","rating":4,"reviewer":"MeowerzMEOW","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3178777237","title":"Dissatisfied Premium User","comment":"I’ve been a premium user for several years only to see this app love from pre-eminence to obscurity. \n\nIt’s really frustrating because there has been no focus on improving the fantastic features that put this app on the map. Instead, the focus has been on enterprise and business integration. NO!\n\nImprove on what got you here. I’m seriously considering moving to another app and not coming back. This is a painful realization given the time it will take to import into something else accurate. I put too much hope into this company staying in course. It has failed with no course correction in sight.","rating":1,"reviewer":"spiegeje","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3177011438","title":"Evernote not for everyone","comment":"If all you need is a good note taking app jump right in. If you’re like me, a paying Evernote premium member for years, it’s still not the app it used to be. \n\nMy newest complaint with this latest update is that the print option has been moved to a completely hidden location. I actually had to contact support and they had to walk me through the steps to find how to print my notes. I’m still trying to figure out why they moved in in the first place. It seems like sheer nonsense, like they’re changing things just to change them. I love the new look of the app but functionally I find it frustrating. \n\nAnd there’s the age old problem of the Presentation mode which has still not been brought back to Evernote on the iPhone and iPad apps. This is such an essential feature for me as I had previously used Evernote exclusively to do all my presentations as an instructor. I’ve had to switch back to using keynote on my iPad which means a lot more work, time energy and effort. What made presentation mode great was the simple interface of just presenting my notes as is. It was such a great way to teach and show images and walk people through my presentation. I’ve not been able to find another app that does this in the way that the older versions of Evernote did with Presentation mode. \n\nBecause of the recent changes in the print feature and overall functionality decline and the fact that Presentation mode has not been returned to Evernote despite endless user requests to do so. I will be canceling my Premium membership. If they ever bring back Presentation mode, I’ll be back in a heartbeat. Until then, I’ll keep searching for better options. \n\nAlthough there is no presentation mode, one app I’ve had success with as far as note taking is the Bear notes app. It’s a simple, straightforward notes app. It’s not heavy on features but it gets the job done and without constant changes and disappointments of losing good features.","rating":1,"reviewer":"Revtrin","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3176296934","title":"Does not have I cloud back up","comment":"Also long delays when trying to access/modify notes","rating":4,"reviewer":"fallon1001","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3175556045","title":"Just ONE highlight color","comment":"Dear Evernote developer, PLEASE do give us more options on the highlighter color! It’s probably the most basis thing for a note-taking app, but currently we still only have the yellow highlighter color. I’ve seen so many people been requesting this at your website forum since years ago, but there’s not improve at all!! Probably this is just the teeny tiny useless function from your aspect, but it’s really important for people who take it serious about their notes, and it’s stopping us from using your app too.","rating":1,"reviewer":"vivaARA","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3174864526","title":"Happy again...","comment":"I've fallen back in love with my 2nd brain app. I've even grown to prefer the new icon. Just wish they'd do recurring reminders.","rating":4,"reviewer":"robfuzz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3171293217","title":"Please Add Apple Pencil support","comment":"The pencil works with the app but doesn’t add functionality. This would be the best pdf consumption and annotation and storage app, an entire solution for schools and businesses, if I could scroll through a document with my hand and highlight with pencil... really missing a great opportunity","rating":4,"reviewer":"JHL4","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3170081455","title":"Passcode","comment":"I have a passcode on my Evernote. When you open the app, it gives about a 2 second window showing what you were working on last. Not exactly the best passcode protection.","rating":1,"reviewer":"Rimshak","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3168191604","title":"Improve the lock function","comment":"I set Evernote to require password/fingerprint before accessing my notes. However, when opening, Evernote displays the last opened note for a brief moment before the unlock screen pops up. Enough time to catch a glance of the note. I would greatly appreciate this quirk being cleaned up so I can have full confidence in the security and privacy of my notes.","rating":4,"reviewer":"Silleloc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3164631638","title":"Nice app, but not worth the upgrade","comment":"I have used Evernote for several years now. It’s nice for clipping websites and taking notes. I have recorded conference calls with success. With the iPad mini and a decent stylus I can attend a conference and not need anything else.\n\nHowever, I find paying $7 a month to write on PDFs to be crazy. It would be convenient, but also a ripoff. A one time upgrade is of $10 is far more reasonable.","rating":4,"reviewer":"Miss Dumplin'","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3161786312","title":"Evernote still the best for organizing and searching","comment":"I have tried OneNote a few times to see if it was as good as Evernote.  OneNote has good editing tools within a note, but seems to be lacking when comes to FINDING your notes. I like Evernote’s search ability - select one ore more tags or a notebook - and then search within that context.  I like that you can see Evernote’s list of tags at a glance on the left - and then quickly see a list of those notes that have that tag.  And when you put in a search string, Evernote instantly shows you a list of notes that match, along with the first few lines of the note - even if what you’re searching for is within an embedded image (or PDF file since I have Premium).  This ability to quickly find what you’re looking for within a thousand notes is critical for me.  I don’t think ON is a replacement for Evernote for me - because of this alone.  I hope Evernote stays afloat for a long time to come!","rating":5,"reviewer":"MikeInCarrolltonTexas","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3160732600","title":"So much missing potential","comment":"This product could be amazing if they just focused on their core product. The fact that I can’t even archive something is extremely frustrating. The new UI is kinda clunky (the old one was too) and thumbnails only appear when documents in the note are stored locally which makes it difficult to skim through things. I really believe this product has potential, it just needs polished and some focus.","rating":3,"reviewer":"xXMr.MentosXx","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3156693551","title":"Lost notes","comment":"I’ve been with Evernote for around 2 years now. That app removed itself from my homepage after the update and now I can’t recover my notes. Getting ahold of Evernote support seems impossible due to the customer service number having no connection to an actual person. I just want to get my notes back to handle the important things I have to handle. 5 stars if I can retrieve my notes","rating":3,"reviewer":"idkwhyineedanicknameineedhelp","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3153493560","title":"Crashes on the iPhone","comment":"I really like the app quite a bit, my biggest complaint is that it crashes when I use it on my phone. I have the most current versions of Evernote and iOS but have never been able to use it in a mobile version.","rating":3,"reviewer":"ntnh22","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3153472446","title":"Keeps getting Worse","comment":"I hate that you have to push several buttons to do a ‘Search’. There used to be a dedicated button but now you have to tap on ‘other options’ and then click search. Also, the layout and user interface is hard to see, ugly, wastes a lot of space and trying to be too hip. Soon Im going to transfer all my notes to Notepad since Evernote has sooo much lag and the updates have not made things better.","rating":2,"reviewer":"SurekT","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3150681639","title":"Tags","comment":"Tags are my lifeblood. Please put a way to find tags without having to search for them. Needs to be an option as it is on the desktop to display in a straight list.","rating":2,"reviewer":"kentaro42","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3150021952","title":"Best note app ever","comment":"Hands down the best note app. The ability to sync across devices seamlessly is indispensable. The great UI and features makes my life so much more streamlined. Thank you Evernote!","rating":5,"reviewer":"Rockythewocky1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3148864163","title":"Used to be a good iPhone and iPad App","comment":"This used to be a good App for the iPhone and iPad, but recent “improvements” have made it harder and harder to use for simple lists.  And now the App has dropped synchronization across devices unless you pay.  Sorry, but I’m going back to Notes.","rating":2,"reviewer":"Kencureton","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3147499862","title":"Won't syncs","comment":"Will not sync my notes. And you don't have any answers I tried to get answer thought your help line. \n\nThis app isn’t working and you have no way to get ahold of any one to fix this big mess","rating":1,"reviewer":"Me246894","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3146007687","title":"Used to love....","comment":"I used to love it but no that i can only use it on one device without paying the premium upgrade fee.  I am worried about upgrading because of so many comments about not being able to cancel membership easily. Don’t need more stress in my life. This app was suppose to make it easier.","rating":2,"reviewer":"pja797","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3145278060","title":"Great app! Small gripe...","comment":"Great app. Works well. Only complaint is that when you open it, the homepage starts in “all notes” view which can be cluttered and confusing. Wish it started out with the main page of seeing all the notebooks in their categories rather than the unorganized notes page. Please make it an option?","rating":4,"reviewer":"carrieunderwoodfan9","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3142679594","title":"Useful as a Bucket of Warm Spit","comment":"There are no instructions for this app at all. And little online support. I have spent hours of searching and I still don’t know how to set up a sub-notebook under another notebook, how to drag or copy the contents of one note into another note, establish any kind of hierarchical structure at all.\n\nThe best thing I can say about Evernote is that it’s no worse than OneNote.\n\nI’m going back to pen and ink and file folders.","rating":1,"reviewer":"Mark922","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3142496382","title":"NO UNDO BUTTON FOR DELETED NOTES!!!","comment":"This stupid app has so many f-ing features to write ur notes down but when u accidentally click backspace on any note u have U CANT UNDO IT?!?!?! IVE LOST SOOO MUCH MATERIAL TO THIS S***T. F THIS IM GOING TO NOTABILITY, THIS APP IS GARBAGE!!!!!","rating":1,"reviewer":"app reviewer 1995","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3138489535","title":"This app frustrates me","comment":"I only use this app for school because my professor told us to load our homework on it before submitting it. I use my iPad to write my notes and then send it. If I do not click done before hitting the home button to look at the web, I lose all my writing. Have done this several time and think it’s the stupidest thing ever. None of the other note taking app loses my work I have done. The only thing I like about this app is that all my work is on one page and one file. Not worth a it though to lose everything for just trying to look at something else. Find another app if you are not forced to use it.","rating":2,"reviewer":"BeautifulCrazyLady","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3138124487","title":"Premium user and Support won’t respond","comment":"What is going on at Evernote!!? \nThey are not the same company they were back when I started with this app in 2009\n\nEvernote Im a premium subscriber and submitted a trouble ticket on 8/26, as of 8/31 no reply or even a confirmation email of receipt for the ticket. Whats up?\n\nYes I am frustrated and apologize for my tone, but it is SO frustrating to have these problems and to pay for a  premium annual subscription and not have a stable robust application to use, and then to have support ignore my need for help!!\n\nVery frustrating I can’t get support as a paid user from the desktop app as well because it gets stuck in a login loop. \n\nHey Evernote support if you pay any attention to these reviews here’s my problem...\nHere it is again…. PLEASE RESPOND!\n\nThe New app takes a looooooooong time to load\nNew app STILL has the annoying buggy issue when blocking a selection of text it’s severely laggs and often overshoot the area I’m trying to select. \n\nNew app STILL has the annoying buggy issue when Typing on the keyboard I actually finish typing and the screen is frozen and the text takes several seconds, I’ve timed up to 45 seconds before the words actually S L O O O O W L Y  appear on the screen. \n\nYes I’ve reset my iPhone, yes I’ve deleted and reinstalled the app. Yes I’ve sent support tickets to Evernote for help to no avail. And yes it behaves this way on all 3 of my mobile devices so it’s not just a hardware issue of a phone or an iPad it’s a software issue\n\nNew app still has the buggy issue when pasting or cutting a selection of text is severely laggy and hangs forever. This has been an ONGOING issue for since  6.x.x.x  \n\nThese bugs have been an ONGOING, ONGOING, ONGOING, ONGOING source of frustration since back to the 6.x.x.x  version","rating":1,"reviewer":"B-Drums","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3137110774","title":"Absolutely garbage","comment":"Can’t even see my tag hierarchy. Everything is buried in so many taps. This app is really poorly designed on so many levels.","rating":1,"reviewer":"Telfire","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3134644496","title":"Feels much faster with newest update","comment":"The app had slowed down so much I was had stopped using the mobile version entirely and was researching alternatives or just using an open-source client for the desktop version because I was paying for sync across devices and getting a terrible experience everywhere except desktop.\n\nThe app is significantly faster now, and much more useable. It remains to be seen if this will last.","rating":3,"reviewer":"Gjahsjssh","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3134554361","title":"HOW ABOUT FIXING ALERTS AND NOTIFICATIONS GUYS!!","comment":"*****update*****\nHOW ABOUT FIXING ALERTS AND NOTIFICATIONS GUYS!! \n\nSTILL ASKING!!!!    Have even set up with new phone and doesn’t work.  \n\nPlus I have to say who approved the UI for the new position for the change notification wheel?  Its a disaster.  You realize when you swipe up from the bottom of the screen you call up iOS Control Panel?   Yes?   Do you?   I don’t think so otherwise you would not have jammed the change reminder dare menu to fully flush with the bottom screen edge!\n\nIts been years and with all the bug fixes etc they still can’t get simple reminder alerts to work!   Come on gang let’s fix it!\n\nCrashes a bunch and sync problems cause a panic now and again when a whole raft of notes disappear, however, I like tw ecosystem and can see the potential.  Still way better than apple notes","rating":2,"reviewer":"BCap","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3133720529","title":"Deleting my past comment","comment":"Maybe I misconstrued my internet server’s uploading issue with the app’s sync capacity, not entirely conformed though","rating":4,"reviewer":"qqoripyo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3132606830","title":"Unable to sync on iPad - resolved","comment":"Took 2 uninstall/reinstall cycles but finally able to sync; still frustrated that, as a premium subscriber, I had no reply to requests for support for 2 weeks after sending multiple requests","rating":3,"reviewer":"123traveler2016","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3132400365","title":"So good!! Get the premium version!!","comment":"Love this app!! I first got it for a business card scanner, then adapter it to everyday life and work.  I can’t live without it.  So easy to clip emails, websites, sticky notes.  Organize your life with this, you won’t regret it!!","rating":5,"reviewer":"Msjessikaw","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3130153316","title":"Tricked into upgrading!","comment":"I’m one of the earliest Evernote users, but then we also bought our first computer so early that it could only boot up from a 5.25-inch floppy!\n\nSo I was a very early user of Evernote when there just weren’t that many good options out there. A few updates ago, the request to log in somehow tripped a switch that revealed to Evernote what I had paid, as well as the horrifying revelation that I wasn’t paying a subscription fee!\n\nSo I checked out all the various payment levels and plans but am sorry to report that Evernote’s obscene prices are simply not justified by their product. An update for which your description reveals that you’ve changed the icon (bad move, unfortunately) rather than correcting some of the rather frightening failures that I as well as other reviewers have reported is not just disappointing; it is simply an example of nothing less than the sort of runaway greed that we routinely see in the market once a product becomes well known enough that the makers feel they can sit back and enjoy their position without continuing to earn it.\n\nThis was an easy choice—sign up, copy and paste to another SIMPLER (stress intentional, as I doubt they’d let me name a competitor) but tremendously improved notes app, delete Evernote, then cancel payment. And thanks for the warnings, reviewers—I’ll be carefully watching our charges in iTunes!","rating":1,"reviewer":"TechWriter7","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3129505349","title":"The new icon is ugly!","comment":"It looks cheap! Please bring back the old one!","rating":1,"reviewer":"gyan714","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3127055088","title":"HATE WHITE ICON","comment":"Evernote looks stupid on my home screen. May need to bury deep somewhere. Can only find with a pull down so I don’t have to see uglyness.","rating":5,"reviewer":"Zombified2","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3126583948","title":"Trying to cancel is a nightmare...","comment":"I’ve been trying to cancel my app and laptop Evernote because I NEVER use it and can not find a way to reach anyone for help! This is the one thing that will make me never use anything again! But then again you keep getting my mo way because I can’t cancel so there’s that!","rating":1,"reviewer":"fwieser","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3125518884","title":"Great App- One Problem","comment":"Overall a great app. One addition that I’d like is to be able to set a picture as the note picture you see when you scroll through your notebooks.","rating":4,"reviewer":"PaJana Party","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3124494618","title":"New logo...but still haven’t brought back Tags page","comment":"You’ve got this fancy new logo, but haven’t done anything of note to the app itself. The functionality you took away several versions ago, the ability to see all of your tags, needs to come back. Tags is the entire reason to even use Evernote. It’s ridiculous that they aren’t here. And let’s not get started on the lack of inheritance on the tags.\n\nTags facilitate step one of your 5 step plan: “Organize your life”. For you to not realize this shows that you don’t know what you’re doing. Someone is going to make a NextCloud-esque version of this and people will move to that like they are moving from Dropbox. Evernote functionality, but open source and you provide your own server. Good luck!","rating":1,"reviewer":"CharlesEdwards_III","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3117816451","title":"Two problems to fix","comment":"When taking a note, there are many problems with Voiceover. First, when swiping to the right, sometimes it skips over the title field & other times it skips over the multi-line text field. When typing in the field, you can’t move by letter or word & have it affect where the cursor is located. When The keyboard is brought up from simply looking at a note, the cursor is somewhere in the middle of the text already in it. Unlike most text fields, double tapping on it does not move the cursor to the start or the end of the text field. You also cannot listen to the entire note when the keyboard is available. This makes creating & editing notes inaccessible to Voiceover.\n   Sharing to Evernote takes a long time after entering text & choosing the folder. Once I hit save, a loading icon is shown while I have to wait for a long time to share it.\n    If these problems are solved, I will be satisfied with Evernote. Until Evernote is Voiceover accessible, I will use another note taking app that is accessible.","rating":3,"reviewer":"BlindInsight","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3117209683","title":"Great App overall, problems with recent update","comment":"I use this app for everything and use it multiple times a day. It’s been a great resource for me and my business. \n\nMy only caveat is two-fold. \n\nFirst, in the most recent update, paragraph breaks disappear randomly after having written a note, jumping to another app and then coming back to that note. \n\nSecond, there are a few differences between the iOS version and macOS version that can make it a little frustrating from time to time. \n\nBut overall this is a great app and I couldn’t do what I do without it.","rating":4,"reviewer":"PhilmoreCreative","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3114385393","title":"Where’d the themes go?","comment":"I can haz a dark mode, please?","rating":4,"reviewer":"Solusfides","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3114273359","title":"Frustrated with this app","comment":"So I use Evernote for keeping all of my special files clear, trying to make folders however is becoming maddening. I will make a folder it says it’s been made go to move the not me to the folder I just made and it’s gone.. vanished. Contacted company and they give me some email to go the steps to fix it. It did nothing. It’s a big in the app. I hope they fix it soon or I’ll have to move all my stuff to google.","rating":2,"reviewer":"Julieg's moosic!!","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3112637687","title":"Too expensive!","comment":"But worth it.","rating":5,"reviewer":"Chauchau06","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3111977004","title":"Cannot login to Evernote China while in US","comment":"Super annoying. Can’t get access to my notes. I’m switching to onenote.","rating":1,"reviewer":"FosterEee","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3110389993","title":"Can we get the green icon back?","comment":"It’s always good, but can we get the green icon back? Thank you!\n\nHope the windows version can have an overall access password after login like the iPhone version.","rating":5,"reviewer":"Easy, simple, everything.","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3108353020","title":"Serious security issue","comment":"Recently, since early July 2018, I have been experiencing what I consider to be a serious security issue. When accessing Evernote on my iPad 2 Air, for about 3 seconds the last document that I was using before closing the app is shown at which time the secure login kicks in. Not good if the wrong person sees the wrong stuff! This needs to be addressed soon!","rating":3,"reviewer":"BWShell","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3107986524","title":"Evernote brilliance","comment":"Indispensable application but the latest release is buggy on IoS when editing. I keep having to exit the document and re-enter to position the cursor","rating":4,"reviewer":"NotJustAnyoneLLC","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3106027863","title":"What happened to Business Card Scanner","comment":"This feature stopped working in this version.  Please bring it back.","rating":2,"reviewer":"Evernote Obsessed","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3105943655","title":"Still no support for iPad split keyboard???","comment":"Split keyboard makes the text input occur below the screen. \n\nI’ve been asking support to fix this for three years. I always hear a fix is coming soon. Why won’t you this?","rating":4,"reviewer":"ms3***","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3104476061","title":"Horrible","comment":"Well Evernote, you did it again.   You managed to ruin the best thing about this app, the beautiful green icon.   Now, a cheap feeling white background just changes the entire feel.   I will move it from my home screen now and probably not use it as much, as I used to keep this app front and center on my home screen because of how great it looked, and it caused me to use it almost every day.   Now I’m hiding it in a folder because it’s ugly.   Thanks","rating":2,"reviewer":"D.weg13","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3103514605","title":"Missing Quick Links","comment":"I’ve been using for about3-4 years.  I miss the older version where there was an alphabet listing to the right so you can get to a specific note faster. (Similar to how the contacts in iOS looks).","rating":3,"reviewer":"HuggyBearTX","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3102535134","title":"This update is horrific","comment":"All the stuff I had saved in Evernote is gone except for a few things. I wish there was a zero rating. I can’t ever get a lot of that stuff back.","rating":1,"reviewer":"ACMatthews","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3101155438","title":"Become unreliable","comment":"Keeps needing to be down loaded and all info reinstalled. Frustrating","rating":2,"reviewer":"RhpRhp","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3101085992","title":"Thieves","comment":"You made me put 1 star on to post this but I give you a big fat zero stars. What happened to all my stuff?? I had dozens of recipes and some nutritional articles in my Evernote app. I hadn’t been in there for some time, not since before I got my iPad Pro. I went in there last night for one and NOTHING was in there! All there was was 2 paid options for use of the app. I’m angry. I have a special diet and now I’ve lost all those recipes.","rating":1,"reviewer":"Finnysmom","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3099970398","title":"My Assistant","comment":"This app is great! It keeps me organized on a daily basis! I’m always covered in an instant!! Love it!","rating":5,"reviewer":"PTNel","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3099337639","title":"Evernote slogan is Misleading...","comment":"They say, “YOUR INFORMATION, when you need it.” -WRONG!!! They encrypt “YOUR INFORMATION” with their own proprietary format -making it -“THIER INFORMATION”-so that when it comes time to retrieve “YOUR INFORMATION” in larger quantities, lets say archiving or whatever have you, it has to then be reopened in “THIER APP-NOW MAKING THEIR INFORMATION” in order for it to be used. \n\nThis is just pure greed and a sad attempt at customer retention. I was just going to leave this app alone with regard to writing a review but after hundreds of dollars have been spent as well as numerous hours in study, I thought: “PEOPLE DESERVE TO KNOW ABOUT THIS DECEPTION!!!”\n\nI would love to change this review if Evernote ever decides to GIVE ME BACK MY INFORMATION by formatting it into its basic formatting - like the “Notebooks” application does. Oh yeah, it can be done and is available.\n\nTo the Consumer/Student: \nI HIGHLY recommend checking out the application: “Notebooks,” and I DON’T RECOMMEND THIS APPLICATION for misleading consumers; the HUGE REASON mentioned above.","rating":1,"reviewer":"E.j.Teegarden","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3093279194","title":"Icon Hard to See","comment":"I am a lighting fan and user of Evernote but the app icon changes (on iOS and Mac) are difficult. The white background is hard to see, no longer stands out and instead blends in against the options and offerings. Mads doesn’t look approachable but instead looks aloof. \n\nGive me a way to change the app icon background please. I know it’s possible in iOS and Mac and would help the graphics of such an iconic app return to prominence on my home screen.","rating":1,"reviewer":"EricKlein428","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3093124398","title":"Almost spent $70 on this","comment":"I opened the app and it immediately opened up a screen to charge me $69.99 for this app! It came out of nowhere, and I almost accepted it. I will NEVER spend that much on this app, let alone the fact that $69.99 is only for one year.","rating":1,"reviewer":"Pokebored1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3092815226","title":"Jumping Ship","comment":"I used to love Evernote. I was a premium user since 2011. I bought the branded Moleskin, I listened to their podcast and believed in their company but year after year, it turned into a cash grab and then a gouge. Now this company is unresponsive and doesn’t fix their tools (check Evernote’s forums!) and it’s device limits are absolutely ridiculous. They’ve slowly taken away sharing options in the app, knowing that your notes are enough to hold you hostage. You’re being milked.","rating":1,"reviewer":"Pete Mayhem","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3092549878","title":"New icon, same non existent tag support.","comment":"Still horrendous tag viewing. \nStill no nested tags for iOS.\nStill takes forever to load some notes, even though notebook has been downloaded. \nStill have cumbersome option bars for bold, italic and indent. \nBut thanks for the cool new icon.","rating":1,"reviewer":"Joetama","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3091596684","title":"No customer service","comment":"A shame because it is such a powerful app, but there’s no way to access the developers in a timely manner if there are problems","rating":2,"reviewer":"clilyreviews","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3088394647","title":"Just became useless","comment":"Evernote was one of my favorite apps until yesterday. I was  notified I could only use it on one m device unless I pay  $96 a year.  Goggle docs will do the same job for free","rating":1,"reviewer":"epmmmmmmmmhgnmmhgm","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3088383863","title":"New design","comment":"The new style and fonts are awesome!","rating":5,"reviewer":"Pshella","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3083690888","title":"User for Years and Years.","comment":"I strongly dislike the new white theme - Especially since they haven’t provided any alternative themes.","rating":2,"reviewer":"123abcxyz123","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3082803094","title":"White background hurts eyes","comment":"Please make the black background so that I can sit for longer duration. Thank you.","rating":3,"reviewer":"Abhjeet singh","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3082684455","title":"Premium subscription","comment":"Says can cancel it at anytime. But..There is no link to cancel i have been searching unsuccessfully and paid 3 months at least unwanted membership. They make it impossible to actually contact them or find out how in app store to cancel this.","rating":1,"reviewer":"Bz working mom","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3080737428","title":"Love the new look","comment":"Evernote is better than ever and the updated elephant and new icon says it all. My whole life is in here! Love it!!!","rating":5,"reviewer":"JRB66","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3079734944","title":"Washed Out & Weak...","comment":"Well...I’ve been a faithful Evernote user for many years now - Premium at that - and I love pretty much everything about it.  I do have to say, though, that the design of the new logo/app icon is HORRENDOUS!!  White app icon background?  Really??  C’mon Evernote!  If MLB can allow us to change our app icon, you can too.  PLEASE GIVE US THE OPTION OF APP ICONS...white looks weak and washed out.  I don’t care about the “design” of the elephant, keep it...just give us the option to go back to the GREEN BACKGROUND for the APP ICON.\n\nI’m dropping to a two-star rating because of this!  Everything else works as advertised.  Call me petty, but the new app icon is washed out and weak.","rating":2,"reviewer":"McKeebler","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3078795365","title":"No universal undo. If you make a mistake it’s a pain","comment":"After simplifying formatting for a note, There was no way to undo the formatting.\nA HUGE waste of time. \nAlthough there’s plenty of screen space to put a VISIBLE undo button in easy access on all screens, there is none, and this is a MAJOR oversight. Sometimes developers do this in order to have a cleaner look of the user interface, however most people prefer An app’s usability over a clean user interface. At the very least there should be the option to customize the menu bar to add a universal undo to all screens just like you can do on most computer programs on Macintosh.","rating":2,"reviewer":"NeedHim.org","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3078155717","title":"Great note organization features, bad implementation","comment":"Been using Evernote both on iMac and iOS devices since 2008.\n\nIt includes all important sorting and organizing features: Notebooks (note collections), Notebook stacks (Notebooks collections), Tags and Favorites for your notes.\nIt has many other features, like layouts, collaborations, To do lists, tables, attachments, syncing, etc..\nCollecting notes is quick, but surprisingly, Evernote’s display and editing of notes, on either iMac or iPhone has been a nightmare for the past few years - \n\nNo matter what I tried, the notes are always displayed huge! on iMac 27” I zoom out, every note I open. On iPhone 8+, the option doesn’t even exist while in a note. In a notes list, there’s an option to adjust between 3 sizes, and if to include attached image or other info -\nEven selecting “Title” only and small for size, the text is huge with much real-estate wasted, trying to provide a clean look?\n\nTrying to create a readable note with headers, paragraphs with appropriate spacing is impossible both on Mac and iOS.\ncreating a table, also creates huge cells with too much spacing between the letters and the cell border, and cannot be reduced.\n\nClipping a note from external source, is quick.\nBut again - Adjusting it to your liking, is tedious, and many times not even possible.\n\nAnother annoyance, Evernote assumes that all users collaborate with others!\nBecause on iOS, there’s a large button “shared with me”, and on a Mac, the header of the side bar, has the account’s username button, and neither can be hidden or removed - I’m probably the only user, that doesn’t share their Mac, or others share notes with me :-(","rating":2,"reviewer":"Just_Me_Too56657","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3074255986","title":"Dark Theme please?","comment":"Oh no - the logo branding went fluorescent white!!! Talk about squinting....\n\nPlease bring us power users a dark theme for iOS and also Web OSX.  \n\nPLEASE?   thx much","rating":4,"reviewer":"2DNations","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3072685169","title":"Better","comment":"Great update for iPad. Noticeable upgrade in performance","rating":5,"reviewer":"rpaz14","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3069367836","title":"RE: New Icon","comment":"Customers: Pleeeease give us a dark mode!\nEvernote: Oh, you want to complain? Here’s even MORE white.","rating":4,"reviewer":"shotojamison","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3068523657","title":"Great app - new logo, not so great","comment":"I’m ocd. Hate the new color scheme, white/green. Please go back to green/gray. \n\nApp is amazing. Love being able to scan documents from my phone and they sync automatically to my Mac. It’s solid and has been for years. No brainer.","rating":1,"reviewer":"Lordk1ng","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3068317799","title":"Incessant crashes","comment":"Despite consistently using the most updated version of Evernote, I’m entirely unable to use this app for more than 30 seconds without it crashing and most frequently deleting my most recent work. I’m unsure if anyone else is having the same experience, but this app is virtually worthless at this point.","rating":1,"reviewer":"Aubert L'Espérance","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3065751366","title":"A waste of time","comment":"Cannot change login email on a basic account.  No matter what they say, there is no security settings in the basic subscription to do so, nor is there any way to export themto a new account.\n\nAfter you have a bunch of notes, if you get a new email address, they are lost.\n\nThere is no support.  Just like PB, they entice you with ‘free’  then try to charge you to get it back.  NOTHING IS EVER FREE.","rating":1,"reviewer":"cciyyyt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3065699739","title":"Don’t Like New Icon","comment":"Not a fan of the “updated” icon. Tend to find that the android version works more smoothly than iOS but still use it on multiple platforms.","rating":4,"reviewer":"I. Gede Mangku","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3065535012","title":"They fixed it","comment":"New update runs fast","rating":5,"reviewer":"hvyrocker","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3065397783","title":"No present!?","comment":"Bring back present mode...please!","rating":3,"reviewer":"andyjamesmeyer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3064457418","title":"Lost all my notes in the app","comment":"With the latest (major) update, I no longer have any notes that show up.","rating":1,"reviewer":"Skywalkm","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3064395351","title":"App keeps getting better","comment":"All enhancements have been great. 👍🏼\n\nGreat you changed up the icon.  Other apps should follow suit.","rating":5,"reviewer":"Daddy111","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3064254067","title":"It is what it is","comment":"I got 5000 notes and around 500 tags...so I am able to make it work. My only reason for this review....the white icon is just awful.","rating":3,"reviewer":"Bobthepreaxher","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3064143257","title":"Charges for features, Microsoft One Note is free","comment":"I used Evernote for a while until they changed their way of doing business. They eventually limited users to only two devices. If you wanted more devices, you had to pay up. I switched to Microsoft One Note and haven’t looked back since. With One Note I can update on any of my devices including PC and have the information handy at any time with any of my devices. And it’s free!","rating":1,"reviewer":"John in Hawaii","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3064020324","title":"Security problem","comment":"Great app except last note viewed flashes on screen for a second before passcode entry screen shows upon opening app on iPhone. Not good at all.","rating":1,"reviewer":"dbikedoc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3063794110","title":"Please please bring back the old app icon","comment":"Or at least give us the option to choose between the two.","rating":4,"reviewer":"Oliver1222","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3060778668","title":"Awesome! Not","comment":"At one time I wrote a glaring review with a five-star rating. But now, and since they relegated non-paid users to nobody’s, ive changed my opinion. Lately, every time I try to share a note with someone, I get asked to verify my email address. I’m supposed to get an email as part of the process but one never comes. After dozens of times using the app on my MacBook Pro and my iPhone 6 PLUS, iPad mini, and even the website, I still never get the email. So there for I can not share a note any longer. \nI can not contact support because Evernote cares less about us freeloaders I guess. So I can get no help.","rating":2,"reviewer":"TommyG the Amazing","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3051490381","title":"Aaaand thats it. Moving everything over to another service","comment":"I used to like Evernote. It’s become EverNot. Thanks for the beautiful UI. But your pushy upgrades and now no-sync, stinks. The end. Buh bye now.","rating":1,"reviewer":"swiftouch","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3043004774","title":"My Evernote","comment":"I’m very disappointed in the performance of Evernote on my iPad.  It works quite well on my iphone, but is so very slow and often freezes on my ipad.  I have considered removing it and then trying to download again....I pay for the premium and am very disappointed in this performance.","rating":3,"reviewer":"Bauntbo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3032368744","title":"Love it but.....","comment":"Great app!!!! Very user friendly. It just needs an UNDO option for my iPhone.","rating":5,"reviewer":"Beautifull2107","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3021311825","title":"Disaster","comment":"Not that the people who made this app care (customer service is nonexistent), but I’ve lost access to my entire account. I’ve been a diehard Evernote user for years, but it’s gotten ridiculous since 2017, and this is the last straw for me. As a student, I need a document service I can actually rely on, and I cannot rely on Evernote anymore. \n\nFor those who are curious, I can’t use my account because it’s “on too many devices,” despite the fact that I’ve only ever used it on my phone and laptop. I should theoretically be able to fix this easily, but the device settings won’t load— anywhere. Not on my computer, my phone, or even in a web browser. Every time I open the app? It redirects me to the broken device settings page. There seems to be no way to retrieve my files. Troubleshooting has done nothing, customer service hasn’t helped.\n\nI’m pretty patient and I’ve never left a 1 Star review on anything before, but this is the umpteenth time I’ve had issues with Evernote. It was a great service in 2014– not so much anymore.","rating":1,"reviewer":"RachelRT","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3017823152","title":"Can’t update","comment":"I can’t update anymore, tried to log in to write a support email, but it kept on saying my account doesn’t exist!","rating":1,"reviewer":"Dooooobbbbbbbboooooo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3011915113","title":"New Interface","comment":"I loved Evernote. Signed up for premium, got charged but it won’t accept it. I tried to contact support and it tells me to sign up for premium for chat. Then I tried the new interface. When I click on the walk through it locks up and goes to a blank screen. Super dissatisfied with the app and their lack of reachable customer support.","rating":1,"reviewer":"somiller72","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3009037537","title":"Amazing app—poor UX changes","comment":"I have been using this app for several years and love it. Use it all the time on my iPhone and occasionally on the Mac. (BTW: the syncing often fails and I end up with two slightly different versions of each changed note.)\nNew dislike: list of notes now has lots of white space. Before I saw 8-10 notes (headings) on the screen, I now see 4. Much unnecessary scrolling. Why?? The note list option small/medium/large may be the solution, but it doesn’t appear to do anything.","rating":4,"reviewer":"Jerry77B","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3007541856","title":"STINKS","comment":"I’m so disappointed.  I have notes on here and can’t get to them unless I upgrade my plan - which I won’t.","rating":1,"reviewer":"Acwells","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3007439757","title":"Really sad & upset tbh...","comment":"This is legit the first time I’ve ever left a review for ANY app. That just shows how disappointed I am :( Being a YouTuber, content creator, model, etc. means I’m CONSTANTLY needing a place to write scripts, jot ideas down, plan social media posts, collaborate, etc. My go to app WAS Evernote until yesterday. Within the past week and a half the app AND online version started to get very buggy and would glitch out. Ok fine whatever. It happens. However, I was almost done writing a script for a very important video and without warning the WHOLE SCRIPT WAS DELETED. I wasn’t even using the app either. I was editing the script on Evernote.com. This was a HUGE script and literally lost everything. Now I’m back to square one and the video is extremely behind schedule, which had a very strict deadline. Then it happened to my other notes.... Either the whole note was deleted or random parts were deleted. Redo function didn’t do anything either. I lost over 20+ notes that were highly important And irreplaceable. Unfortunately I’m now looking for other note/editing software such as OneNote or Google Docs. Sorry Evernote. Maybe one day I’ll be able to use you again 😔😔😔😔","rating":2,"reviewer":"BecomingTheBestMe","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3004365722","title":"In love","comment":"I have been using Evernote for years, for everything from writing my life journal, to recording songs and writing lyrics. \n\nIt is beautiful and simple.\n\nThe more that I study software the more inspiring this app becomes because it does so much yet keeps its intuitiveness.\n\nThank you for your work.","rating":5,"reviewer":"Bruce the Mormon","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"3001722078","title":"Get it 👍","comment":"Much improved. \nSync has been reliable for a good while now. \nHope it doesn’t break again.","rating":4,"reviewer":"iMation_","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2998741233","title":"Lost information","comment":"I've used EverNote since 2016. Signed back into account to retrieve a password for an account and poof all my notes from years ago is gone. Just gone. Very disappointed.","rating":1,"reviewer":"Yog1980","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2991418359","title":"The best notes app","comment":"Great interface, easy to use, great syncing between devices, have a lot of useful tools. Very functional and powerful app to use at work, studying and personal life, love it!","rating":5,"reviewer":"Kevinbbanruque","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2988544509","title":"Oh Noooo...","comment":"LUVVV My EN... Must have .  And I SELL FOR YU. TRUST. \nAnd we needed an UPDATE In a Big Way... But I Will Not Do It Until You All Fix THESE Issues... We are Paying a Pretty Penny for a good app dudes. CAMON, Let's make it GREAT. \nYUP YUP- App is STILL MAKING DUPS. \n-WE NEED COLOUR TXT.\n- Pick Colour Block for NBOOK\n-NEED TO See SUBFOLDERS Within FOLDERS When Adding  \n   To NBOOK\n-NOTEBOOK LIMIT 250 ?  WAKKKK. \n-Audio to TEXT  ON iOS & OS .... HELLLOOOOOOOO. \n   'Camon... \n\n- BOOM. Done. \n  DO You NEED my NEPHEW  to come out & HELP ????","rating":4,"reviewer":"mldrocks","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2978037872","title":"Mobile web clipper broke with last update","comment":"The mobile web clipper has stopped working. When I tap the share arrow and choose Evernote, the Evernote pop up appears but the drop down that normally lists my notebooks is empty, cannot be edited, and will not allow me to save the page.","rating":5,"reviewer":"cheeseandglory","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2974365285","title":"Won't open since recent update","comment":"Evernote seems to go out of its way to make every update worse. The recent update has completely broken the app. Now it won't even open. I rely on Evernote to keep me well coordinated whether I'm on my desktop computer or using my iPad. Not being able to access Evernote on my iPad has really messed up my workflow. Not happy at all.","rating":1,"reviewer":"Sonia Quinones","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2974092125","title":"Worst App Ever","comment":"Make you think your paying $7.99 a month for Premium and that they give you 24 hours to cancel. Well they charged me $69.00 dollars less than 15 minutes after I upgraded. They are a bunch of thieves.","rating":1,"reviewer":"Yboda","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2973226014","title":"You have to pay to undo","comment":"You have to friken PAY to undo.","rating":1,"reviewer":"Pammala","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2972809224","title":"Makes iPad useful input device for Windows PCs","comment":"Normally an iPad is used as a display device and sometimes as a controller.  It can be used as a camera, but is usually too bulky.  Using the notes feature, in conjunction with the editing features of the iPad camera system and the location detection, Evernote can create very useful documents that can be used on the PC.\n\nManagement is enhanced by the ability to search for text or OCR images on the server.  Forcing synchronization is also a useful management tool although I often have trouble with synchronization on the PC.  The inability to control font size on the text entered on the iPad is still a problem.\n\nAs new versions are released, the user interface seems to change, requiring retraining without any help.  Additionally, the user interface on the various platforms appears to becoming so different that it interferes with interoperability.","rating":3,"reviewer":"Rodger584","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2971671496","title":"Online presence","comment":"With other apps I have the option of using it on my iPad only without having to login. There is too much data mining and breaches. Plus they are way better apps for not taking that is more secure than this one.","rating":1,"reviewer":"Asyounge","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2970626344","title":"REMOVE AUTO-HYPERLINKS PLEASE","comment":"For the love of god remove auto-hyperlinking. I don't want to link my notes to anything, yet every single time i type a phone number, time, email, or date, that horrendously obtrusive blue, underlined font shows up. It drives me insane. It's so simple, just allow users to turn it off.","rating":3,"reviewer":"nummynumm","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2970409559","title":"Overall Great Note App","comment":"I have been using Evernote since the beginning. I found the UI to be something that fit my needs better than other note taking apps. It has not always been super, and the changes over the years, but today it is a great app that can be customized to fit your needs. As stated not always super, but has grown to be a standard, and easy to use.","rating":5,"reviewer":"Iced Coffee","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2968089157","title":"Evernote has Derailed","comment":"Evernote has undoubtedly lost its innovative sting. I have been a premium subscriber for many years and do to the lack of archiving has made the product very difficult to navigate or organize. If you were to browse the Evernote forum, archiving is the most asked feature, but they can't deliver. I wouldn't recommend anyone gets started on it, once you get a few hundred notes, you will begin to experience my frustrations.","rating":1,"reviewer":"Yvel","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2967726742","title":"Typing Bug, ADD A TAB BUTTON!!","comment":"Keyboard doesn’t allow bottom of screen to be visible when typing; AND MAN, ADD A TAB BUTTON FOR PETES SAKE!!!","rating":2,"reviewer":"DaManahjah","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2967238353","title":"Can we please learn how to code synchronous and asynchronous event handling properly?","comment":"Seriously....why must syncing offline notebooks on my iPad grind to a halt making new note typing impossible while failing to prioritize synchronizing of said new notes. \n\nEver heard of event and data throttling? \n\nLiterally, this app seems to be yet another “let’s make it pretty and to hell with functionality” orchestrated by UEX kids school of “Fisher Price” app design. Please fix this crap!","rating":1,"reviewer":"cxv01","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2966923590","title":"For some reason you can’t see text highlighting on Evernote","comment":"Text highlighted on desktop doesn’t highlight on mobile. Quite annoying.\nGreat app I just made this review to complain","rating":3,"reviewer":"TJCML","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2964283515","title":"Good app.","comment":"Great app. Great auto sync. I would like to see a few enhancements: 1) I would like to see the mobile app with the sort options by name as ascending / descending. 2) a choice of slightly smaller font.  3) view PDFs as files not Icon.","rating":5,"reviewer":"Grace+Truth","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2961590426","title":"Files/Folders do not show up since app update","comment":"Since this update downloaded on iPhone 6 Plus with iOS 11.4.1, cannot save an online page to notes because my file folders no longer show up. Therefore, cannot assign page download to my saved files.","rating":1,"reviewer":"cabby139","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2951063070","title":"Can’t delete accidental recording","comment":"I accidentally added a recording to a note and I don’t see any way to delete the recording without deleting the whole note","rating":1,"reviewer":"nicknamesarenotavailable","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2949574541","title":"No undo feature?  Really?","comment":"It is 2018 - for a note-taking app to not have an undo feature is ridiculous.","rating":1,"reviewer":"Elektrycerze","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2949539565","title":"Love!","comment":"I love this app so much. The only thing I really wish was different, is the fact you can’t organize the different notes/notebooks in the order you want. Like chapters for example. It would be so much easier. Atleast for me. Otherwise I love it.","rating":4,"reviewer":"Sexy starfish!","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2945203651","title":"A mess","comment":"As an Evernote pro user for the last 6 years I am disappointed by how confusing the app has become. Search doesn't work well. Simple bugs are all over the place (keyboard doesn't show up when you need to type) and it's plain slow. The Mac app gets nonstop updates which is tiresome. Not going to renew this overpriced app anymore.","rating":2,"reviewer":"PaceRipley","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2940559175","title":"Totally disorganized","comment":"Who is in charge there? iTunes or Evernote?","rating":1,"reviewer":"Mottpir","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2930560212","title":"No support for malfunctions","comment":"I have spent 45 minutes trying to figure out why audio from a file syncs on one device when I play a video but not on the device where I originally transferred the video file into Evernote. \nAnd since there is no support, I have tried to troubleshoot it myself only to find that by re-uploading the file each time I have only succeeded in exceeded my upload limit. (All for the same single file that still isn’t working.) I give up. If companies can’t offer support of their broken products then what good is it?","rating":1,"reviewer":"EvieRyland","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2929598953","title":"Best note app","comment":"I have been an Evernote user for years. It is by far the best app for taking and keeping notes. Happy that Siri will now put notes here. One request-- when a tag is added while using iPhone X it will not apply to the note or become a permanent tag. I have to go to my Mac to add tags. It would be nice to do it from my iPhone or any device. Thank you for your good work.","rating":5,"reviewer":"Live is nice!","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2928743686","title":"Latest update is a disaster","comment":"The app freezes and nothing can be accessed. I’ve restarted and reinstalled to no avail. Very frustrating","rating":1,"reviewer":"Kasia","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2914922250","title":"Latest update not working at all","comment":"It seems to have lockd me out of my files unless I agree to open a gmail account.","rating":1,"reviewer":"Grla_99","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2914522958","title":"Great organizer","comment":"It’s how I keep my life organized. I don’t know what I would do without it!","rating":5,"reviewer":"HWP14240","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2914397793","title":"Doesn’t work on new iPad","comment":"A Dummy blank white screen pops up every second with no way to stop or close it. Can’t even access my account to send a log to the developer. \n\nFind another note taking app","rating":1,"reviewer":"r.vazquez","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2913101822","title":"Solid app","comment":"7/15/2018: I like the app but one thing I have been waiting for for a little while now is the autocapitalization after a line break. Seems to be broken. I’ll give another star to see it fixed. Here’s hoping🤞🏼","rating":4,"reviewer":"Cornelius111","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2911929059","title":"Price","comment":"I just started using Evernote so I can’t talk too much about how it works other than I’ve been using Scannable and then automatically loading the scans to Evernote. So far so good. Both could be a little more user friendly but I finally figured it out so I’m good now. I think your website and app comments need to be updated, though. On your app details below, it shows Premium as $42.99, $44.99, $7.99 but on your website it is $69.99 (or $7.99/mo option). I was charged $69.99 (plus tax) yesterday and then saw the app with $42.99, and had an email from Evernote telling me to save 40% til 7/19 (but no discount code listed and not sure how to get it). Since I purchased it yesterday for $69.99 I was trying to contact customer service to see why the discrepancy between app & website but, as others have mentioned, I didn’t have much luck with Customer Service. There is nowhere (that I can find) to leave a general question and when I select billing, it tells me to contact iTunes re: billing issues since I paid through them. I’m not having billing issues-I just want to know about the prices (which is an Evernote question-not iTunes). Also on the website, FAQ clearly states multiple times that Plus is no longer an option (only Basic, Premium, & Business) yet on your page with different products it still lists Plus as an option. As big a name as Evernote is, it’s surprising that there are several inconsistencies and you can’t get through to anyone easier. I will update review re:actual product once I’ve used it longer.","rating":3,"reviewer":"clady75","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2901249667","title":"It is working again","comment":"I have gotten used to the newer versions and everything now works. \n\nThis is my workhorse note taking application. I have been using it since 2009 after using many other applications through the years. All the notes in those others are basically abandoned because there was no good means of porting them. I now have over 6000 notes it Evernote, so I have a lot invested in this format. Thus I am unlikely to change to anything else.","rating":5,"reviewer":"bread2u","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2900899627","title":"Great most of the time, not great when I lose work related notes.","comment":"I like this app a lot, but I’ve been having an issue with losing my notes. My coworker said it’s possibly bc I don’t always click ‘done’ when I’m typing a note. There really needs to be an auto save feature to stop this from happening.","rating":3,"reviewer":"Cssndrclk","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2894909803","title":"I love Evernote","comment":"I am a long time user and I have 1000’s of notes. My notes include everything from appliance manuals to scholarly articles two catalogs of my favorite tweets.  The new app scannable by the same developer makes adding things to EVERNOTE and editable PDF format completely simple. I just wish it’s encryption was HIPPA compliant so I could easily store to medical records from my private mental health practice on it.","rating":5,"reviewer":"LisaMcLewis","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2894357869","title":"All reminders now required to have a due date?!","comment":"I used to be able to set a reminder without setting a due date. This functionality appears to have been removed in this update. Not sure if this is a feature or a bug, but I don't understand why they would remove this ability and force us to set a due date.","rating":2,"reviewer":"PulseTsar","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2893866370","title":"Do not use this app!","comment":"Most basic features are missing, especially undo. Even worse, Evernote misuses the data stored to their cloud for their own purposes. Delete immediately!","rating":1,"reviewer":"unsatisfied customer 83629","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2891711975","title":"Continually worse and worse","comment":"App is continually worse. If Ou haven’t started using it don’t. Terrible support, always crashing.\n\nUse Microsoft one note instead","rating":1,"reviewer":"Ryan from RI","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2869385903","title":"Not really user friendly","comment":"Downloaded this again and started playing with it.  I like a lot of the features, but you can’t really use all of it on the iPad.  I can’t delete notes nor combine them.  It looks real easy on the computer, but I can’t even login as it will only let me use the app.\n\nThis has great potential, but remember, on the iPad, I can’t click my mouse.\n\nPlease fix this and I will gladly give the 5 stars that it deserves.","rating":3,"reviewer":"Dr.Trim","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2868291437","title":"Terrible","comment":"App made me need to upgrade to see my desktop files. Terrible product. Ran in circles trying to view my files stored.","rating":1,"reviewer":"Gentry2","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2843771391","title":"Not reliable","comment":"Not reliable - i got this specifically so I could have notes on IPhone also available on Iwatch.  At first it worked great, but now it doesn’t synch or even give me anything at all on Iwatch.  Looking for a more reliable program.","rating":1,"reviewer":"Blessed1965","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2843460877","title":"Almost perfect","comment":"I’ve been using for several years. Didn’t really like upgrade but I got used to it. I mainly use and love for chronicling my bread baking experience. Wish you could resize photos in Evernote. Tried resizing in photo app but makes no difference.","rating":4,"reviewer":"Steviesmom","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2843212572","title":"Back up and running","comment":"Evernote took an awful turn for the worse, some months back. But the Evernote team seems to have turned things around. I use Evernote extensively for my small business, and I’m very happy the last three month or so.  It is great again. Thanks!\n\nTrouble ounce again!!  I’m a premium Business member, and the Mac app is now incredibly unreliable. I just started having trouble on my iPhone 8plus. This is getting scary :-(","rating":2,"reviewer":"AppFan365201392","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2837969166","title":"Missing Grid lines","comment":"Everything’s great and the set up works well for me.\nI just really need grid lines to organize too","rating":5,"reviewer":"Hydinga","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2834664686","title":"Couldnt sign in","comment":"I couldn’t even get past the sign in. Already deleted app and looking for something functional. Such a sham use to love the app.","rating":1,"reviewer":"3 peas in a pod","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2828749205","title":"Auto Scrolling Glitch","comment":"The page scrolls automatically down as I'm typing the note. I have to stop midway and scroll back up just to confirm if it typed it correctly or autocorrect didn’t insert something different. It’s extremely frustrating and near the point of leaving Evernote. Please fix this Evernote!!","rating":1,"reviewer":"anne2287","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2823608171","title":"Recommend by pro preacher.org","comment":"Poor","rating":1,"reviewer":"tommy lickr","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2823468276","title":"App not working first time.","comment":"I always have to close and reopen the app before the “paste” button can work.  Annoying.","rating":4,"reviewer":"AgaFx","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2820745452","title":"Slow and crashes","comment":"Unfortunately Evernote has become slow to use and at times unresponsive with frequent crashes. For a note app that holds the volume of information I have in Evernote this is unworkable as I essentially don’t have mobile access to my information.","rating":1,"reviewer":"Bob1374","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2817125724","title":"Better but needs a few lessons from Google Docs","comment":"I was a Premium user from way back, then abandoned Evernote a few years ago when it just became bloated and ridiculous. \n\nEarly in 2018 I was convinced to try again and immediately upgraded to Premium. It’s much better than it was but still has some very annoying features: iOS versions are slow and buggy (though design is pretty good); something very wrong with how lists are indented (takes like 4 taps) and spellchecked (spellcheck thinks bulleted or numbered lists are combined with previous line); shortcuts are in different orders from desktop to iOS; saving a post from Twitter tries to import the whole thread but then excludes the original post. Nitpicking but serious flaws to my workflow and could be easily fixed if they simply mirrored Google Docs apps. Overall good app though.","rating":3,"reviewer":"Geezmanf","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2802546619","title":"What is going on????","comment":"I’ve been a loyal premium subscriber for 3 maybe 4 years.   My whole note system is tied up into Evernote.  But in the past year, Note files have gone missing with no explanation. Most critically - my note containing all of my passwords!!!!!!  Now, I  am having all kinds of problems even editing notes.   The cursor regularly freezes in place, forcing me to exit out of Evernote and restart the app.  \n\nWhat is going on???? You’re losing me EVERNOTE!!!!","rating":2,"reviewer":"Suoser","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2801291488","title":"Please consider","comment":"In the all notes section the date comes before the title which is annoying when scrolling for something specific. Also there is no way to tell from this screen which notes are in what notebook. Please include on the note snapshot. Also the sorter button for placing notes is at the top of the new note not at the bottom. If it was at the bottom I could place it when I was finished with the note and I wouldn’t have to scroll at the way to the beginning. Doing this causes the note to reopen, for example a list, at the top of the list by the title, instead of picking up at the bottom where I most likely left off. \n\nDoes the job but not intuitively user friendly.","rating":3,"reviewer":"Kahpriis","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2800902950","title":"I LOVE Evernote!","comment":"I am a retired minister and Evernote has allowed me to reduce my files of paper tremendously. It has literally been a lifesaver as I am now recycling paper and I’m able to save my old paper docs so easily and then find what I want with Evernote’s great search feature.","rating":5,"reviewer":"noodlenose8","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2798128732","title":"Many features that are pretty basic not available in iOS","comment":"Hyperlinking as an example. Can do it on laptop but not on iPhone. Am I missing something?\n\nCan only do reminders but no due date and sort by due date. Seriously? Am I missing something again? \n\nThere are other examples but I’ll leave those two for now. \n\nI’m a premium user but not for long.","rating":1,"reviewer":"dan0763866","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2792066782","title":"Nah, Fam","comment":"Was on this app all of about two minutes until I realized that they want to charge $8 a month for me to access notes that I write. That’s gonna be a no from me. My Netflix account is $11 a month to access more third party content than I can possibly watch. This app however wants $8 for me to access my own ideas, on a device that I already own. If this app was particularly unique it would be a different story, but alas there are free apps that do the functions that this app charges monthly for. \n\nI got a little sick to my stomach thinking about the hundreds of dollars they would expect a college student to spend over the course of 4 years to be able to access their own notes offline. Deleted the app immediately. \n\nDefinitely an interesting app idea, however. Would have gladly paid much more than $8 as a one time fee for full access.","rating":1,"reviewer":"whyareyoureadingreviewsloser?","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2791067292","title":"Exelente","comment":"Excelente aplicación para guardar Memo para escanear documento siempre a la mano muy rápido","rating":5,"reviewer":"massimosavarino","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2788675794","title":"Love this App","comment":"Finally found an electronic note taker that works!  I am a paper and fountain pen guy but sometimes there is no paper around even tho I always have an FP handy. This is a great app for just those occasions.","rating":5,"reviewer":"Panzer Grenadier","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2785508160","title":"My fav cross platform note app","comment":"Used for years with both iOS and desktop.  Love it","rating":4,"reviewer":"dci","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2785056110","title":"Can’t get help","comment":"I retired and cut back from full Evernote to Basic (on two units). \nBut I can only get on one and no help to correct. \nI was a customer for many years but it makes no difference. \nThese people are punishing me for dropping full plan.","rating":2,"reviewer":"QuincyMike","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2782838463","title":"Locked Out Of Evernote Due To Mo ID#","comment":"For over two months since I traded by defective phone in I have been unable to retrieve my passwords from my Evernote file where I have stored passwords for over five years. \nI get no help from Evernote note support despite repeated requests.\nYet Even note continua s to charge my Wells Fargo account $7.99 a month without the assistant I need to retrieve my voluminous notes because I have nether an ID or Password available.\nHELP!","rating":2,"reviewer":"Elacho","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2769966974","title":"Sadly Controlling, Restrictive, Disfunctional","comment":"Be very cautious getting pulled into this platform. Once in, many restrictions and limitations, no ease of sharing notes, no simple emailing of notes, functionality buried and hidden, forced to use the Evernote transmittal system which is rudimentary and provides no visibility, flexibility. I am now stick with Evernote and regret it very much. Migrating all content out to another platform at this point a monumental task.\n\nMuch of the functionality is awkward and clumsy; notes editing, organization, resultant format when added from external sources, etc. It is as if the designers don't actually use their own platform or have created with the interest of Evernote at heart, not the independent user. This is a system much more geared to capture and contain users than to facilitate, unleash and unencumber. Truly disappointing as the potential, the architecture is there.","rating":1,"reviewer":"444tiger","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2767643551","title":"Frequent crashes","comment":"When I try to open notes with long texts or heavy pictures, Evernote frequently crashes.","rating":3,"reviewer":"たーぼ80","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2755208453","title":"No “UNDO” on iOS App","comment":"If I could give it zero stars I would. Let me see that I’ve used and have been using this app for several years. And as great as it is… There is still no “undo” availability in the iOS app. DISGRACEFUL. Really. One false move and an entire document deleted in an instant. Never to be seen again. Nothing rubs me the wrong way more than wasted time and productivity.","rating":1,"reviewer":"JoeyBleach","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2753152696","title":"The Search DOES NOT WORK","comment":"I couldnt find any support page to contact so please be kind and forward it to support/devlopers!!\nThe main value proposion of evernote is a simple and fast search of your notes however the search features does NOT works at all and not just for me for my brother and my friends ITS JUST NOT WORKING and not just now it has been like that for many months now!! We are forced to manually search for notes which defeats the purpose of using Evernote!!\n\nWe have been all using the latest version of IOS and the latest version of Evernote","rating":1,"reviewer":"J911@Jay","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2745152650","title":"caveat | 👀","comment":"i got locked out of my evernote account . the reset password option did not work . i emailed tech support twenty plus times . it would take tech support a week to respond to an email . the tech support advice was not helpful . after 5 months . the reset password option worked . i plan to delete my data and close my account -","rating":1,"reviewer":"🐼🤖","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2741934894","title":"NOT SAFE DO NOT USE","comment":"Your content is liable to disappear and there is no way to back up your notes or download them.","rating":1,"reviewer":"Tinkerbitch","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2728616256","title":"King","comment":"Awesome","rating":5,"reviewer":"Kingpingod107","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2728162259","title":"Basic search doesn’t work on iphone app","comment":"I find it impossible to find any notes on the app through very basic searches. For example, typing in “beef” in search will result in 0 notes when I should have many recipes with the word “beef” in the title and the note itself! I end up scrolling through my recipe folder instead. What a waste of time. The desktop app version works fine.","rating":1,"reviewer":"helpmesearch","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2721470159","title":"Trash","comment":"Can’t even sign in smh. Resets password still can’t get it. Signs in with google still can’t get in. Type of crap is this 👎🏾","rating":1,"reviewer":"Chill faxtor","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2721340928","title":"5300 Notes Disappeared","comment":"5300 Notes disappeared from my iPhone. I contacted support and they told me they’ll get back to me in about a week. Any suggestions?\nI just uninstalled the app and reinstalled the app and my info is come back.","rating":4,"reviewer":"Yaakov Jacobs","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2720124388","title":"Must-now","comment":"Can now add tags directly from a note. No need for “i” to place a note away. Information’s fine but I want to focus on my own. Thank you, very much! Thank you, team. Enjoyafilm.","rating":5,"reviewer":"Joecwild","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2718609612","title":"Was great","comment":"I’ve used Evernote for years, but now that they’ve moved to a model where you have to pay for “premium” services that used to be standard, there’s not point in staying with Evernote. Perfect opportunity to try OneNote, and saw how what incredible functionality I missed out on, without the “premium” tag. Wished I dropped Evernote sooner.","rating":1,"reviewer":"Drail03","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2712935102","title":"Love Evernote - but sure been buggy lately","comment":"I'm a longtime Evernote user on the business plan.  I have hundreds of notes and dozens of notebooks.  It is important for my personal and business life.  But the past 6 months has had so many bugs that don't get fixed for long stretches of time.  And customer service is becoming really poor and disregards customer questions - this can spell the end for you, Evernote, if this continues.  With this latest app update, it completely broke and I had to delete and download again.  Evernote, fix your glitches and be more responsive to customers.  We want you to work so that we can keep enjoying you.","rating":4,"reviewer":"JustBrowsing123","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2711545538","title":"Crazy change and hurdles to feedback","comment":"If your a non subscriber you will be neglected and basic stuff will disappear over time. Use to be able to print notes with reasonable nav now, it’s like four weird nestings to sunday before you can print. Their documentation has the old simple instructions that no longer match app and the only way to give em feedback short of another set of hurdles is like this review. at his point apple notes is a better option for the not so complicated note taker","rating":3,"reviewer":"beenThere 03","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2711336776","title":"Excellent Journaling Tool","comment":"Evernote appeared in a short description as a dynamic tool with the plus of a well designed Logo capturing the essence of the true meaning of note taking in a single animal. \n\nThe moment I started using it felt like natural with minimal need for additional command, but just the right amount to enrich every note and make it te-readable and transferable\n\nThis is a quality I can’t highlight enough most is especially for someone with a short span of attention that needs writing to focus and add creativity in the process. \n\nIf this is you, take full advantage of what Evernote has to offer and literally copy,  and paste your imagination.","rating":5,"reviewer":"Minoicos","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2710391004","title":"Latest update screwed up app","comment":"Talking about version 8.13.36something\n\nI am trying to edit notebook titles, move notebooks to different stacks etc, and it keeps reverting to the previous title and / or  location. I have to do it four or five times to make it “stick.” I’ve tried clearing the cache, no help. \n\nIn the long run, this is one of those apps that makes changes that are never the ones I hope for, anyhow. I often find myself frustrated trying to find something or organize notes. I’m forever thinking a notebook is a note, trying to put it in a notebook when I have to put it in a stack, forgetting where the stack option is, etc. I don’t get why it can’t just be drag & drop or folders within folders like every other organizational system in the universe. Definitely for rote, not intuitive or visual, learners. Also it makes me nuts that recent notes appear on top of the shortcuts list - I want to go to shortcuts and see the same notes in the same exact order every time, so I know where something is quickly. That’s why they’re shortcuts - to get to them in a hurry!! I get frustrated with the top notes being recent (therefore changing all the time). So personally I hate this feature. It should be optional. I guess I’m just frustrated with this app generally, and how it “thinks,” but I haven’t found a good alternative, and have way too much info stored in Evernote to move easily. The apple notes app is zillions easier to use. It doesn’t have the cute green elephant, but who cares. Sometimes less is more.","rating":3,"reviewer":"lime_harp","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2707495528","title":"Please fix voiceover support","comment":"Voiceover is a feature of the iPhone and the iPad. Under settings, general, accessibility, there is a option called voiceover. Please add complete voiceover support including router support all throughout the application.","rating":2,"reviewer":"Jtblas","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2702468693","title":"Search no longer works.","comment":"No matter what I type in the search bar, no results.","rating":1,"reviewer":"cj76544","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2698999755","title":"RTL (right to left) languages support is poor","comment":"When using RTL languages editor is not aligned properly and whole RTL support is poor and not maintained through the app.","rating":2,"reviewer":"Royazr","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2696427281","title":"What happened to clipping?!","comment":"I'm a religious user of the evernote clipper. It used to clip articles with really high quality and no formatting issues, in big font that was readable on mobile, but that has not been the case for sometime. Also, when I go through to manually adjust the font size, the large is still not big enough to be read on mobile. Is there a way to fix this? Or to change the default clipping size? Is there a way to make text XXL size?","rating":2,"reviewer":"Gbristow12","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2689851985","title":"It’s good, but limited compared to Android and Windows","comment":"I was hoping that the greater screen space meant that the iPad version would be easier to use and look at than the Android phone version, but that’s not the case, particularly when considering it lacks tag stacks/hierarchies support, plus it takes more taps and seems less intuitive than the Android version.\n\nAlso, didn’t the iOS use to have night mode? Why was it removed?","rating":3,"reviewer":"Don-dz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2688539691","title":"improved—and broken—reminders","comment":"in general:\n\nfirst off, evernote has been indispensable for the many years i’ve used it. it’s the only offering that supports/enables my own version of GTD for managing projects, tasks, reminders, reference notes, read-me’s, etc. for that, i give it 4 1/2 stars. \n\nthat said, evernote needs to better recognize how changes to existing functionality can negatively impact people’s lives. \n\nspecific to this latest update 8.13:\n\ni appreciate the experimentation with and added functionality to Reminder > Change Date.\n\nevernote did well to add time-saving options while preserving the existing option ability to pick a specific date and time. \n\nBUT WITH 8.13...\n\nHOW DO I EVEN SEE WHAT THE EXISTING TIME & DAY SETTING FOR MY REMINDER IS?\n\nwhen i select the option to “pick a date & time”, the day & time is no longer pre-set to my existing setting. instead, it is pre-set/reset to day=today and time=current time-ish. \n\nTHIS SMALL CHANGE IN BEHAVIOR BREAKS MY DAILY PROCESS. it adding time, effort, and complexity to my day. and as noted, now i can’t even tell what my reminder is currently set for. (!?)\n\nif you want to change behavior in an update, recognize that in cases like this you’re also removing expected behavior which can significantly and negatively impact your users’ day-to-day. i can see how this change might be a desired change to some, but please please please consider how this might be a major disruption for many existing users. and please make accommodations for them, like allowing users to decide in an application setting whether or not they want it pre-set to the existing reminder time & day (as it had always been before) or to a suggested time & day (which i’m guessing you thought some users might prefer). this would do much to accommodate loyal long-time subscribers, like myself.","rating":2,"reviewer":"i.togusa","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2683585913","title":"Evernote is drunk!","comment":"When dictating by voice using Gboard, the transcription is translating my words into gobbledygook. Not cool!","rating":2,"reviewer":"corefusion","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2683539659","title":"Overall still the Best Note App","comment":"As someone who has been using Evernote for years, despite many hiccups, I still love this app overall. There are still a few annoying glitches for the iPad functionality though. For instance, when you’re typing in a note, and switch to another app and back to Evernote, the cursor often gets locked at the bottom of the note, and you have to click into another note and back into the one you were working on to get the cursor working correctly—Super annoying. \nThe only other thing is that as you type a note, while you have ‘Show Body Text’ selected in ‘Note List Options,’ as you type in a note, the tile in the Notes List continues resizing as it syncs, even if the text you’re editing is far past what’s previewed in said tile. This can be solved by putting the note into full screen or turning off ‘Show Body Text’ but I prefer the settings that cause this glitch.","rating":4,"reviewer":"heathrulez","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2683002792","title":"Needs a dark theme","comment":"I love this app but it needs a night mode/ dark theme. I write my thoughts and plans at night until I fall asleep and I cant do it with this app because its too bright. Pls do something about this.","rating":3,"reviewer":"byerae","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2682832348","title":"Disappearing notes and no support","comment":"I was an Evernote user for about 4 years and found it to be well designed, reliable, and useful for my daily note taking needs at work. Earlier this year, the app became buggier. I’m not sure if this instability coincided with a new version or what happened exactly, but my notes started to disappear into the void. I would take notes in a meeting and once I was back at my desk moments later, discover that everything I had just written was gone. It didn’t happen EVERY time, but it was frequent enough that I contacted support to see if there was anything that could be done about the issue. Support advised me that as a basic user, I did not qualify for support. After complaining to Evernote over Twitter, they told me they would open a helpdesk ticket, although this went no where. After an experience like this, any hope Evernote had of turning me into a subscriber is gone, and I’ve since deleted the app.","rating":2,"reviewer":"illustrator31200000","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2679678496","title":"Two Requests","comment":"#1: I have two Evernote Premium Accounts. I would really like to see a “switch account” option like i have on the Mac App. #2: The ability to have formatting stripped away when pasting into the app (Right now I have to paste into another text editor to remove formatting, then copy it again and past it into Evernote). *If these two things can be accomplished it would be a true 5 STAR App in my book.","rating":4,"reviewer":"HondaRepsolMan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2678396438","title":"Good but...","comment":"Live the improvements but wish the bullet feature was up to speed. Every indent starts with numbering. Should shift numbers - letters - Roman numerals some thing else anyway.","rating":5,"reviewer":"cpm50","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2678244021","title":"Great App - use it for everything!","comment":"I tie it in with Scannable and set up file notes.  Keep it up!!","rating":5,"reviewer":"EB-6","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2677835593","title":"Major design flaw for note taking on your iPad","comment":"It’s not possible to practically indent bulleted notes.  This feature was surprisingly removed several years ago and never added back.  This makes the tool virtually useless for taking notes on your iPad.  After over 5 years as a paid Evernote customer I am actively searching for a replacement.","rating":1,"reviewer":"Blvue","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2674010574","title":"Lost all my info","comment":"Tried to log in and all my info — from years past — is now gone.","rating":1,"reviewer":"Noudlehead","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2672367665","title":"Useful until i tried sharing my lists","comment":"Evernote had a great concept but has a poor price position. i started using it to make a basic list then tried to share it and let others modify it. I was disappointed to find out only premium members can allow shared lists to be modified.","rating":4,"reviewer":"Fseminario","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2670364163","title":"screwed me over!","comment":"i just got this app and was starting to really like it. but now it’s 3 am and i’ve been working on a problem set for hours and it just deleted all my work and it can’t be restored so i don’t recommend this if you want something reliable that won’t screw you over","rating":1,"reviewer":"diehardyankeesfan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2667983463","title":"It keeps getting worse","comment":"I accepted Evernote getting slower. I accepted the flickering lines from time to time. I can't accept it outright freezing. Come on, guys! This app used to be the best out there. Now? I'm looking for a replacement and being brutally honest it won't be hard to find something working better than this. \n\nThe lack of improvement has shown quite clearly what you currently think about your users.","rating":2,"reviewer":"HaterGator","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2663455267","title":"No Hyperlinking","comment":"It's amazing to me that after all this time, Evernote still won't let you hyperlink in the mobile app.","rating":1,"reviewer":"ChloraPhyll","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2660393609","title":"Don’t like the new design","comment":"It’s probably a minor issue but the color change on the toolbar to dark green only make the app smaller, and doesn’t give the ‘clean and uncluttered’ vibe. Please bring back the white toolbar like the previous versions. It’s a lot better.","rating":4,"reviewer":"hazell1900","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2660092706","title":"Unusable since the last update","comment":"I've been a satisfied user for a long time. But ever since I recently updated Evernote, it crashes upon launching. I can't access any of the content I've stored there for years--very frustrating! Please address this in a new update.","rating":1,"reviewer":"DecaturHeel","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2659868804","title":"Going down forces you to buy the premium","comment":"The app require the premium version like never before \nIn Every day update they request money on the some feature including the old basic features \nI hate you,,bad company .. forces you to buy the premium","rating":1,"reviewer":"Shuusha","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2657578780","title":"Kanban cars view","comment":"Please add a Kanban card view where I can prioritize notes effectively","rating":5,"reviewer":"pzeos","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2653181290","title":"A great app","comment":"It’s a good idea for a app but they could add this function in the app that you can split screen the app with the same app example what you can do is when you are viewing one note that you can edit the other note by dragging or copying or jest keeping things in your mind while you type it out","rating":4,"reviewer":"travenature1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2647208768","title":"Never-note: Hours spent scanning and important documents LOST","comment":"I pay for the monthly account to Evernote. I love the scanning documents function on the app. I used it for any number of documents — saved a pile hand written notes so I could ditch the paper copies and keep the PDFs. However, even though the App says “saving” and creates the note with all the pdf docs, and even though it shows the thumbnail, all the actual document scans were lost. If you wait for it to upload, you have a 50-50 chance of it saving. Doesn’t work — and a huge headache of spending time. Feature would be great if it actually were functional.","rating":1,"reviewer":"WilllllliW","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2641437441","title":"Top of the Food Chain","comment":"I’ve tried to find something better, I really have. I was certain that by now some developer would have created a digital brain that was even easier, cheaper, slicker...,  but nope. If there is such a product, it’s well-hidden in the sea of almost-as-good. \nNOTHING else has everything. I’m paying the premium fee every month because Evernote saves me time and stress... and it’s worth every penny to me. \nPrevious review early-2017:\nFive Stars! Quit Complaining...\nPeople write bad reviews here about being asked to pay for (previously free) features. \nIt's too bad those reviews hinder App Store rankings. Because even the complainers know that Evernote is a stellar app with a fantastic track record. Even the haters know that first-class apps have humans behind them who deserve to be paid for their development and maintenance of superb software. \nI have thousands of notes created over four years, and I use most features regularly without any hiccups. \nEvernote is absolutely worth a few bucks a month.","rating":5,"reviewer":"Turbo444","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2637882152","title":"App crashing","comment":"I live on Evernote, and have for years... but a couple updates ago the iPhone app just stops working when trying to access notes or navigate menus. Totally freezes or shuts down. iPad and Mac apps still working great, but it’s been useless for the last few months on my iPhone. Keep getting excited every time there’s an update to the app, only to be disappointed the bugs are still there.","rating":1,"reviewer":"papahendo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2628309399","title":"Location titling","comment":"At first note were self titled, then the location was available but I had to fetch it with the i. Now it’s unavailable all together","rating":1,"reviewer":"old jester","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2625078384","title":"search is broken","comment":"almost worthless if the search doesn't work.. tried so many queries, I know these things exist, nothing. cmon this is so critical.","rating":2,"reviewer":"spicereid","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2622065862","title":"NO. YOUR app is not good. Stop pushing and Read the reviews!","comment":"I got a link to open an Evernote. I use my account to try to open that note. The link in the message keeps redirecting me to download the Evernote app. STOP. FIX THE APP.  Before pushing us to download it. To just read a note. \nBut regardless, let me open the note on the phone browser!!","rating":2,"reviewer":"New York +30","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2611058412","title":"I like it, it’s not too shabby","comment":"I’ve always been cheap, so I’ve been using the free account for about 2 years now and I don't really have any major complaints\n\n. There are a lot of tools you can use without having a premium and the unlimited amount of notes you have really helps.\n\nOne thing I will have to say is: they don’t have an “undo” button so if you accidentally delete an entire paragraph then it’s gone forever, which is a really big pain.","rating":4,"reviewer":"Alice in winter land","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2610580249","title":"Suggestion","comment":"Evernote is very useful on the go. However, as a suggestion, for users who would like to add a second device on the basic account version, please designate an area on the launch page of the app for Existing Users with a basic account to log in using their current information. For example, if someone downloads and launches the app, they are presented with signing in via google or creating a new account.","rating":2,"reviewer":"wiggly_jiggly_giggles","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2610562359","title":"Boo","comment":"I can’t have EverNote on my work computer, my surface, and my phone, three devices I need to have it on, without paying. \n\nHooray that Google Drive is free.","rating":2,"reviewer":"Cocijo5000","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2607912261","title":"Not reachable","comment":"I have been trying to reach the customer support for more than two months with no success. There were phone numbers that only take voice messages and I have called every phone number I could find and left numerous voice messages. So far I have not heard back from any of them! This is really ridiculous, to a premium member!! Looks like to only option they left me is to withdraw the membership!","rating":1,"reviewer":"unhappy ma","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2598768246","title":"Print option gone and have to pay for support?","comment":"After last iOS update print icon is gone and there is now way to contact the company without paying for an upgrade? Free program works fine for my needs but without the icon not good. Please bring back the icon or make it easier to ask a question without financial penalty.","rating":1,"reviewer":"Ctmom16","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2595875247","title":"GLITCHY","comment":"If I had paid a one-time fee, I wouldn't mind the glitching of this app as much, but since I am paying every month, I expect it to work:\n\nSome notes make it impossible to select and modify text. This glitch essentially makes the app utterly useless.\n\nAnother glitch which is not catastrophic, is that the screen jitters when using voice dictation. Very distracting and annoying.","rating":1,"reviewer":"Viiv","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2593640454","title":"What happened to printing?","comment":"This is my go-to note app. I mostly use it on my phone, but I'm glad it's accessible on my computer too.\nI can’t find the option to print my notes anymore. The share button is gone!!! I need this feature. Where did it go?","rating":2,"reviewer":"Akm4109","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2591888574","title":"Don’t Update","comment":"I haven’t updated Evernote in ages because everything was working but recently it just wouldn’t sync so I was forced to update to this horrible version.\n\nPretty useless now, I can’t view a single note. Love the timeout errors, good job guys!","rating":1,"reviewer":"kcnobody","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2589974188","title":"Person to person contact","comment":"Is there any Evernote paid plan where customer gets person to person contact","rating":2,"reviewer":"lgshah","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2588380242","title":"Absolutely broken after last update","comment":"App does not even launch. Just a white screen.","rating":1,"reviewer":"BarbR7","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2586186231","title":"Organize and retrieve a snap","comment":"I keep notes on business or books or ideas and quotes that I want to track.  I can do so as organize as I want AND just search by a phrase or word if I didn’t. Much like the ease and power of Gmail, this is a great tool for me. \n\nAnd it does so much more for those who want to be deeply organized and share work.","rating":5,"reviewer":"paullips3","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2582428163","title":"Bad interface","comment":"Everything I speak is about the free version. The user interface is not altogether good. Like the iPhone, it's not a simple and regular iPhone app, especially on MacBook. Persian font is bad. It does not support Farsi right to left. There’s an option for you to choose left to right or right to left writing, but when notes listed, Persian or Arabic right to left writing doesn’t support","rating":3,"reviewer":"mosteFFjobs","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2581836477","title":"Nah~!","comment":"I think I'll give it two stars, sure it fast, but not paying just to view notes offline. I'm switching to one note. Seems more reliable if you ask me.","rating":2,"reviewer":"Macocircle","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2577327051","title":"Love Evernote, but...","comment":"I’ve used free Evernote for many years and have loved it. I use it for personal use only. But since the last update it’s making me crazy. It no longer keeps open my current note after I leave Evernote and go back in. I have to search for that particular note again and reopen. Huge pain.","rating":3,"reviewer":"GrammyHaus","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2576031616","title":"Best app for writers","comment":"I am a writer, and I write and edit pretty much every second of the day. Evernote makes it so easy to access my stories and my ideas within both my phone and my computer.\nI also have pictures of my characters that I can happily look at whenever I want to visualize what I’ve written better.\nEvernote is by far my favorite app. It’s so easy to use and is genuinely so beneficial to me.\nI would recommend this to everyone. Whether it me writing, drawing, work, or school. Evernote can help.","rating":5,"reviewer":"dabros200","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2575315651","title":"Last update just hangs","comment":"Plus can't edit. So in other words, unusable. I'm probably going to look for something else.","rating":1,"reviewer":"Jessesipad","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2569121822","title":"Meh, Falcon app is a better solution for mac","comment":"Just seems like they are really up-charging for basic features and I can’t get around that idea.\n\nI am a pretty technical person so maybe for a non-technical person this app is perfect.\n\nI tell my non-technical writer friends to use this app for android and windows, but for people who only use apple products I just can’t bring myself to give that advice.\n\nI have iCloud that I pay some incredibly low price for 20gb or something like that, which I store my Falcon app based notebooks to. Search and all that is doable too. Syncs between ipad/iphone and desktop via icloud.\n\nSo for about $10 (not including icloud which i use for everything apple based) i get same thing.","rating":1,"reviewer":"jo jo devil","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2565809021","title":"Becoming borderline unusable","comment":"It seems to be a common occurrence now to try and open Evernote to jot something down quickly only to be met with sluggish UI and frequent frustrating states of forever waiting because the UI will get randomly blocked waiting on a response from the server.\nI can’t even imagine what hell it would be like to run this app on an older generation phone.","rating":1,"reviewer":"GCSWT","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2565646325","title":"Convoluted to the point of being unusable","comment":"This app is overly complicated and has a lot of room for improvement:\n- pdf editing is not fast or intuitive, rendering it useless for meetings and lectures.\n- on handwriting, why does the ink slowly appear? That doesn’t mimic natural writing whatsoever and makes for an annoying user experience\n- why can’t you reorder your notebooks to your liking?? I shouldn't have to come up with some difficult-to-implement code system to achieve my preferred organization layout\n\nGood things:\n- scanner function is great\n\nOverall, I kind of regret my premium membership (and I bought it at a student discount!). Hopefully we see some improvements.\n\nI ended up going back to the simple, intuitive, and practical Notability app.","rating":2,"reviewer":"LynaPHTX","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2565075643","title":"Can't open the app","comment":"Can't open the app after last update?!","rating":1,"reviewer":"mohsen aa","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2564542139","title":"Gets better with each update","comment":"Students! Make sure to get Evernote premium for 50% off. It’s worth every penny. Thank you devs for always making the app better.","rating":5,"reviewer":"MichaelJayBills","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2563891815","title":"Still don’t know why people like this App!","comment":"Not fully supporting writing from right side to the left side as Apple notes does. Some languages must start writing them from right to left, which make it useless for millions of people such as Arabic and Japanese. \nAlso there’s no flexibility when you want to create or design Tables.","rating":1,"reviewer":"Sam330o","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2561471653","title":"Apple watch issues","comment":"The app on the phone is great but does not sync well with the apple watch. Sometimes notes takes up to an hour to show up on the watch other times they dont even show up","rating":3,"reviewer":"Ahmadtc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2554049619","title":"Not very reliable","comment":"Things that may happen with this app:\n\n-- take auto pictures into a note and have some of them show up on the camera roll and some of them *not show up*. \n\n-- impossible to retrieve information on a note that has specific formatting (this is a *known* issue!) \n\n-- problems with Gboard for iOS\n\n-- notes automatically duplicating themselves without any apparent reason\n\n-- (in previous versions this happened at least two times) record audio into a note only to see it disappear at the end of the recording\n\n-- customer \"service\" that is overall slow and not useful in the face of actual problems","rating":2,"reviewer":"License Plate Three","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2550709396","title":"Overpriced and getting worse.","comment":"They need to rethink their pricing. One note here I come after years of premium.","rating":1,"reviewer":"Mikeandnora","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2542519622","title":"Won’t open","comment":"iPhone 6 with current OS. Crashes after being open for 2 seconds.","rating":1,"reviewer":"A LEGIT FAN","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2542440965","title":"Can’t stay open 2 seconds without crashing","comment":"What’s going on lately? I need an update ASAP b/c I have a lot of time-sensitive work to do! Please Evernote team!!!!","rating":1,"reviewer":"Star island","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2537920437","title":"A major issue","comment":"It doesnt work so well on my phone .Every 10 seconds a blank page pops up on screen and disappears after a minute .name of the page is “devices” .Looks like its a bug or something.I also use this app on my other android device and it works awesome .","rating":4,"reviewer":"amin.knz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2532038144","title":"Keeps getting worse","comment":"I have been with Evernote since it’s launch.  I have over 10,000 notes.  I have built my own Evernote app using the Evernote API. For more than a year now Evernote’s development team has been wrestling with an issue that causes incredible performance problems for many users. For instance, it takes 1-2 minutes just to open a note when I am connected to Wi-Fi. \n\nI am in constant contact with Evernote’s development team and they have many users experiencing these problems, but they say they just can’t recreate the problems in House (why not pay one of their users to come in then?).\n\nJust in the past week alone things have gone from awful to worse with their synchronization.   Sync isn’t working inside Evernote and it’s just stopped working with the API. \n\nI am continually told over the past year that the problems go very deep and they just can’t figure it out.  \n\nYou will notice that most users don’t report having this problem. But most users aren’t using Evernote on such a large scale.  Those that are have experienced these problems.","rating":1,"reviewer":"jdouglasj","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2529332667","title":"Big problems happening","comment":"When I save stuff to Evernote it messes up. Some post do right and some post go very small that you can’t read the words. On some other saved post when they get opened it’s nothing but a white background and some other ones all of the words over lap and keeps going over each other. This happens on every iOS app update.","rating":1,"reviewer":"200 in1 app","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2529059452","title":"Constantly crashes","comment":"Constant crashing, slow to run. Updates don’t fix it. Lousy app, not much better on desktop. Don’t waste time or money on this.","rating":1,"reviewer":"JJJJF4","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2525833679","title":"PDF encrypted files !!?","comment":"I don’t seem to be able to read what appeared to be an encrypted pdf file on my iPhone 8plus where as I can read that same note on my desk top Evernote web. I hope this problem can be solved soon.","rating":3,"reviewer":"Madragongirl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2520800124","title":"So incredibly SLOW on iPhone X! + privacy concerns","comment":"I am a long-time Premium user, and rely heavily on Evernote. currently, I am using it on an iPhone X with 256GB memory. I use the option to keep my notebooks downloaded to my iPhone. Nonetheless, Evernote has become SO INCREDIBLY SLOW THAT IT INTERFERES WITH MY WORKFLOW. Slow to find notes, and in the meantime it displays a misleading message “No results found for “_____” – as if the search had been completed, with no results found. If you wait long enough, the results appear. Adding a tag is so slow that you repeatedly add it, without it appearing with the other tags. You have to just sit back and have a few sips of tea, and hope that it will appear eventually.\n\nI am finding that I am using Bear instead of Evernote more and more, just because it is so much faster. But I haven’t fully adjusted to Bear’s different way of doing things.\n\nAlso, I am deeply concerned about the privacy policy. I won't feel comfortable using Evernote unless the company announces a privacy policy that STRONGLY protects their customers.","rating":2,"reviewer":"Noguilt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2516994382","title":"I don't get the draw","comment":"Seriously, all it did was tell me how wonderful it was while reminding me to upgrade to a paid account every 5 seconds. It claims you can have 2 devices with a free account but I could not sync my iPhone and my Mac mini. The desktop app was clunky and about every other attempt to do something with the app redirected me to a browser page (which REFUSED to remember I just signed in seconds ago, DON'T MAKE ME SIGN IN AGAIN!!!)\n\nIt does nothing I desperately need, nor does it do anything I can't already do easily with other less clunky apps. Which are free. If you've gulped down the koolaid and love this app, good for you. I just don't get it.","rating":1,"reviewer":"roosterbear","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2513903266","title":"Meets my needs","comment":"I have used Evernote for years.  I am not a fan of the new look in the recent upgrade.  Other than that, Evernote has, and continues, to do what I need.  Aside from a very rare syncing glitch- which can be fixed by connecting and syncing- my notes are always available across platforms and devices.","rating":4,"reviewer":"TejiA2","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2502027515","title":"Garbage","comment":"Don’t use it for anything essential that matters to you because you might not be able to get to it when you need it.\n\nI’ve a long-time subscriber, and this is totally unacceptable for use as a primary note-taking application anymore.\n\nUse Apple Notes or Bear instead.","rating":1,"reviewer":"8 << 1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2497775528","title":"bug report：mulitple level bulletpoint malfunctions","comment":"Big fan of your product. Here is one thing that to be fixed for the mobile version: second level bullet point indentation doesn’t always appear. When it does, backspacing operations will jump the line to a new line. Very annoying bug please fix it!","rating":4,"reviewer":"肉排","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2497589290","title":"Updated my Evernote App list all my files","comment":"Today I updated my Evernote app and went to file something and all my files were gone.  List incredibly important info and won’t use this app again.","rating":1,"reviewer":"suzcost","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2493523743","title":"Baad","comment":"Terrible app and desktop/browser exprience. just gets slower and slower, crashes on iOS and can’t handle large text files - TEXT FILES! it’s a note software!!!!??","rating":1,"reviewer":"Nikkidangelo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2488122224","title":"Many Glitches","comment":"I’ve used the app on my Kindle Fire and IPhone, however, the app gave me many delays, and was not able to perform its functions at full capacity. This app has the potential to be great, if it fixes the many minor errors.","rating":3,"reviewer":"SmartButt94","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2481727740","title":"Great for research and archiving","comment":"Evernote is a great tool for business. My only 2 requests would be easier access to tags and an easier process for providing feedback through the app.","rating":5,"reviewer":"DaveD0117","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2480392174","title":"The Best App but please add a Calendar","comment":"I love Evernote! But please add a Calendar already! Having to go to another app or device to use a Calendar while in a meeting is getting too redundant! Come on Evernote! We believe in you! Calendar already! Please! 🙏🏻 Your killing us!","rating":1,"reviewer":"MI6_007","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2477610595","title":"Still good, but UI needs a bit of work","comment":"I’m hoping that Evernote is working on making their app better. I am considering coming back and upgrading.","rating":4,"reviewer":"Anna R","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2477347671","title":"Horrible","comment":"Weak apple pencil support. No latex equations support. Few formatting options. Hard to get your data out of it when you need it...","rating":1,"reviewer":"LEO BSB","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2475393283","title":"Annoying","comment":"Can’t open my important files.. it keeps showing blank page titled devices.. all my files r lost now","rating":1,"reviewer":"Ahmedsaadwari","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2473558345","title":"Okay but Bear is better","comment":"In general this is a good app, however it is not easy to use and just in general hard.","rating":3,"reviewer":"Octet to cat","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2469257534","title":"When recording...","comment":"I use Evernote to write/record song ideas. I’d love to see the screen stay awake during recording so I don’t have to re-unlock my phone when finished. Other than that, the app is wonderful!","rating":4,"reviewer":"zseelye","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2462448147","title":"Still a Great App but some of the changes are frustrating","comment":"Easy and extremely useful however once upon a time if I made a list with the \"check box\" once I was done checking off said items there was an option to delete all the Line items which had been checked off.  This feature has been removed for quite some time, I'm not sure why.  This simple option was quite helpful & time efficient.  Now I have to go Line item by line item to remove those which were checked.  It is quite annoying especially when there is an extra long \"to do\" or grocery list.  PLEASE please bring this back.  I honestly don't know why it was ever removed.","rating":4,"reviewer":"LilHonu1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2458535231","title":"Offline notebook has worst experience","comment":"On IOS the offline note book seems never finishing downloading. Sometimes even a 10 note notebook is stuck there. I have to go inside and view all notes to “manually download” them. Are we supposed to do that for a 5000 note notebook? And the download is so slow...","rating":1,"reviewer":"FranklinZhan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2454722883","title":"جدة","comment":"رائع جداً","rating":5,"reviewer":"SalmanAliOtaibi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2454706656","title":"Happy","comment":"16k notes. 10 year user. Personal and business. 99% paperless. Evernote is essential to my daily life.","rating":5,"reviewer":"iTriedThisApp","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2454622274","title":"Where is the new TAB we are suppose to be testing?","comment":"Where is a new TAB we are suppose to be testing?","rating":1,"reviewer":"Dancamp","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2454345229","title":"Excellent","comment":"Ive been using Evernote 5 years and it’s one of the greatest apps I've ever used","rating":5,"reviewer":"flymusiq","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2449867922","title":"Many crashes - lost data","comment":"I use Evernote for my main todo list among other things.\n\nAs such, I need to cut paste and move bullet point line items around from As to Bs etc.\n\nWith this latest revision I have had many crashes just trying to do simple cut paste moves. In some cases after the crash the clipboard was still in memory. In other cases it was lost. This is horrible. Just get to the basics","rating":2,"reviewer":"ggssaamm","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2444034749","title":"Please keep trying","comment":"There is nothing better than Evernote to store all your documents..and find them again BUT there is much room for improvement, stabilisation and general quality. In the meantime, thanks for keeping at it and for your excellent, detailed, release notes.","rating":5,"reviewer":"FlyingGS","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2443399541","title":"Used to be great.  Now, its just another (expensive) note app","comment":"If you’re an experienced Evernote user, DO NOT UPGRADE!!!  If you’re on a free version, there is no longer any reason to pay for premium features as they’re taking them away.\n\nI’ve been an Evernote user, proponent, supporter for 6+ years.  It’s on my phone, my ipads, my macs, my macbooks.  It used to be a 1-stop, all-in-one platform.  Now, its just another note taking program.  This used to be the best note taking / productivity app of all time.  Now its just, meh, whatever.\n\nEvernote, you’ve really shot yourself in the foot.\n\nPlease bring presentation mode back.  I have a premium account, just for that reason.  Now, I could probably get by with the free version.  Time to downgrade my account.  Thanks.","rating":1,"reviewer":"Lifeaintfair","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2442573640","title":"Formatting issues","comment":"About 30% of all items or articles I try saving to Evernote are saved as a 10-character wide column, rendering the article impossible to read or recover.  THERE IS NO CUSTOMER SUPPORT - NOT CHAT, EMAIL OR PHONE - AND IT’S IMPOSSIBLE TO REACH ANYONE IN CORP. HQ TO DESCRIBE OR DISCUSS THE PROBLEMS.","rating":1,"reviewer":"BohdarZ","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2441294411","title":"Increasingly Buggy","comment":"I have been using Evernote for years now. I love it! I’m noticing with some of the newest updates, we are having more and more problems. I use the checklist a lost and something as simple as not capitalizing the first letter of every checklist or numbered item is starting to piss me off. I also use the number list feature. Here’s the newest problem, if you delete number 11 everything after that starts at number 1 again and you have two lists. Very frustrating. Overall good service. I actually can’t live without this service so I’m very frustrated that it seems to be getting buggier","rating":3,"reviewer":"JZdizzle","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2441138461","title":"Mixed feelings. No support","comment":"It's been several weeks since updating Evernote on my iPhone. Several key files are unavailable. I have contacted support twice through the app support function without any effect. Was difficult to find a means of contacting support. I had to upgrade to the subscription version to gain access.  I have used this app for years on iPad, iMac, and iPhone. Worked well on all up to this point. I am going to search for an alternative.","rating":3,"reviewer":"B+6","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2438318740","title":"4/18 The recent crash fix didn’t work!","comment":"4/18/18\nThe Evernote bug fix to eliminate crashes on high Sierra 10.13.4 did not work!!\n\nI can no longer run Evernote. Crashes every time I try to open it. Uninstalled and reinstalled Evernote to ensure I was running latest version. No change.","rating":1,"reviewer":"FoCoB","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2438061118","title":"Wait to update","comment":"Latest update won’t update on my iPad","rating":1,"reviewer":"Upnort9999","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2437923589","title":"Great App for Coaching","comment":"I have used Evernote for coaching youth lacrosse for years. I makeup my practice plan and workchat it to the coaches so we are all on the same page as soon as practice begins. I add photos of drills and plays so they know exactly what the objectives for the practice is. Great tool!","rating":5,"reviewer":"Baughdog","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2437603137","title":"Ridiculously Slow","comment":"Evernote used to be great, but its only gotten progressively worse (slower) since they moved to a cloud-based storage system.","rating":2,"reviewer":"C J Olson","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2436881528","title":"Evernote unusable in iPad","comment":"Recent updates have wrecked the iPad experience so much I can’t really use anymore. Running on a brand new iPad Pro with latest iOS. Upon opening, 95% of time app is frozen (appears to be loading but nothing ever happens). If I manage to get it to operate (luck?): Search doesn’t work. Recently opened doesn’t work (shows ancient notes instead). I’m a paying, premium user and more and more regretting investing so much into a software platform that is failing.","rating":1,"reviewer":"AC n BKLYN","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2434279521","title":"Keeps Freezing Upon Launch","comment":"I would have rated this a 5-Star app for numerous reasons, but recently, whenever I go to start a note during a meeting, my app will freeze upon launching and will now allow me to select or move anything. When I go to re-launch the app, I have noticed that the same screen is still up like I never closed it out. I have also deleted and reinstalled the app many times without a change. - PLEASE FIX!!!!","rating":3,"reviewer":"Sh@i_2121","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2425955803","title":"really HORRIBLE design :-(","comment":"Zero star if I could! New design is horrible. Editing, viewing, sharing, everything changed... for the WORST.. UNUSABLE. HOW DO I REVERT BACK? If I can’t, I’m finding another app and go back to free to just access old evernotes. Seems like you’ve put Premium / power users at bottom of user list.  UX designers, stop giving users what you think is cool to you. Use data and user test for your core segments. There are issues with hiding info users need to be productive. I only updated cause I was getting a long error msg on certain actions.","rating":1,"reviewer":"Practicalsense","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2423454134","title":"Lost over a year's worth of notes","comment":"In a matter of seconds I lost a year's worth of work that I can not get back because the sync between devices wiped out my daily journal.  Do not use the sync feature!!!","rating":1,"reviewer":"butlermj","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2413781350","title":"Oh Oh, Having Trouble","comment":"Evernote was my 'go to' app for storing things that I want to keep for a later time. It allowed me to organize the notes in folders and did everything that I want UNTIL LATELY. Now I have trouble copying things off the clip board and placing them into Evernote. I don’t understand what has happened. I am a basic user and, being retired, I don’t need a pro version of the app. Please place the ability to copy notes from the clipboard back into this version.","rating":5,"reviewer":"Jar el","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2413439458","title":"Freezing Frustration","comment":"Evernote is no longer a simple to use notebook. Bullets and photos cause the app to freeze. I’m looking for an alternative.","rating":3,"reviewer":"MniMud","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2410101110","title":"Very annoying bug","comment":"The mobile app stops responding when opens a note containing indentation created in the Mac app","rating":1,"reviewer":"wxnvsk","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2403850955","title":"Endless loop","comment":"Can’t use the app.  It is in an endless loop bringing up the premium upgrade page repeatedly","rating":1,"reviewer":"JJ48 5x","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2402442767","title":"Crashes All the Time","comment":"App is super slow with latest IOS update. In particular, copy and paste are difficult to make work anymore.","rating":1,"reviewer":"BeenHeavyinFlorida","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2400306723","title":"No longer loads my notes","comment":"I have been unable to load any of my notes on either of my devices for weeks now, usually ending with the app crashing. Please fix the app.","rating":2,"reviewer":"shari081","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2399900602","title":"Why why why","comment":"Why the poor interface in this day and age? Why the cluttered title clippings? Why the squished internet clippings? Why the inability to forward documents? This is an app with so much potential but is so clugy. Spare me the future and give me the present!","rating":2,"reviewer":"ubiquitas","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2399787585","title":"Updated version will not allow access to free version","comment":"The update 3/8/18 does not allow usage of the free version, so one cannot even move the stored data from Evernote to another without agreeing to subscribe to the paid version. Now If I do not Pay, I lose my data. Nice going guys","rating":1,"reviewer":"CBee35","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2398805507","title":"Since Apple update","comment":"Evernote has frozen and cannot open ever since the latest Apple update and tons of people have complained and it’s been months and nothing has happened, all my notes are prisoner. Until the creators get this fixed they get a one from me,","rating":1,"reviewer":"zbamj","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2394798039","title":"FORMATTING ON WEB AND IOS IS MESSED UP!!!!","comment":"SIMPLE FORMATTING IS STILL MESSED UP WHEN ACCESSING FROM WEB OR IOS APP!!!!","rating":1,"reviewer":"JPANIC02","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2392841315","title":"Needs work but it’s Handy!","comment":"Great from filing bills and payments! Love how I can organize my life in one place without all the clutter and hassle. I wish the display was more customizable and bring back the dark theme. Maybe a calendar, calculator, and reminders built in to the app. Due date option would extremely handy.","rating":3,"reviewer":"mccli357","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2390430064","title":"Great software. Stingy policies","comment":"To sync my notes between two devices I need to upgrade. Why would I do that when there’s plenty of free software that would let me do that?","rating":2,"reviewer":"Brianjralph","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2387045942","title":"Love!","comment":"So I absolutely love Evernote and recommend it to anyone I know! I pay for the most storage because as a musician I have a ton of vocals, beats,rhythms,freestyles ,etc recorded in there to pair with written lyrics as well. Love","rating":5,"reviewer":"Sarah Sic","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2386980932","title":"Files app support would allow editing of attachments","comment":"If this app worked as a Files document provider it would be possible to edit file attachments (e.g. Word documents, OmniOutliner documents) on iOS just as it is possible on the Mac.  So please do that!","rating":3,"reviewer":"squalamack","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2386958280","title":"Switching to Google Keep","comment":"It's a good app, even though free version is only good on 2 devices. \nWE NEED AN \"UNDO\" OPTION!!\nThinking of switching to Google Keep\nUpdate: I'm officially in the process of moving my notes to Google Keep. They have an \"Undo\" feature!!","rating":2,"reviewer":"Genie Menken","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2386869161","title":"Useless with latest update","comment":"In the last few weeks I have been unable to open individual notes and read/search the contents","rating":2,"reviewer":"NikinVA","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2386274198","title":"Disappointed","comment":"I use this app mostly because of scannable and the ability to search scanned docs. The Mac version is ok, but iPhone version is unintuitive. Formatting is a pain, such as adding bullet points. Indenting is awful. I wish I could find another app where usability was the top priority. I subscribe to the premium version and considering other options upon annual renew time. Every time I use this thing I dread it. Please put usability as your FIRST priority!","rating":2,"reviewer":"SellinIt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2372750795","title":"Can't edit notes since upgrade","comment":"I haven't been able to update notes in my Evernote since I upgraded to the latest version. I tried everything from restarting my device to deleting and redownloading it.\n\nI hope they fix this soon because otherwise Evernote has been great to me for many years.","rating":1,"reviewer":"@StateoftheA_R_T","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2371020558","title":"Turtle Notes","comment":"Did you be called “Turo notes “. That’s because the program is now very slow! I only have about 7000 notes, but it takes 30 seconds for the app to show a note on my iPad and sometimes on my iPhone.","rating":4,"reviewer":"Tdubzhere","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2368445462","title":"Subscriptions for notes no thanks","comment":"I was looking for something to take notes better then the native one on the iPhone but a subscriptions for notes no thanks","rating":2,"reviewer":"wjr17","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2368398228","title":"What is going on?","comment":"I purchased a new phone and now I can’t access Evernote. It’s forcing me to upgrade to continue to use it.\n\nWas able to correct it","rating":5,"reviewer":"Nanairo2008","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2367845764","title":"Not working","comment":"I’ve been using this app for years. Now it won’t display contents of many notes. App freezes & crashes constantly. Currently worthless.","rating":1,"reviewer":"App Anygood?","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2365534739","title":"Couldn’t live without it!","comment":"Evernote helps me so much!  I love this program. I am a senior citizen well into my 70’s and E helps me keep track of everything and stay organized. I only wish I had started using E a long time ago","rating":5,"reviewer":"Milamoya","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2364803825","title":"Not useable","comment":"For a while the app worked fine but now every time I open it, the app immediately crashes","rating":1,"reviewer":"Savagescythe44","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2364188769","title":"Great App","comment":"Thanks for keeping the app updated.","rating":5,"reviewer":"LGFerence","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2361451923","title":"No help here, worst app ever","comment":"I subscribed to premium but it won’t sync to iPad. When I try, it takes me to App Store.  Then nothing happens.  I tried to get help, reply was in a week!  I have never seen a service that you pay for that has no support but they sure took my credit card fast.  And talk about about wanting to access my private information!","rating":1,"reviewer":"Roadog66","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2360287592","title":"*USED* to be a great app...","comment":"I’ve been a user for 5+ years, and I loved this app.  I used it for everything from shopping lists to subscription information to the chores my kids are supposed to do. And it *was* a really awesome app. \n\n...and then, they added paid subscriptions; and those of us who opted not to pay for features we don’t value were effectively abandoned. Half my notes won’t load anymore, and the only “customer service” option you have is the user forum.  Literally every single instruction on their help pages tell you to create a support ticket; but the chat feature is conveniently never available, and the email feature is only available to paid accounts.  \n\nExtremely disappointed in the “screw you” attitude that Evernote seems to have adopted.","rating":1,"reviewer":"Lola1229","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2355763850","title":"Still No Linux Client","comment":"\"We're a small company\" doesn't wash anymore...and your company's behavior demonstrates that you clearly do *not* \"appreciate the community\".\n\nEither hire a dev or two to port a full-featured version to linux, fund and support an open-source team so we can have critical functions such as the ability to export, or strike those words from your site.","rating":1,"reviewer":"0x45","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2354340706","title":"Apps is fine, but slow and crashes 3-5 times per hr - really annoying","comment":"Apps is fine overall, but slow and crashes 3-5 times per hr - really annoying... Evernote - can you pls get your stuff act together - the crashes like 5 times per hour, which makes it unusable on mobile b/c that wastes a ton of time... similar issue with the desktop app on Mac, which slows down to a halt a few times a day and the only solution has been to restart the app... c’mon Evernote - it’s a shame... (it is also impossible to find anyone to provide feedback to or ask a question..)","rating":2,"reviewer":"AppleUpdatesCompatibilySucks","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2353898418","title":"Super App!","comment":"One of my top picks for sure!\nOne of the FIRST DOWNLOADS for a new phone!","rating":5,"reviewer":"pike942","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2353666932","title":"Needs fixing","comment":"It now takes longer to load plez fix great app.","rating":3,"reviewer":"Laz6010","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2352223483","title":"Recent issues","comment":"I’ve always loved Evernote, and I’ve become completely reliant on it in every way. However since the most recent update (March 2018), I’ve had massive issues and customer service is nowhere to be found. I’ve emailed twice...  “urgent!” And no response. It IS urgent!!! I’ve been logging my client hours for the past two weeks on a major job, and suddenly some of my notes, including client hours, show text in preview but when I go to open full note, it comes up blank and freezes the entire app. So I can’t bill my client until this resolves. The copy paste feature has also started acting up. Can only C/P small amounts at once. I’ve tried uninstalling and reinstalling app, restarting phone. Nothing. I’m very angry about this.","rating":3,"reviewer":"Lindsey Caldwell","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2351274003","title":"Refusal to add subfolders is a dealbreaker.","comment":"The lack of subfolders is infuriating. All the other bells and whistles are nice, but that doesn’t really matter when I’m so limited in how I can organize my docs. \n\nI am actively trying to find a replacement, but this incredible oversight seems to be commonplace in the app market. It shouldn’t be this difficult. I’m paying too much money a month to be this frustrated.","rating":2,"reviewer":"MilpoolFilms","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2349046122","title":"Love","comment":"Love, luv this app. Please don’t stop maintaining it. Please add more note backgrounds, like before!!\nThank you!!","rating":5,"reviewer":"Pinaycharms","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2348961959","title":"8.9.2 is buggy...update","comment":"Been with evernote for years. Never sent in a tech request before a couple of days ago (still waiting for a reply other than an automated response that doesn’t help) the problem is the content of some of my notes has disappeared when using evernote with iPad 2. Works fine on my iphone 6. So there’s obviously a bug in the code for iPad...please fix asap, or respond and I will adjust my rating but for now that’s an accurate assessment of the software and service.\n\nUPDATE: i uninstalled and reinstalled. That solved the problem.   So based in the simple fix i’ll bump the star rating up.\n\nUpdate: 8.10 is flawed, doesn’t load a web page correctly, need to simplify formatting to view....soooo, back down to 2 starts.","rating":2,"reviewer":"gedly1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2348656914","title":"Keep freezing","comment":"Since the latest update it stop working every time I press reminder tap. Are you planning on adding more feature to handwritten note?, it is really basic that evernote offer and I am expecting better as paying customer.","rating":2,"reviewer":"Jakedkham","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2348517079","title":"Disappointing ‘update’","comment":"I’ve used Evernote for a variety of lists over a year now because I used Apple products and my husband uses Android ones. This app seemed to bridge the gap between the two systems. \n\nNo more. With this latest update, my husband can see the lists and I can’t. They don’t load for me at all, just come up blank. As if it can’t even load anymore. Very disappointed!!","rating":1,"reviewer":"Lady-k8","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2348438175","title":"Crashes, slow, poor syncing","comment":"Are they downgrading Evernote with every update because now their desktop app is giving me the same problems as this app.\n\nGoogle basically does this all for free without a Device limit except google actually works.\n\nFrom mega syncing errors, to extremely slow typing and functionality, to random crashes, it’s clear that this app is still stuck in 2011.\n\n0/5","rating":1,"reviewer":"Schnark Buckerbird","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2347333372","title":"Don’t get this update!","comment":"I use iOS almost exclusively and have become dependent on this app.\n\nBut this latest app freezes during loading of certain notes. It seems related to indenting of checkboxes or bullets. If I go to the desktop app and “Simplify Formatting” on the app or even just delete all the indents, the iOS app loads the notes fine after sync.\n\nBut I have a LOT of notes like this and this is not a fix. I’ve submitted a ticket and information to support, but based on my history with the company I’m not holding my breath for a quick reply.\n\nSkip this update if you can.","rating":1,"reviewer":"ChadLawson","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2346988225","title":"Update Wrecked My Note","comment":"This last update won’t let me access one of my notes with personal information that has a portion of it password protected within the note. I need to get to it and there’s no way to access it from my phone! I’ve tried multiple different ways but to no avail. How can I keep relying on this app when it’s become slower, more cumbersome and now unreliable??","rating":1,"reviewer":"Ethiokiddo77","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2346920900","title":"Not as I expect","comment":"Not as I expect","rating":1,"reviewer":"AmmarYa","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2345785536","title":"Back to Wonderful!","comment":"I love using this app. The writing feature with the Apple Pencil is top notch once again. This is my go-to writing and note taking app!","rating":5,"reviewer":"traquino98","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2345690317","title":"The update broke my phone app","comment":"After updating I am unable to open any of my notes, making the app useless on my phone. Bad bad bad.","rating":1,"reviewer":"RhondaArt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2343057294","title":"Getting worse and worse","comment":"Wake up Evernote? No support available for premium users anymore? Evernote freezes and there are no options to fix other than keep trying over and over to no avail! This is absolutely ridiculous and you expect me to renew my subscription next month?","rating":1,"reviewer":"bekqu","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2342713028","title":"Too greedy for me","comment":"Glad I saved my notes on google drive before using Evernote. Thought I could sync my phone and iPad, and I could for 5 bucks a month. You can't even get on Evernote from a different device without \"upgrading\".","rating":1,"reviewer":"HLD2","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2342524207","title":"I can’t paste into Evernote","comment":"I use Evernote as my daily journal. I found I am unable to paste scripture verses into my entry, as I have done for years. Please fix! On the other hand, I love the sketching tools - amazing! Would be great to add more colors ;)","rating":5,"reviewer":"bluehawaii_777","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2339678460","title":"Great before last update","comment":"This app worked perfectly until today’s update. Now I’m unable to open an important note. Is there a way to revert to the previous version of the code?","rating":3,"reviewer":"Clemsonikki","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2339034288","title":"I can forgive anything except disappearing notes","comment":"I’ve loved Evernote for years, but until it stops deleting my notes without me realizing, two stars is the highest it can get. Luckily, they’ve mostly been replaceable, but one was filled with dozens of business ideas I wanted to gradually implement. I should have backed them up, but Evernote shouldn’t have randomly lost them.","rating":2,"reviewer":"randman21","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2336678573","title":"I can not open my notes after update!","comment":"some notes is viewable. but most notes are not opened. it takes long time and finally app crashed.","rating":1,"reviewer":"openmann","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2334018098","title":"Features break, Sync crawls, App crashes","comment":"That’s basically it. \n\n2 steps forward, 4 steps back.","rating":1,"reviewer":"Run Forest, Run!","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2332175929","title":"Great functionality but missing a few formatting options","comment":"Things like creating tables or strikethroughs are no longer possible in the new mobile version.","rating":3,"reviewer":"DonutsTasteGood","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2331988742","title":"Saved searches are now working correctly in iOS","comment":"Evernote v8.10 on iOS v11.2.6\n\nAn iOS-only issue with saved searches ignoring which notebook(s) specified to search has been resolved in the latest update.","rating":5,"reviewer":"bryanwydra","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2331557912","title":"Double trouble","comment":"I use Evernote mostly to save web pages. I have the app installed on iPad and iPhone. Every time I go in to find an entry, there’s two of many pages. Then it tells me I’m out of space and need to upgrade. Very shady, Evernote. Maybe I wouldn’t run out of space if you weren’t saving multiples copies. I’m getting weary deleting stuff I don’t need.","rating":2,"reviewer":"AviX","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2328814936","title":"Used to be great, now undependable","comment":"Terrible things happen, like your notes disappear.  Yes there are ways to get them back, except for local notes.  Local notes are the worst implementation possible.  The only way to backup? Export. Each note. Individually.  Manually. Then if you have to restore same thing in reverse.","rating":2,"reviewer":"EZJazz49","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2328360004","title":"8.10 is Unusable","comment":"Working with lists has become more difficult with each recent release. Now with 8.10 I can't even hit return to get a new bullet. The text is still indented but the list icon isn't highlighted. If I tap the list icon I get a list item indented further with a second level bullet. Even worse, I can't tap the delete key to delete the return, I have to undo the return. \n\nThis is getting ridiculous.","rating":1,"reviewer":"eboldt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2325900027","title":"Hard Pass","comment":"I liked it in the beginning but with all the MANY updates it got worse and worse. Started to freeze on me so often my notes started slowly disappearing or my note/task page froze to the point you had to close out over and over until you were able to access that note/task to edit.","rating":2,"reviewer":"LuarMet","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2325015641","title":"Word count in 8.10?","comment":"Haha. What a great feature to arrive only 8.10 while others have it in Beta.","rating":1,"reviewer":"stormgen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2321440807","title":"Great","comment":"Great way to keep and work with others.....","rating":5,"reviewer":"Lutalobass","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2320823346","title":"Best available but needs a few changes","comment":"I left Evernote usage for about a year, using OneNote instead. Evernote is far superior in many ways, but at the time I thought I needed access on more than two devices (figured out I really don’t now) and I also enjoyed the greater organization OneNote offered.\n\nNow I am back to Evernote. Why? Evernote is better all around  in appearance, syncing and reliability. Even more so, they have since added a feature called Stacks. This allows the very organization I liked OneNote for.\n\nThe iOS apps for iPhone and iPad also work without issue. (With OneNote I rarely got it to work on my phone!)\n\nAlso, the chosen font size on iOS is a bit too small. I’d love an option in Settings to set at a larger size by default.\n\nMy reason for only four stars is this: At personal usage of Evernote as a single user with other bills to pay, I could hardly justify paying monthly/yearly to go beyond Basic account level. It is too quick a jump for some users, specifically for two features: downloading notebooks and usage on maybe three versus only two devices. Thankfully I can live without these features.\n\n(That said: I think it is absolutely reasonable to reimburse app managers by purchasing the app or paying a subscription for things like business and/or team use. I even wouldn’t mind to perhaps pay a reasonable **one-time** amount to buy the app outright for smaller uses like mine; however, monthly subscriptions are not a feature I agree with in the world of mobile apps unless it is a for-profit business using it.)\n\nDespite this, I love Evernote and the organization it affords. It is a massive improvement on simply using the built-in iOS Notes app—even as of iOS 11—and far more reliable (and beautiful) than OneNote.","rating":4,"reviewer":"songsinthenight","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2315911269","title":"Great app but they don’t know who they want","comment":"I keep getting ads about using Evernote business but I don’t want their service for business. I do use it for business but I don’t think they understand what I want as a business owner. I use it for myself, I don’t have a team, although I imagine I will at some point, I don’t think that this would even serve my team if I had one. there’s only one thing I want out of the premium service and that is being able to use the app on all my devices. That really should be a free service. It’s stupid the way you guys do it. It’s incredibly frustrating.\n\nI’ll make this easy for you Evernote. The only way I would pay a higher price for what you offer is if you provided mind mapping or flow charting in my note taking. There isn’t really a great option out there and it would allow me to see everything all at once. You guys should consider all the ways people can take notes and I think this would be the next frontier.\n\nYou guys also could make it easier to make charts and graphs. I think those two things would be worth the price.","rating":2,"reviewer":"@davessuccess","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2314034779","title":"Notes are now blank screens","comment":"Updated today. Now all notes open blank. Fix quickly please!!!","rating":1,"reviewer":"TSC2003","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2313681107","title":"No last modified datetime","comment":"An auto generated last modified date time stamp (either as a metadata or as part of the file)will go a long way.\nCan’t imagine evernote has taken so long to put this feature. Folks have been asking this from 2014!","rating":3,"reviewer":"Darthvader9","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2308304749","title":"Update NOT!","comment":"Update doesn’t work!","rating":2,"reviewer":"wingate19","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2306364356","title":"Love it","comment":"I mainly just use this for password and note taking. I absolute love it! I can easily organize, search, and find all of my password/notes. I also love the security function(password/touch is). It is also nice that all your notes can be accessed off a cloud. Some may be against cloud storage but I love I can go on  my computer or delete the app and still have all my notes. Great customization, great organization, great connectivity, Great app. \n\n19 year old college student.","rating":5,"reviewer":"B -ban","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2306203218","title":"Terrible Annotation","comment":"Great app on windows and Mac. Terrible on iPad for pdf annotation. Extremely inconvenient switching tools, barely any palm rejection even for Apple Pencil. Sliding the slides stutters like hell.","rating":2,"reviewer":"Jayden 125221","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2305764806","title":"Getting pretty frustrated","comment":"Evernote has been a fixture of my life for years. Unfortunately in recent updates they’ve decided to relentlessly try to “fix what ain’t broke” and it’s getting ridiculous. Stop making automatic edits to my formatting! Fix the search bug. I’m getting ready to quit if this product doesn’t shape up quickly.","rating":1,"reviewer":"nickname07","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2300073642","title":"Barely acceptable","comment":"The app loads slowly and is clunky almost to the point of not being functional. Its features are nice, they just don't work well. If I didn't already have all my recipes organized in here, I would find a better app in an instant.","rating":3,"reviewer":"45577622379086","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2298436208","title":"Stopped Using When Evernote Food was discontinued","comment":"I just opened this app today for the first time in over five years. I used to use it constantly, but when Evernote discontinued their Recipe/Food app I drifted away to just using my native iPhone notes because Evernote no longer offered anything that set it apart.\n\n4 Star Old Review\nI like being able to sync notes across multiple devices; However, I find some of the text tools to be somewhat buggy. \n\nI tend to encounter space issues/bugs in some of my notes. I would also like it if I could always see what I was typing. Often my text runs under the keyboard icon. Don't get me wrong, I do like this app. I would give it 5 stars if there were less spacing issues.","rating":1,"reviewer":"B-Rad2020","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2292095313","title":"Ever release fixes one thing, breaks two.","comment":"UPDATE: The latest build has reintroduced sync problems that have not been seen since 2009! The UI and the sync are totally out of whack, in fact the UI is totally out of sync with everything. I cannot predict if an operation will return or not or what arbitrary thing will result. For example, I want to add a photo between the 1st and 2nd paragraph of a note. I position the cursor there then select a photo from my Camera Roll. What happens? Usually I am dropped back in the note with no idea why it didn’t pick a photo, so I do it again. Later I see the same photo is in the note and is at the bottom, TWICE. Whoever threw out the multithreaded working code and put this garbage in place should be removed from such a critical role in the team, this is useless. At least TEST it before you release it! Utter junk, I can’t tell if the app is working or not most of the time and I suspect that it is syncing in the background, or something. Horrible, I wish I could go back the 2015-16 code, that worked really well. At least compared to this. A product this old should not be regressing into a broken MVP every year, how can I use this to run my business in this state? Arghhhh! Back to my prior review:\n\nI’ve been using Evernote since it was a month or two old and have paid for a premium account since then. I have nearly 10K notes categorized into 100 notebooks. I use it every day but I wish someone would build a competing product that imported my notes. The UI/UX for Evernote is a two-steps-forward-one-step-back kind of process. They rewrite the UI and throw away things you had come to rely on, just like the old Soviet leadership change would deny the previous regime’s follies. \n\nSpecifically, sorting is still universal! For some bizarre reason, if you sort a notebook, ALL notebooks sort that way. Is there a good reason for this? No. But why make the app flexible when you can add crap that nobody want?\n\nI dare you to take a photo and try to crop it in the app, when you tap the photo to crop, it changes size and when you are done cropping it shrinks size and messes up the cropping. Guys, this is 8th grade geometry, hire some people that know geometry!\n\nCan you set the default font for notes on an iPad Pro? No, because why would you want people who have reduced vision to see their notes, after all *Everybody* in the world can see as well as a 20-year-old can’t they? Really, a ten-year-old app and the preferences don’t include the default size? I have to edit my text in another app and copy it to Evernote. \n\nGeez, guys, hire some good UX people to study and fix the app and spend less time on features nobody cares about. Presentation Mode? Chat? Messaging? Geez, how about building an excellent note taking app? If anyone builds an alternative that imports my notes from Evernote I’ll try it without hesitation, none. I feel little loyalty because I have to fight the UI every day. It is not very good.\n\nDespite that, I lived through the early days of Evernote and their synchronization process has been rock-solid for years. I never worry about it. Unfortunately, they are trying to become some kind of everything-for-business app, but they keep swinging at useless trends. Focus on improving the UI/UX and being the best app for taking notes., As it is I use other apps and copy my stuff into Evernote for the reliable synchronization.","rating":1,"reviewer":"fgk","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2288725258","title":"Paid back to free nightmare","comment":"I used this free for years before upgrading last year. This app was displaced this month so I didn’t renew my subscription, which becomes an issue accessing my notes blocked by upgrade offers. I’m sure they’ll comment as an end-user error but I will say for a fact everything is intuitive right up until you’re no longer a revenue stream.","rating":1,"reviewer":"kevineggers","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2285909925","title":"New user interface is awful","comment":"The new user interface is disgusting and reminds me of windows 98. It won't let me sort notes or notebooks by shared and the search function might as well not even exist as it refuses to even search for terms. I can search for a word or phrase I'm looking at RIGHT THEN AND THERE and it won't register. I'd rather switch my entire workflow than use Evernote until they fix this abysmal user interface.","rating":1,"reviewer":"RyanANorris","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2284979000","title":"Needs some improvements","comment":"I have 3 main gripes: \n\n1. The search is HORRIBLE.  They need to use the same relevance algorithm that is currently in the desktop version.  If I search for “green,” the notes with green in the title should be at the top, then the notes with green in the body.  Right now they’re just ordered alphabetically by title as long as “green” is anywhere in the body.  It’s seriously awful on mobile and I can’t believe this search algorithm was ever approved.\n\n2. They took out the ability to scroll a letter while browsing your notebook, even though this was in a previous version of Evernote.  This is a huge problem if you have a lot of notes in the same notebook.  It means the only fast way to find a note is to use search, which is a lot of extra clicks, and also see #1.\n\n3.  When using snippet view, scrolling is terrible through a large notebook.  You scroll to a note, find it, tap it, then all the snippets load and it randomly scrolls you to somewhere completely different without opening with the note you clicked.  Unbelievably bad.","rating":2,"reviewer":"Jorge jorgeson","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2281262561","title":"Poor performance","comment":"I tried to update one of my notes by typing in new information on my table via iPhone and Evernote will not allow me to select the cell. I guess I expect better from an app that charges for their services.","rating":2,"reviewer":"Trescrwn","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2272033140","title":"For business","comment":"Natural workflow. Easy to use. Has saved me countless hours","rating":5,"reviewer":"Billy Hustle","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2271491373","title":"Thank You","comment":"Thank you for stacking the notebooks in the app!","rating":5,"reviewer":"Sherod-Malik","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2270901432","title":"Use it daily...have for years.  Figure out your process and it’s hugely helpful!","comment":"Evernote has been hugely helpful for me over the years.  I use it across a rather eclectic combination of Mac, windows, iOS, and Android devices, and it never ceases to amaze me how helpful it can be in helping me capture...\n- things I need to return to or follow up on (important or critical items for Getting Things Done)\n- save as potential reference material, \n- save as an \"might be fun or interesting to look at later\" (a mini brain dump so I can free my mind to focus on an important item at hand).\n\nOne thing to keep in mind is that Evernote is extremely flexibly in how it can be used, and doesn’t strictly prescribe how you should use it.  It’s up to you to define the process you need to use.  \n\nIf you're new to the app, and want to get the most out of the it, take some time to think about what you wanton need your use of it to accomplish.  What are the things you need it to help you do, or do better, or do more of?\n\nBe intentional and consistent in how you use the app and you will begin to see the value in huge ways.  What you get out of use of Evernote will be proportionate to how consistent and intentional you are in what you put into it.","rating":5,"reviewer":"Colwell Chaos","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2268578685","title":"Awful","comment":"Awful app. Took a pic, converted to pdf, despite clearly legible it never became searchable.  Tried converting to plain text but now my note has disappeared completely (and i did not keep the original... I know!). Site talks about submitting a ticket but that option never materializes.","rating":1,"reviewer":"Sfguy220","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2263333654","title":"Why?? How??","comment":"Once again at a conference and have to keep switching between the iOS camera and Evernote because I can’t zoom in to take pics of slides with Evernote. This is some incredibly lame. Been a long time user and even paid for the yearly fee but this...???....while sitting next to a colleague using the free iOS notes app and see less LT taking pics and writing notes without having to serve between apps, which lags and can miss points in the process. Please, for the love of all things on this good green earth fix this!! Thank you.","rating":3,"reviewer":"cyphernetics","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2255931738","title":"Terrible","comment":"So now I can’t even access my notes on my phone in a browser. They are forcing you to download their app that constantly has issues with formatting, bugs, and lagging. Thanks Evernote. Thanks for forcing me to download your portly designed app.","rating":1,"reviewer":"somethinorother","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2254600930","title":"Moved all my data due to greed","comment":"Greedy Greedy people. No thank you.","rating":1,"reviewer":"pugdogg","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2254420579","title":"More affordable rates","comment":"As a mom of two who is living on a tight budget, can you bring back the plus option or any other affordable option because i could not afford the yearly premium price.","rating":2,"reviewer":"Minakichu","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2251280985","title":"Long time user","comment":"I have been using Evernote for a very long time. For a while my usage was sky-rocketing. More and more I find myself using Evernote less and less. I haven’t touched it in nearly 5 months. So it’s no wonder why I’m probably going to cancel my subscription this year. I picked it up to write in my journal again. Not five minutes in I was think Ming “honestly, it’s been 2 years and in STILL can’t do this simple action that I could with the old system.” So I immediately wrote this review. Hey, the harder you make it for me to leave you feedback, the more likely it goes here. \n\nTo most it seems to be a battle between the new simple UX or the old feature-rich environment. Although I tend to hear more that the features win, to me It’s about the FUNCTION. Raw, foundational, simple logic is missing, by mistake. And to put it back requires a major re-write... because they didn’t stop to consider HOW people were using their software. They were swarmed with paying customers who demanded a better UX... but that was with the understanding that they would get to keep their functionality too. So don’t get me wrong. Evernote by itself, if you knew No better, is a great platform with a smooth UX now. But long-time paying customers are dropping now because year and years of notes have been indexes based on sorting functionality that the new Evernote simply can’t handle. And lastly, Evernote’s solution to stop the WAVE of upset/paying customers, is to disconnect their ability to communicate, so don’t expect to get through to support if you have an issue.","rating":1,"reviewer":"carpedivum","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2250866637","title":"Customer support is lacking","comment":"Premium subscriber with many years of happy use.  After extended chat session I never could get the rep to acknowledge what the actual problem is.  I have set this app up on multiple devices syncing successfully via 3rd party compatible app and am quite familiar.  Can not get any straight answers.  Tried to forward email that proves device was added and screenshot of error message saying the account was not authenticated .... the email bounces back saying the ticket number included in previous message from support rep could not be found.  With no phone support... and automation that kicks back conflicting info I am beginning to wonder what is going on.  The message from this... if it works.. great app!  If you have a problem .. ???  Too bad...","rating":2,"reviewer":"ZzSass","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2250348700","title":"Good app","comment":"The app is really helpful in managing daily tasks. One thing is not comfortable for me is that when I create a new note the focus is set to the note description, not title first. It is really annoying sometimes, especially when you want to create a quick note. Could you please implement this feature in the future releases  - setting focus on title first? Thank you!","rating":4,"reviewer":"minimyc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2250141803","title":"Ooh!  Another suggestion for app developer","comment":"Would you also pretty please work on making share capability for iPhones similar to webclipper on PC browser in the sense that it'll auto determine which notebook article should go to?  \n\nI love that on the webclipper so much.","rating":4,"reviewer":"onken82","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2250095569","title":"No Phone Support Even For Premium Customers!","comment":"I’ve had Evernote Premium for awhile, use it daily.  Haven’t had an issue until today.  Tried to call customer support.  There is no phone support!  Only business customers receive phone support.  What do I pay all that money for if I can’t talk to a live person!  I tried a chat, which was excruciatingly slow!  Then the chat person dropped the chat and sent me emails.  So they decide to go to an even slower method of communication?  WHAT!!!!!  This is the epitome of BAD or even NON-Existent customer service.  I will be rethinking an alternative for an app I thought I was pleased with.","rating":2,"reviewer":"Jackie52w","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2247560662","title":"Cant highlight on iPad","comment":"$70 per year for premium and you can’t even highlight. How is this not a function yet in 2018?","rating":1,"reviewer":"zer0crew","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2247515040","title":"Used to be great","comment":"I use Evernote app on my phone and web version on my windows laptop. Now I find the undo feature missing on the web version. So when evernote freaks out like it always does and randomly erases stuff on the screen, there is no way to “undo” the erase that just happened. Totally unacceptable how they keep removing features even for premium users. The free version is basically worthless so you have to be at least a premium subscriber.","rating":1,"reviewer":"ejmyers","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2246226288","title":"Gave 1 because there was nothing lower","comment":"Latest upgrade wiped out two years worth of notes.  What reputable company releases like that.  Look elsewhere!","rating":1,"reviewer":"Tomr1109","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2242890416","title":"EN >>OneNote>>EN","comment":"EN sorry I doubted you. I read all the wonderful things about OneNote. I downloaded 1N notes transfer app. I uploaded all my EN notes to OneNote. I started using OneNote and discovered the grass was not greener. The ecosystem wasn’t as complete as EN. The navigation for me was easier on EN. The general ease of use overall was simpler on EV than OneNote.","rating":5,"reviewer":"Richardz2063","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2242388897","title":"What a waste","comment":"Premium user here\nI have never felt so stupid after a subscription for a product but this thing is such a mess it makes my blood boil\nHow can you ask 50 dollars for this buggfest\n\nUpdate despite all my requests about the wasted space and them acknowledging it too they aren’t going to fix the wasted space issue on iOS","rating":1,"reviewer":"Kwaleed2323","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2241941776","title":"Please make an option so i can write in the title","comment":".. without having to tap on it. Other reviewers I’ve noticed have been asking for this too. \n\nOtherwise great app. I recently moved from iOS notes because Apple hasn’t made an Apple Watch app that syncs with it.","rating":3,"reviewer":"Wikisz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2238474199","title":"Long time user","comment":"I have been a long time user of multiple Evernote apps.  My biggest gripe with with the Evernote app specifically is that they still haven’t perfected the “sync” feature.  I use Evernote on my iPhone and PC.  Instead of keeping one document or “note” for collaboration between my cell and computer I always find discrepancies between the two.  Sometimes it creates duplicate notes between the two, sometimes it misses notes.  The sync feature needs improvement.","rating":3,"reviewer":"Marc1985","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2236429453","title":"Loses notes","comment":"The point of a notes app is that it store notes and be able to find them again. The search is generally worthless, you have to use tags religiously because that’s the only way you can find anything. I’ve had a note of list items for 5+ years that I referred to. Now I can’t find it via Search. Text I know is in it shows zero results. Worse, I scrolled through thousands of notes and can’t find it. It’s gone forever. And I paid money for this?!?\n\nSaving web pages is lousy. It throws 3 photos in the list view that rarely have anything to do with the page or are just some design graphic from the site. And don’t even try to edit that note, it will destroy everything. Searching for any content on it is a waste of time. \n\nSurely there’s a better notes app than this aging poorly-maintained junk.","rating":1,"reviewer":"dottroy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2236209204","title":"No Support!","comment":"Want to just email the support? Pay for it.\n\nWhat to chat with them? No problem, 7am to 6pm CST. Now the time is 12:07 and chat is off line.","rating":2,"reviewer":"צחי","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2236205203","title":"Last update created typing lag","comment":"The inability to input text as rapidly as you type is a showstopper. Very annoying, on both iPad and iPhone. Please fix!","rating":3,"reviewer":"Me123it","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2233335968","title":"Buggy","comment":"I am a new user of Evernote and I'm finding a persistent bug.  With my Basic plan, I should be able to view my Evernote notes, etc. on 2 devices. However, Evernote will not allow me to view anything on my laptop unless I upgrade to a paid version.  There was only one time when it allowed me to get into the account  on my laptop.  Otherwise, zilch. I used the customer support chat feature, and the rep at first attempted to also upsell me, indicating that the Basic  account doesn't allow for use on 2 devices. I quoted to her the Evernote Basic plan info and she retracted what she'd told me about the plan.   She also said she'd never heard of the problem.  Very disappointed in the app and its support.","rating":1,"reviewer":"Marilynium","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2230807997","title":"Please let us lock entire notebooks!!","comment":"I use evernote as my journal, & it is a major pain to lock every. single. note. I would much rather lock an entire notebook with a pin or password. I know i’m not the only use begging for this change, so if you could implement this as soon as possible that would be wonderful!","rating":3,"reviewer":"Closetcreature24","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2225126733","title":"Great in theory, but almost nothing works the way it should","comment":"At this point, can't even get the app to open, and have had numerous other problems before. Guess I'll just stick to notes","rating":1,"reviewer":"instantdeath999","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2224738077","title":"Works Well","comment":"Evernote has been around pretty much since the beginning of smartphones so it’s no wonder it works so well. The app makes it easy to jot down notes, even take pictures instead (going further with auto detecting the edge of the document so you don’t have to worry about getting more than what you want in the picture), and sync them to all of your devices!","rating":4,"reviewer":"Cantrben","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2222909441","title":"Annoying bug","comment":"This is a great app - but there is one annoying bug I've noticed since the last update. Occasionally, notes would be duplicated after editing them without any input from me. I can remove the duplicate by closing the app in the app switcher, but the previous version of Evernote didn't have this problem. Please fix it, otherwise it's an excellent app! I'm on an iPhone X running iOS 11.2.5 .","rating":2,"reviewer":"Doodle Jump reviewer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2222536734","title":"Not what it used to be","comment":"I used Evernote extensively in college and started using it again a few days ago. I’m disappointed to see that I am no longer able to sync across my devices without upgrading. Additionally, the search function is not specific enough to quickly search through large notes which makes Evernote cumbersome to use. I’ll just use google docs instead.","rating":1,"reviewer":"IAmAwareness","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2219771684","title":"Painfully slow on iPhone 6","comment":"I’m a fan of Evernote in general but the app does not work well on an iPhone 6. It takes several seconds to open which can be trouble when I need to jot down a quick note.","rating":3,"reviewer":"Northeast PR","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2216460942","title":"A Necessary Evil; Poor Performance App","comment":"No other app syncs notes cross platform better. However, it’s become so bloated with feature creep (chat & sharing are really poorly done) that basic things like typing without a delay and creating new blank notes without the app freezing are unavoidable. STOP ADDING NEW FEATURES and focus on making the app faster and more responsive. I’m so close to switching to Google Docs (which works very fast) but I’m already locked into this app with 1000s of Notes. Evernote developers: PLEASE MAKE YOUR APP WORK BETTER!","rating":2,"reviewer":"usernone","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2212504768","title":"Lose Data Much?","comment":"Beware the automatic updates! Evernote has a tendency to wipe your data when updating unless you’re paying for their premium service. And don’t expect help - it’s almost as difficult to access that as it is to make a Genius Bar reservation. I get that everyone is pushing their in-app sales to make a profit, but when your job is to basically be a notepad, be a notepad, and when you release an update, don’t ef with their data. Is that too much to ask?!","rating":1,"reviewer":"DontGet2attached","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2212286705","title":"Doesn’t sync","comment":"It just wouldn’t sync any documents to my cell app for over 2 months now. Waste of phone memory. Desktop version freezes few times a day. Poorly designed.","rating":1,"reviewer":"OG LLC","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2196137270","title":"Trouble with Evernote on my iPad Pro","comment":"I have recipes on Evernote and when I try to access them on my iPad Pro it takes me to a screen with devices at the top.  I cannot access my files.  How do I fix","rating":1,"reviewer":"Mrs Snaps","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2195786724","title":"No Tab/Indent Button","comment":"It’s really hard to take notes on my iPad app with no tab or indent button (that I know of) for bulleted or numbered notes I’m taking in class!","rating":4,"reviewer":"Kayelina","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2195205567","title":"Two features to add","comment":"Premium user. Evernote is my go to for notes, to do lists, and planning - Great tool! I appreciate the improvements over the years.\nPlease add two features to the Evernote App IOS (iPad and iPhone versions) as is in Evernote for Windows App on my PC to get my 5 Star review.\n1. Merge | add ability for all the same reasons to use merge as on the PC - when traveling it would make it easy to compile travel notes and receipts.\n2. Reminders | add the ability to set multiple reminders inside a note. For example, my To Do list has multiple items that come due at different times - I would like the option to not have to create a separate note for each item in order to set a reminder. ... or the option to set up multiple reminders.","rating":4,"reviewer":"SSIDawg","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2188078255","title":"Not what the hype is all about","comment":"This app IS NOT the best note taking app out there not by a long shot. These guys need to look at Notability. That app needs to be available on cross platform!!!\nYou cannot preview the premium features so you have to buy to find out. PDF annotation falls on its face, worthless.  I want the document OPEN in the note, not click icon in your note  to open.  Again, EverNote, look at Notability.  You do that and make it cross platform I’ll be back.\nYou can’t organize by folders or file, uses a sloppy notebook system similar to OneNote.  Documents should be open and live in the note section and able to be written on via stylus or pen right then and there.\nI cannot believe out of the billion apps out there only Notability does what’s needed. It’s just not cross platform. Need a app with those capabilities that works on web, iOS and android. \nKeep trying","rating":2,"reviewer":"Magnumized","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2184226360","title":"Reminders are driving me crazy!","comment":"There appears to be no method of changing a reminder date without scrolling endlessly through each day!!! Really?? And when you do, the year isn’t displayed. You’d better not hope to get a reminder 2 years from now! Why can’t they provide a calendar picker or just an entry field like other apps do!\n\nAnd good luck sending a suggestion to them. I went to support, but the only “support” is predefined descriptions or the option of reporting “bugs.” Forget about talking to a real person.\n\nOtherwise, I love the app! Just don’t expect anything to change from users’ input.","rating":3,"reviewer":"SBoswell","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2182925904","title":"Editing","comment":"Please PLEASE allow multiple people to edit a note at the same time. Please. Other than that, I’ve been fairly pleased with the overall functionality.","rating":3,"reviewer":"#NathanB","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2175206433","title":"Locked out from synchronized","comment":"Been using this app for years. Got a new phone and logged in only to be forced to banish all my other apps from accessing the documents. The sync is gone. The ability to access my documents across all my platforms is gone. The app is useless to me now. Thanks for nothing.","rating":1,"reviewer":"Annabelle M","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2174423275","title":"Easy Info!","comment":"I love how quickly you can access information, plus there are so many different options on how you can store it. The only thing I don’t like is that you can’t have repeating reminders, it’s set for one time and then it stops. That’s fine though, will continue using for sure.","rating":5,"reviewer":"i_GummyBear","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2172505653","title":"Editing notes","comment":"After saving a note I try to edit it on the iPad but can’t, the key board comes up and covers half the note so I can’t even see what I’m typing, erasing, editing etc... Please fix this","rating":2,"reviewer":"WhyItunes?","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2168553365","title":"iPhone X switch gestures make evernote stuck for 5-10s","comment":"How to reproduce:\n1. Open a document, type something\n2. Use switch gesture to change to another app, e.g. Browser\n3. Use switch gesture to go back to evernote and it will be stuck for 5-10s\n\nPlease fix it :( the experience of evernote + iPhone X switch gestures was amazing before this bug came out\n\nThanks!","rating":1,"reviewer":"Lin hong en","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"Evernote","id":"2164414036","title":"Best, The...","comment":"I've been using Evernote for years, nothing else I've tried can come close.","rating":5,"reviewer":"Saint464","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"}]