[{"app":"TripAdvisor","id":"3329087555","title":"Don’t use the app use a regular browser","comment":"The app re orders the establishments in a weird way!  I want number one to be first, 2 to be second ...","rating":4,"reviewer":"Bennett5","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3328800364","title":"Good but room to improve","comment":"Please fix the Trips functionality and features","rating":4,"reviewer":"Sharkus7","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3328542047","title":"City Tale Sightseeing & Private Tours New York City, New York","comment":"On Oct. 20, 2018 Debbie with a noon 9/11 tour. She was fun, gave excellent information. She gave the best private tour a person could expect. I can’t get say enough good about her. How can I get her again for more tours?","rating":5,"reviewer":"Wise Girls","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3327680904","title":"The best travel app","comment":"But how do you download offline city map for iphone? Specific directions in Help would be my only suggestion for improvement,","rating":4,"reviewer":"Loveinfo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3327231884","title":"Homewood Suites by Hilton Savannah, Ga","comment":"All of the staff was friendly and eager to help, but I wanted to give special attention to Ms Pat on the breakfast crew who went above and beyond to bring me salsa for my eggs every morning.   \nAlso, the rooftop manager had good music line up for entertainment.","rating":4,"reviewer":"10021932","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3326946641","title":"Vini Da Grigio Venice,Italy","comment":"Very poor and insulting performance. I had a reservation for 7:00. When I arrived there was only one table filled. I was offered one table in the corner of a bare back room. When I asked for a table in the main room the answer was NO !! This is no way to treat customers !!","rating":1,"reviewer":"PL New York","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3325092898","title":"5 star app until recent update","comment":"Recent update was not tested. App locks up when going through reviews and you can’t get out of reviews except look at more.  Only way to get out is force close app and restart.","rating":2,"reviewer":"capt996","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3323271654","title":"Sharing is broken","comment":"We use the app all the time. \nThe share your trip feature is broken. There are errors for SMS, get the link, and More. And using email appears to work, at least no error message. But no email actually arrives to anyone sent to. \nPlease fix..\nAnd the desktop version doesn’t have a share feature :-(","rating":3,"reviewer":"Carlotta111","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3323163775","title":"Great stay in DC at Days Inn","comment":"Days Inn on Connecticut Avenue was perfect for my needs in recent business trip. Great value with spacious room, ample desk, in-room coffee, mini-fridge & microwave, extremely helpful staff, safe & well-lit parking (also reasonably priced,) only 2 blocks from subway, nice restaurants & also fast food options. Best thing was Soapstone Market across the street, a combination casual restaurant serving B,L,D as well as happy hour, but also market items if you didn’t want to eat out. I will definitely stay there again.","rating":4,"reviewer":"123elaine","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3321043640","title":"Urban Adventures Walking Tour","comment":"I booked this Walking Tour of Prague. I will be here for 10 days, and wanted to get an overview. This, my first tour, was more than I could have hoped for. Our guide Sasha was knowledgeable, informative and very interactive. He addressed all of our queries, and had a wonderful sense of humor. Our group bonded. It was a perfect Prague day.","rating":5,"reviewer":"Naime joy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3320480225","title":"Best tour ever","comment":"Haim, goes way above his work\n. We just had an amazing trip to Jerusalem, thanks to him. \n\nVery professional and excellent knowledge of the history, past and present of this city. \nHighly recommended.","rating":5,"reviewer":"HaimToGo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3319731242","title":"Cinque terre walkabout tours","comment":"One of the best tours we’ve ever done. Chris and Fabio were professional, knowledgeable and lots of fun. It’s a tough hike and a long day, but totally worth the money. If in Florence, don’t even think of another company. Fabulous day!","rating":5,"reviewer":"jim and millie","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3319552110","title":"Freezing","comment":"App freezes on my iPad when looking at reviews. Have to close app & restart every time!","rating":2,"reviewer":"Shootnshop","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3317329335","title":"This place was gud!!!","comment":"This place was really good and we had an awesome server named Mandy. 🤘🏾🤘🏾","rating":5,"reviewer":"Imjadenclark...","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3317270607","title":"This company is a crock!","comment":"I booked this company my winter vacation. I booked it in the summer so we get a good price $488.00 a night for a 4 bedroom. Literally two months I get an email stating the house was sold and the new owners are going to honor my contract...a couple days later I get another email stating I don’t have the house and I have to look for another one and they send me a link for a house that is 3000-4000 dollars! Stupid company. I am already contacting a lawyer for their part because I have all the emails. Everyone should just use American company not one that isn’t even in the United States. They don’t know how to do anything right.","rating":1,"reviewer":"Needs to give more coins!!!","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3316722650","title":"Andrew Morris House Bed & Breakfast","comment":"My husband and I enjoyed staying at this beautiful bed & breakfast thoroughly!!  We stayed in the Ragan room upstairs and it was awesome!  The breakfast was beyond delicious and hospitality was great. Would highly recommend!","rating":5,"reviewer":"Charlotte Weidner","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3314350908","title":"Use the desktop version","comment":"I really dislike this app.  I always end up using the desktop version tp get anything done.","rating":2,"reviewer":"gabrellaghh","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3313667319","title":"Was pretty good, but recent update busted","comment":"Broke ability to share trips! Key feature, please fix","rating":1,"reviewer":"tommi deez","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3313518769","title":"Grab a maitai at the Playa!","comment":"And let Hannah G. Set up your lounge and towel—great friendly and personal service!","rating":5,"reviewer":"Bulldoggeroo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3312714982","title":"Great time with Sunny Tours","comment":"Arranged the tour with Sunny. Promptly picked me up at hotel. Drove to Water town.\nExplained a lot about Shanghai and Water Town on the way and back to Shanghai. Had a great lunch at a nice Chinese establishment. The afternoon was spent taking me around Shanghai. Sunny was very flexible in tailoring my requests on what I wanted to see in Shanghai. I highly recommend her services when in Shanghai. \nHer English is very good.","rating":5,"reviewer":"michaelepeter","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3312420065","title":"Can’t Share Trips","comment":"I get error messages when sharing my trip with those I’m traveling with. Share via SMS, email or even the share link is broken. It used to work...please fix ASAP so we can plan our trip using TripAdvisor (as I used to do).","rating":1,"reviewer":"kimasabi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3309599499","title":"Mrs","comment":"Love trip advisor! Always right on at restaurants and hotels! When I have reviewed places they are every sure I don’t work their,   etc.","rating":5,"reviewer":"Zero JP","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3309452528","title":"Don’t leave home without it","comment":"For several years I’ve used this extensively in different parts of the world and found it indispensable. It’s easy to use and reliable. Whether it flights, tours, restaurants, or things to do I’ve never been let down. This is better than prescription drugs to help eliminate travel related frustrations.","rating":5,"reviewer":"Jas.P.","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3308835337","title":"Michael Blumer","comment":"We pick Dockers Inn because the people are always friendly and the rooms are always clean. Irena is the woman who does the breakfast and is sooooo friendly!!!! We love every time we come here we enjoy talking with her and her breakfast is kept fresh and hot! The ladies at the office are so sincere and take great care of all their guests. We enjoy Dockers Inn , it’s centrally located and we always stay here when we come. They will take good care of you when you stay and they have good prices on Silver Dollar City! A great little motel that treat you like family...","rating":4,"reviewer":"Michael Blumer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3305744275","title":"Sachenhausen Concentration Camp","comment":"My husband and I took Insider Tour of Sachenhausen Concentration Camp today. It is a must visit, especially if you have Walid as your tour guide. He was so knowledgeable, so attentive to our needs and gave us more time than the average tour allows. I had many questions and he couldn’t have been more accommodating and patient and made sure our questions were answered thoroughly. Thankyou Walid for everything!\nLynn and Al","rating":5,"reviewer":"Lynn and Al","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3304666683","title":"Feature no longer works","comment":"Adding items to a day of a trip no longer works. The app asks you to choose which day of a trip but presents a blank screen so it is impossible to choose one. This was working until recently.","rating":2,"reviewer":"Tim E. from NC","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3302733653","title":"Use this app to plan your trip!!","comment":"I always use this app when I start planning a trip.  I have done many cool things like whitewater rafting in Colorado , visiting a bear sanctuary near Yellowstone, a great bike ride in Acadia, etc & etc.  I’ve also been steered away from activities that were not a good “fit”.  I’m very happy to have this tool to help plan trips for my family.  These activities become memories that last a lifetime :)\nMy only request would be to have vegan and vegetarian selections under restaurant to better guide our dining options.\nLove the app!!!!","rating":5,"reviewer":"Lil horsegirl cuty","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3302435160","title":"Great Food, Great Bar, Great Service- Highly Recommend","comment":"Duke’s is a farm to table restaurant that sources their food from local farms.  Their chef runs a great kitchen and the restaurant is very clean.  \n\nThe menu is a mix of standard favorites and original dishes. \n\nThe beer menu is massive!\n\nIt’s VERY popular, so it can get crowded especially on the weekends.","rating":5,"reviewer":"fitlabcl.com","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3302209948","title":"Great Mix of Reviews","comment":"I use TripAdvisor whenever I’m planning a trip, going to a city I haven’t been to in a while to find new restaurants and places to visit, or just ideas on places around home.\n\nFinding the ‘best’ places, reading the reviews and participating is easy.\n\nWe’ve had some great experiences at places others have recommended and some not so great.\n\nRemembering everyone is different and learning how to interpret the reviews is important to making an educated decision on places.","rating":4,"reviewer":"skerry12","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3301891113","title":"5-star","comment":"One of the most important and reliable apps. I love it.","rating":5,"reviewer":"Eli-No","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3297259453","title":"Love Trip Advisor!","comment":"I love using Trip Advisor.  I find such useful information when planning our family vacations.  I can research hotels, restaurants, tours and other things to do.  The only problem I have with the app is that I cannot look at vacation rentals using the app.  I have to go to the website for that.  Being a family of six, we usually need to get a bigger place so would be convenient to have a tab for that.","rating":4,"reviewer":"Gatorvet92","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3295257752","title":"App and Website differences","comment":"The app is many ways easier to use and navigate than the Website, however, when writing reviews, the app lacks many tools to enhance a review with relevant information that the Website offers. It would be great that both tools would offer the same functionalities, so that the user has the same ease of use experience","rating":4,"reviewer":"Whishlist","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3292464321","title":"A great travel tool....","comment":"It’s the goto app for travel. \nEven for a stay-cation.\nWe've used the app almost exclusively since we first downloaded it. \nEspecially useful DURING a trip.","rating":5,"reviewer":"Longwire","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3290563419","title":"Great App!","comment":"I love this app, it’s come in handy many times during our trips. But my favorite part is actually reading all the app reviews from idiots rating their trip rather than the app.","rating":5,"reviewer":"Blahblahblog","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3289796901","title":"Chocolate Friends Coral Costa Caribe","comment":"Como huésped del Coral Costa Caribe he disfrutado noche tras noche del espectáculo de los Chocolate friends donde hemos viajado a través de sus interpretaciones y aprendido de diferentes culturas especial la de mi linda gente de Dominicana , no te puedes perder a Yara la reina de las maracas y a Francisco que con cada movimiento marca la perfección en las tablas. Mucho éxito mis Chocolate Friends!\nEric Fuentes San Juan Puerto Rico !!","rating":5,"reviewer":"daviiopr","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3288218266","title":"Broken","comment":"I’ve been trying to post something to the forums for the past 10 minutes and despite me being already logged in, I’m being asked to login again but when I do it freezes.","rating":1,"reviewer":"LilBattleship69","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3283850005","title":"Great but ideas for age groups","comment":"We use TA a lot - but sometimes I wonder about the demographics reviewing things. Maybe a way to filter age groups reviews? Ex: if I read a glowing review about a museum but realize the reviewer is 76yrs old and rates it completely different than a 30yr old would. A way to filter to an age group relatable to me...?","rating":4,"reviewer":"MellyMel1980","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3280115358","title":"Like to explore","comment":"I just tried to review a great little restaurant that was not on the Edgewood, New Mexico list. I am disappointed that I have to wait for you to verify it is a real place. I have pictures of the interior and food. Maybe you should allow the review, then confirm?","rating":5,"reviewer":"Shorewood Travler","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3275705707","title":"Use constantly when we travel","comment":"We always consult TripAdvisor for hotels, restaurants, and Things To Do.  Really helps to find good places, including many places we would not have either known about or otherwise considered. We check the ratings, then, read some reviews.  Almost never go wrong.","rating":5,"reviewer":"hatecreatingniknames","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3275674518","title":"A waste of time and money","comment":"Tour started late and our guide seemed more concerned with the parties that were missing than on the group that arrived on time ready to go. \nHave done some walking tours before and enjoyed learning some local history - but this was more than disappointing.","rating":1,"reviewer":"Cargo 58","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3275650548","title":"Walking your East Berlin","comment":"Fabulous walking tour with our guide Toby!\nSuper knowledgeable, fun, easy going. Toby s tour was the perfect mix of learning facts and seeing actual historic sites. One of the best tours we have done.","rating":5,"reviewer":"kericker","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3275204907","title":"Management center is terrible for business owners","comment":"Still cannot upload pictures from an iPhone 8 through the management center as a business representative. This is really terrible for business owners who want to best showcase their place in a convenient way. I shouldn’t have to import photos to a computer to do this simple task. Unacceptable!","rating":1,"reviewer":"rthinson","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3274556061","title":"Type of meal","comment":"I would like to sort the restaurants out by what meal I want to eat like breakfast, lunch or dinner but it shows all of them","rating":2,"reviewer":"toolman (Ocala)","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3271278099","title":"Latest update broke so much","comment":"Loved this app and use it for all my vacation planning and scheduling! However, the latest update makes it almost unusable: I can’t share trips, issues adding notes, issues adding an item to multiple days. Please fix it!","rating":1,"reviewer":"dilliwho","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3270552346","title":"Best all around guide for many countries.","comment":"As a general guide, TA is pretty good. We use it often, traveling to about 4-6 countries per year. We use it more for restaurants, however their hotel listings have improved in last few years. Best if you read the individual comments to glean the most about a location, (although some reviews are pretty lame-come on people-raise the bar!\nIf you understand the local language, switch the language over to it, as I think their restaurant reviews are better.","rating":4,"reviewer":"Gary Richard","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3269777699","title":"Error inviting friends to view","comment":"Doesn't let me share itineraries with friends - unexplained error whether I try SMS, email, or \"more\". This feature is the only reason I installed the app. I will delete it and use TripIt instead.","rating":1,"reviewer":"iPhoneMatt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3267092446","title":"Good travel app","comment":"I use it to organize different ideas for trips while I’m price shopping. I’m grateful for all the reviews because they help choose between multiple choices that may have recently had difficulties - rather than reading from reviews that are years old - before renovations, but outs, and staff turnover.","rating":4,"reviewer":"Reward Member","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3264598376","title":"When I travel outside the USA...","comment":"TripAdviser is my insider to help me find the best hotel based on my preferences.  It indispensable when traveling to unknown places.  Highly recommend.\nUsed it last month in Paris, Bruges, Brussels, and Vienna.\nDon’t go anywhere without their guidance and you will avoid mistakes.","rating":5,"reviewer":"Photos Now","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3263899982","title":"Big Bus Tour","comment":"Big Al was a joy on our recent tour. For promising not to overzealously fact check him, Big Al proceeded to enlighten us on the area and it’s history with plenty of color and humor.\nKim/Colleen","rating":5,"reviewer":"Kim/Colleen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3329087555","title":"Don’t use the app use a regular browser","comment":"The app re orders the establishments in a weird way!  I want number one to be first, 2 to be second ...","rating":4,"reviewer":"Bennett5","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3328800364","title":"Good but room to improve","comment":"Please fix the Trips functionality and features","rating":4,"reviewer":"Sharkus7","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3328542047","title":"City Tale Sightseeing & Private Tours New York City, New York","comment":"On Oct. 20, 2018 Debbie with a noon 9/11 tour. She was fun, gave excellent information. She gave the best private tour a person could expect. I can’t get say enough good about her. How can I get her again for more tours?","rating":5,"reviewer":"Wise Girls","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3327680904","title":"The best travel app","comment":"But how do you download offline city map for iphone? Specific directions in Help would be my only suggestion for improvement,","rating":4,"reviewer":"Loveinfo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3327231884","title":"Homewood Suites by Hilton Savannah, Ga","comment":"All of the staff was friendly and eager to help, but I wanted to give special attention to Ms Pat on the breakfast crew who went above and beyond to bring me salsa for my eggs every morning.   \nAlso, the rooftop manager had good music line up for entertainment.","rating":4,"reviewer":"10021932","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3326946641","title":"Vini Da Grigio Venice,Italy","comment":"Very poor and insulting performance. I had a reservation for 7:00. When I arrived there was only one table filled. I was offered one table in the corner of a bare back room. When I asked for a table in the main room the answer was NO !! This is no way to treat customers !!","rating":1,"reviewer":"PL New York","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3325092898","title":"5 star app until recent update","comment":"Recent update was not tested. App locks up when going through reviews and you can’t get out of reviews except look at more.  Only way to get out is force close app and restart.","rating":2,"reviewer":"capt996","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3323271654","title":"Sharing is broken","comment":"We use the app all the time. \nThe share your trip feature is broken. There are errors for SMS, get the link, and More. And using email appears to work, at least no error message. But no email actually arrives to anyone sent to. \nPlease fix..\nAnd the desktop version doesn’t have a share feature :-(","rating":3,"reviewer":"Carlotta111","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3323163775","title":"Great stay in DC at Days Inn","comment":"Days Inn on Connecticut Avenue was perfect for my needs in recent business trip. Great value with spacious room, ample desk, in-room coffee, mini-fridge & microwave, extremely helpful staff, safe & well-lit parking (also reasonably priced,) only 2 blocks from subway, nice restaurants & also fast food options. Best thing was Soapstone Market across the street, a combination casual restaurant serving B,L,D as well as happy hour, but also market items if you didn’t want to eat out. I will definitely stay there again.","rating":4,"reviewer":"123elaine","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3321043640","title":"Urban Adventures Walking Tour","comment":"I booked this Walking Tour of Prague. I will be here for 10 days, and wanted to get an overview. This, my first tour, was more than I could have hoped for. Our guide Sasha was knowledgeable, informative and very interactive. He addressed all of our queries, and had a wonderful sense of humor. Our group bonded. It was a perfect Prague day.","rating":5,"reviewer":"Naime joy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3320480225","title":"Best tour ever","comment":"Haim, goes way above his work\n. We just had an amazing trip to Jerusalem, thanks to him. \n\nVery professional and excellent knowledge of the history, past and present of this city. \nHighly recommended.","rating":5,"reviewer":"HaimToGo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3319731242","title":"Cinque terre walkabout tours","comment":"One of the best tours we’ve ever done. Chris and Fabio were professional, knowledgeable and lots of fun. It’s a tough hike and a long day, but totally worth the money. If in Florence, don’t even think of another company. Fabulous day!","rating":5,"reviewer":"jim and millie","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3319552110","title":"Freezing","comment":"App freezes on my iPad when looking at reviews. Have to close app & restart every time!","rating":2,"reviewer":"Shootnshop","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3317329335","title":"This place was gud!!!","comment":"This place was really good and we had an awesome server named Mandy. 🤘🏾🤘🏾","rating":5,"reviewer":"Imjadenclark...","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3317270607","title":"This company is a crock!","comment":"I booked this company my winter vacation. I booked it in the summer so we get a good price $488.00 a night for a 4 bedroom. Literally two months I get an email stating the house was sold and the new owners are going to honor my contract...a couple days later I get another email stating I don’t have the house and I have to look for another one and they send me a link for a house that is 3000-4000 dollars! Stupid company. I am already contacting a lawyer for their part because I have all the emails. Everyone should just use American company not one that isn’t even in the United States. They don’t know how to do anything right.","rating":1,"reviewer":"Needs to give more coins!!!","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3316722650","title":"Andrew Morris House Bed & Breakfast","comment":"My husband and I enjoyed staying at this beautiful bed & breakfast thoroughly!!  We stayed in the Ragan room upstairs and it was awesome!  The breakfast was beyond delicious and hospitality was great. Would highly recommend!","rating":5,"reviewer":"Charlotte Weidner","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3314350908","title":"Use the desktop version","comment":"I really dislike this app.  I always end up using the desktop version tp get anything done.","rating":2,"reviewer":"gabrellaghh","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3313667319","title":"Was pretty good, but recent update busted","comment":"Broke ability to share trips! Key feature, please fix","rating":1,"reviewer":"tommi deez","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3313518769","title":"Grab a maitai at the Playa!","comment":"And let Hannah G. Set up your lounge and towel—great friendly and personal service!","rating":5,"reviewer":"Bulldoggeroo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3312714982","title":"Great time with Sunny Tours","comment":"Arranged the tour with Sunny. Promptly picked me up at hotel. Drove to Water town.\nExplained a lot about Shanghai and Water Town on the way and back to Shanghai. Had a great lunch at a nice Chinese establishment. The afternoon was spent taking me around Shanghai. Sunny was very flexible in tailoring my requests on what I wanted to see in Shanghai. I highly recommend her services when in Shanghai. \nHer English is very good.","rating":5,"reviewer":"michaelepeter","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3312420065","title":"Can’t Share Trips","comment":"I get error messages when sharing my trip with those I’m traveling with. Share via SMS, email or even the share link is broken. It used to work...please fix ASAP so we can plan our trip using TripAdvisor (as I used to do).","rating":1,"reviewer":"kimasabi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3309599499","title":"Mrs","comment":"Love trip advisor! Always right on at restaurants and hotels! When I have reviewed places they are every sure I don’t work their,   etc.","rating":5,"reviewer":"Zero JP","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3309452528","title":"Don’t leave home without it","comment":"For several years I’ve used this extensively in different parts of the world and found it indispensable. It’s easy to use and reliable. Whether it flights, tours, restaurants, or things to do I’ve never been let down. This is better than prescription drugs to help eliminate travel related frustrations.","rating":5,"reviewer":"Jas.P.","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3308835337","title":"Michael Blumer","comment":"We pick Dockers Inn because the people are always friendly and the rooms are always clean. Irena is the woman who does the breakfast and is sooooo friendly!!!! We love every time we come here we enjoy talking with her and her breakfast is kept fresh and hot! The ladies at the office are so sincere and take great care of all their guests. We enjoy Dockers Inn , it’s centrally located and we always stay here when we come. They will take good care of you when you stay and they have good prices on Silver Dollar City! A great little motel that treat you like family...","rating":4,"reviewer":"Michael Blumer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3305744275","title":"Sachenhausen Concentration Camp","comment":"My husband and I took Insider Tour of Sachenhausen Concentration Camp today. It is a must visit, especially if you have Walid as your tour guide. He was so knowledgeable, so attentive to our needs and gave us more time than the average tour allows. I had many questions and he couldn’t have been more accommodating and patient and made sure our questions were answered thoroughly. Thankyou Walid for everything!\nLynn and Al","rating":5,"reviewer":"Lynn and Al","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3304666683","title":"Feature no longer works","comment":"Adding items to a day of a trip no longer works. The app asks you to choose which day of a trip but presents a blank screen so it is impossible to choose one. This was working until recently.","rating":2,"reviewer":"Tim E. from NC","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3302733653","title":"Use this app to plan your trip!!","comment":"I always use this app when I start planning a trip.  I have done many cool things like whitewater rafting in Colorado , visiting a bear sanctuary near Yellowstone, a great bike ride in Acadia, etc & etc.  I’ve also been steered away from activities that were not a good “fit”.  I’m very happy to have this tool to help plan trips for my family.  These activities become memories that last a lifetime :)\nMy only request would be to have vegan and vegetarian selections under restaurant to better guide our dining options.\nLove the app!!!!","rating":5,"reviewer":"Lil horsegirl cuty","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3302435160","title":"Great Food, Great Bar, Great Service- Highly Recommend","comment":"Duke’s is a farm to table restaurant that sources their food from local farms.  Their chef runs a great kitchen and the restaurant is very clean.  \n\nThe menu is a mix of standard favorites and original dishes. \n\nThe beer menu is massive!\n\nIt’s VERY popular, so it can get crowded especially on the weekends.","rating":5,"reviewer":"fitlabcl.com","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3302209948","title":"Great Mix of Reviews","comment":"I use TripAdvisor whenever I’m planning a trip, going to a city I haven’t been to in a while to find new restaurants and places to visit, or just ideas on places around home.\n\nFinding the ‘best’ places, reading the reviews and participating is easy.\n\nWe’ve had some great experiences at places others have recommended and some not so great.\n\nRemembering everyone is different and learning how to interpret the reviews is important to making an educated decision on places.","rating":4,"reviewer":"skerry12","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3301891113","title":"5-star","comment":"One of the most important and reliable apps. I love it.","rating":5,"reviewer":"Eli-No","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3297259453","title":"Love Trip Advisor!","comment":"I love using Trip Advisor.  I find such useful information when planning our family vacations.  I can research hotels, restaurants, tours and other things to do.  The only problem I have with the app is that I cannot look at vacation rentals using the app.  I have to go to the website for that.  Being a family of six, we usually need to get a bigger place so would be convenient to have a tab for that.","rating":4,"reviewer":"Gatorvet92","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3295257752","title":"App and Website differences","comment":"The app is many ways easier to use and navigate than the Website, however, when writing reviews, the app lacks many tools to enhance a review with relevant information that the Website offers. It would be great that both tools would offer the same functionalities, so that the user has the same ease of use experience","rating":4,"reviewer":"Whishlist","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3292464321","title":"A great travel tool....","comment":"It’s the goto app for travel. \nEven for a stay-cation.\nWe've used the app almost exclusively since we first downloaded it. \nEspecially useful DURING a trip.","rating":5,"reviewer":"Longwire","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3290563419","title":"Great App!","comment":"I love this app, it’s come in handy many times during our trips. But my favorite part is actually reading all the app reviews from idiots rating their trip rather than the app.","rating":5,"reviewer":"Blahblahblog","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3289796901","title":"Chocolate Friends Coral Costa Caribe","comment":"Como huésped del Coral Costa Caribe he disfrutado noche tras noche del espectáculo de los Chocolate friends donde hemos viajado a través de sus interpretaciones y aprendido de diferentes culturas especial la de mi linda gente de Dominicana , no te puedes perder a Yara la reina de las maracas y a Francisco que con cada movimiento marca la perfección en las tablas. Mucho éxito mis Chocolate Friends!\nEric Fuentes San Juan Puerto Rico !!","rating":5,"reviewer":"daviiopr","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3288218266","title":"Broken","comment":"I’ve been trying to post something to the forums for the past 10 minutes and despite me being already logged in, I’m being asked to login again but when I do it freezes.","rating":1,"reviewer":"LilBattleship69","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3283850005","title":"Great but ideas for age groups","comment":"We use TA a lot - but sometimes I wonder about the demographics reviewing things. Maybe a way to filter age groups reviews? Ex: if I read a glowing review about a museum but realize the reviewer is 76yrs old and rates it completely different than a 30yr old would. A way to filter to an age group relatable to me...?","rating":4,"reviewer":"MellyMel1980","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3280115358","title":"Like to explore","comment":"I just tried to review a great little restaurant that was not on the Edgewood, New Mexico list. I am disappointed that I have to wait for you to verify it is a real place. I have pictures of the interior and food. Maybe you should allow the review, then confirm?","rating":5,"reviewer":"Shorewood Travler","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3275705707","title":"Use constantly when we travel","comment":"We always consult TripAdvisor for hotels, restaurants, and Things To Do.  Really helps to find good places, including many places we would not have either known about or otherwise considered. We check the ratings, then, read some reviews.  Almost never go wrong.","rating":5,"reviewer":"hatecreatingniknames","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3275674518","title":"A waste of time and money","comment":"Tour started late and our guide seemed more concerned with the parties that were missing than on the group that arrived on time ready to go. \nHave done some walking tours before and enjoyed learning some local history - but this was more than disappointing.","rating":1,"reviewer":"Cargo 58","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3275650548","title":"Walking your East Berlin","comment":"Fabulous walking tour with our guide Toby!\nSuper knowledgeable, fun, easy going. Toby s tour was the perfect mix of learning facts and seeing actual historic sites. One of the best tours we have done.","rating":5,"reviewer":"kericker","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3275204907","title":"Management center is terrible for business owners","comment":"Still cannot upload pictures from an iPhone 8 through the management center as a business representative. This is really terrible for business owners who want to best showcase their place in a convenient way. I shouldn’t have to import photos to a computer to do this simple task. Unacceptable!","rating":1,"reviewer":"rthinson","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3274556061","title":"Type of meal","comment":"I would like to sort the restaurants out by what meal I want to eat like breakfast, lunch or dinner but it shows all of them","rating":2,"reviewer":"toolman (Ocala)","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3271278099","title":"Latest update broke so much","comment":"Loved this app and use it for all my vacation planning and scheduling! However, the latest update makes it almost unusable: I can’t share trips, issues adding notes, issues adding an item to multiple days. Please fix it!","rating":1,"reviewer":"dilliwho","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3270552346","title":"Best all around guide for many countries.","comment":"As a general guide, TA is pretty good. We use it often, traveling to about 4-6 countries per year. We use it more for restaurants, however their hotel listings have improved in last few years. Best if you read the individual comments to glean the most about a location, (although some reviews are pretty lame-come on people-raise the bar!\nIf you understand the local language, switch the language over to it, as I think their restaurant reviews are better.","rating":4,"reviewer":"Gary Richard","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3269777699","title":"Error inviting friends to view","comment":"Doesn't let me share itineraries with friends - unexplained error whether I try SMS, email, or \"more\". This feature is the only reason I installed the app. I will delete it and use TripIt instead.","rating":1,"reviewer":"iPhoneMatt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3267092446","title":"Good travel app","comment":"I use it to organize different ideas for trips while I’m price shopping. I’m grateful for all the reviews because they help choose between multiple choices that may have recently had difficulties - rather than reading from reviews that are years old - before renovations, but outs, and staff turnover.","rating":4,"reviewer":"Reward Member","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3264598376","title":"When I travel outside the USA...","comment":"TripAdviser is my insider to help me find the best hotel based on my preferences.  It indispensable when traveling to unknown places.  Highly recommend.\nUsed it last month in Paris, Bruges, Brussels, and Vienna.\nDon’t go anywhere without their guidance and you will avoid mistakes.","rating":5,"reviewer":"Photos Now","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3263899982","title":"Big Bus Tour","comment":"Big Al was a joy on our recent tour. For promising not to overzealously fact check him, Big Al proceeded to enlighten us on the area and it’s history with plenty of color and humor.\nKim/Colleen","rating":5,"reviewer":"Kim/Colleen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3262367351","title":"Love the app but has bugs, please fix !","comment":"When I try to add activities to a day on my trip it lets me select the activity then asks which day, and the which day screen is blank. It won’t show any days and only has the cancel button.","rating":3,"reviewer":"SMDSMD89","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3259846583","title":"Where can I see a map view of my reviews?","comment":"I know that there’s a way to see saved trips on a map, but is there a way to see my own reviews on a map view? I’ve written >400 reviews for Trip Advisor, and it’s frustratingly hard to look at my own reviews, even though the global community gets to use them for free. I tried to get in contact with Trip Advisor for them to answer my question, but each “Contact Us” button takes you to an FAQ - that’s NOT contacting you. 1 star until I finally get someone from Trip Advisor to respond.","rating":1,"reviewer":"Koendit88","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3258855780","title":"Easy to use","comment":"Great app. We use it everywhere from Italy to find new restaurants in our own city","rating":5,"reviewer":"tc buckeye","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3257410804","title":"The Best","comment":"You are reading reviews from fellow travelers who have been there—the good, the bad, and the why did I go there in the first place.  TA is what Lonely Planet used to be: honest and good research resource to look at and plan before you go.","rating":5,"reviewer":"Jame84115","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3257222437","title":"I am married to this APP.","comment":"I always check when traveling to new areas. Receiving \nInformation ahead of arrival for points of interest saves time.\nI am a contributor to Trip Advisor on all my travels. I want to help others gain needed information to make their travels more meaningful.","rating":5,"reviewer":"kiukool","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3256618233","title":"My go-to for finding restaurants","comment":"I use this app all the time for finding a good place to eat near where I'm staying when I travel.  As long as there are a sufficient number of reviews, I always feel confident in the given information.","rating":5,"reviewer":"Ben P 55","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3245854887","title":"Hop On Hop Off. Philadelphia, PA","comment":"Great overview of the city. Rode the entire tour first and then selected the places we wanted to get off and experience more. The only thing that was problematic was the height of the bus. It was difficult to get in and out of without a step stool, which was not available. The stairs to the top were also very challenging. Drivers and tour guides were great.","rating":4,"reviewer":"Treasure Travel","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3244163534","title":"Hyper-useful and generally reliable","comment":"Terrific how it offers free, easy access to opinions of so many travelers from around the world re lodgings, restaurants and activities virtually everywhere on the planet. Only downside is inaccessibility in remote areas where WiFi is non-existent.","rating":5,"reviewer":"Don Lipmanson","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3237698205","title":"All we needed!","comment":"Trip advisor made our trip to Colorado, Wyoming. And Montana more than we could imagine- we found festivals and off the beaten track beauty and wild animals we never would have found on our own!  We were even able to find a picnic table behind a store where we ate our lunch one day!  Thank you so much!","rating":5,"reviewer":"babymoosr","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3237211236","title":"Traveller","comment":"It’s perfectly app explain you what ever need about traveling and visiting any country around the world","rating":5,"reviewer":"Traveller_2015","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3237205368","title":"No map view","comment":"Only marginally useful without a map view or an easy way to filter based off an exact location, especially when in a large city. Unless I am missing something...","rating":2,"reviewer":"Wamcandrew","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3236966011","title":"No Way to Contact Trip Advisor Customer Service","comment":"If you find an issue or have trouble with a booking on Trip Advisor there is no way to contact customer service.  Also beware - not all negative reviews get posted.","rating":1,"reviewer":"WI Business Traveler","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3236566406","title":"Cannot invite anymore","comment":"Please fix","rating":2,"reviewer":"Kayleee2012","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3230605391","title":"Better to Give than to Receive","comment":"Trip Advisor provides a wealth of useful, easily accessed information.  It has been skillfully designed and serves not only its primary purpose of being one of the best sources of travel information but also an excellent example of the potential of what can be achieved when humans contribute unselfishly and collaborate.   Everyone wins AND it’s fun !\nCheers to T.A. Developers and staff.","rating":5,"reviewer":"Globalpaddler","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3230188010","title":"Why not offer incentives for people to write reviews","comment":"I’m all about reading reviews but often forget to write my own.  Why don’t you offer incentives or gifts to reviewers?  Gift cards, luggage tags, luggage,  toiletry cases,  etc.  it would certainly give me a bigger incentive to post a review.","rating":3,"reviewer":"Laurie.66","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3229123172","title":"Fix the share buttons","comment":"How am I supposed to share this w my family members when none of the share features work? Get on the ball and make this app what it should be.","rating":1,"reviewer":"Criickete","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3228845603","title":"Lord Baltimore Hotel","comment":"Great value for location \nBakery is terrific","rating":5,"reviewer":"Ben Klingston","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3227342824","title":"Herodian Hotel, Athens, Greece","comment":"A pure pleasure of beauty, accommodations, courtesy and a really perfect Athenian location. Almost every beautiful site is in walking distance from the Herodian Hotel. One of our favorite hotels ever!","rating":5,"reviewer":"SheByte","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3227079028","title":"Agoda.com travel","comment":"Do not trust or use Agoda they will book u tell u they didn’t charge u even though u see t on ur bank statement u can never speak to a live person because they will lie and never call and the number they give u is in Singapore or Bangkok I tried to instantly cancel because of a med reason personally called the hotel in Greece  6 times to cancel hung up on me 6 times wouldn’t let me for three months now they tell me ok we do have ur money over 60 e mails later I sent them many times doctors cert as they requested called hotel from bank never returned call Agoda plays games lied and never gets anything resolved or does what they say almost 4 months later I still have no money they are so dishonest","rating":1,"reviewer":"Agoda is dishonest","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3226120736","title":"City Sightseeing Hop-on Hop-off Palma Majorca","comment":"I recently booked City Sightseeing hop on hop off for our trip to Palma Majorca on Sept 22, 2018. Even though we paid for our tickets in advance, we had to join the same long line (at the port stop) as those buying tickets. They did not have a separate line for preparing d passengers to go on the bus. At least two overcrowded buses came before we were able to get on. \nThe two attendants at the bus stop were rude and did not answer our questions. The bus driver did not notify us that services for the Bellver Castle stop would end at 3:30pm due to a Marathon. Other passengers were left stranded even though at the stop prior to 3:30pm. We ended up walking approx 300 cobblestone steps to get down the hill. \nIt was a total waste of money, not to mention the inconvenience, since we could not take advantage of the hop on hop off bus services and the rather infrequent schedule. This service is a joke!","rating":1,"reviewer":"lovegod@gmail","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3225448815","title":"We don't leave home without it.","comment":"For the past two three plus years Trip Advisor has guided us infallibly to the best restaurants and hotels in cities and towns big and small all across the country.  One example of technology that works.","rating":5,"reviewer":"RGFAE8","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3225326754","title":"Disturbing news","comment":"I’ve been using & rating restaurants & hotels for years at Trip Advisor.  After learning that it’s possible to game your system, I feel I can no longer trust the reviews.  After I post this, I’m unsubscribing & removing the app from my phone.","rating":2,"reviewer":"steve in Moline","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3224703015","title":"Pompeii And Vesuvius small group hotel pickup","comment":"Annalisa was our guide for the day.\nWe were picked up at our hotel on time. She did a good job with the history of Pompeii as we walked around to the designated sights.\nAt Mt. Vesuvius we had 1 1/2 hr to make the climb, wine or lemonchello \nWas available at the top, wish we would have take the time to celebrate the accomplishment definitely on our bucket list.\nLunch included two slices of pizza with water, which was just right for that bit of energy needed for the climb up Vesuvius.","rating":4,"reviewer":"Mary frm CA","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3223352424","title":"The best!","comment":"I’ve used this app for years now and find it the most user friendly, and honest, travel app available!","rating":5,"reviewer":"Babysteps7","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3222893846","title":"Holy Smoke (Keystone, SD)","comment":"We just spent 5 nights in one of the cabins! Our whole trip was wonderful. These cabins are very nice & rustic. So close to Mount Rushmore but the setting was among the pine trees and very peaceful & quiet! We felt fortunate to be close but also seemed far away. The only drawback for us was that the WiFi did not cooperate. But, we had lots to do and see so it really wasn’t a problem for us.","rating":4,"reviewer":"lorispurt","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3222741798","title":"El Escorial and the Valley of the Fallen","comment":"Everyone was nice enough and the tour guide tried, however having 2 languages spoken is something I will never do again. There were only 10 non Spanish speaking and 23 Spanish speakers. Our guide tried to translate but did not command English and thus did not learn very much from him. Questions and jokes were all in Spanish. My suggestion is go with a company that only speaks your language, you’ll get the most out of your tour.  Booked through Viator.","rating":2,"reviewer":"fuquacuen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3222112989","title":"What have you done?!","comment":"What have you done to the TripAdvisor App??!! It used to be awesome. Now I am going to delete and use something else. It is so un-user friendly that it's a joke!! I can't believe you think this so-called app is better!! I have been using for years and it WAS awesome. Ugh!","rating":1,"reviewer":"LindaSoMinnesota","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3221924112","title":"Sharing Bug","comment":"This app would be great for trip planning but right now none of the sharing functionality works making it rather useless.","rating":2,"reviewer":"lalil31","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3221237756","title":"I am looking for an alternative site","comment":"I use TripAdvisor for many years. It used to be a good site and app\nNow they push commercial tours and it is impossible to find original contents: grass roots information about most interesting things to do and self guided tours. I am not interested in expensive private tours of things we can see ourselves for free.","rating":1,"reviewer":"anna y a","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3220889893","title":"Our Go To App","comment":"We use Trip Adviser everywhere we go for restaurants and things to do. I can’t think of a time it has steered us wrong. We are always finding new restaurants even locally that we enjoy.","rating":5,"reviewer":"Hunty-Punty","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3220080047","title":"Nice little gem","comment":"Had dinner here with my tour group. Excellent food. Have the mussels. They are the best I’ve ever had. Great service. Fabulous food and ambience. And it was walking distance from our hotel.  👍🏻","rating":5,"reviewer":"Frenchxs","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3219882714","title":"Spring restaurant","comment":"Chef Vijay and chef Rajinder at spring restaurant were very courteous and fantastic.. very good food and services.. manager Sanjay Rawat very humble...keep it up","rating":5,"reviewer":"spring restaurant","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3218729782","title":"Good intro tour. Excellent guide.","comment":"Great way to step into Prague. Guide was a local woman. Knew her history. Friendly. Flexible. Easy walk.","rating":5,"reviewer":"Bob from Tahoe","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3217818369","title":"Highlight of Costa Rica","comment":"Loved the Lazy Lizard sunset cruise!  #Aplus fantastic music, beautiful sunset, great crew. Erick, Luis, Jesus were a blast and made the experience awesome. Highly recommend for all ages.","rating":5,"reviewer":"lazy lizard fans","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3217353366","title":"This app is a god send.","comment":"This app helped us make our European trip wonderful and found great spots to find here. I highly recommend using this app to research places and activities. I also use it for our many cruise destinations, and looking for hotels, and activities on road trips.","rating":5,"reviewer":"Emo9454","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3216959217","title":"Terrific resource","comment":"Thank you for being an authentic source of info.","rating":5,"reviewer":"kristinemills","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3216157160","title":"Walking Tours en Córdoba","comment":"El recorrido muy interesante. La diferencia en positivo la hacen los guías como Rafael (Córdoba Monumental) y David (en el sorprendente tour nocturno).\nResalta la pasión y energía que ellos ponen en su trabajo, valen 5 estrellas.","rating":5,"reviewer":"Niclaus55","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3215068616","title":"Love it!","comment":"I basically downloaded this app for the reviews. I have not been disappointed! You can ask questions, and they will get answered. It's never taken too long! \nI've even found some old friends, who enjoy traveling, also.\nThanks, TripAdvisor!","rating":5,"reviewer":"Cockeycowboy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3214896180","title":"Taliesin West","comment":"The tour was educational, interesting and detailed. Both inside rooms and the grounds were included in the 90-minute tour. Our guide was knowledgeable and communicated information at an appropriate level. Our tour group included some persons who had visited other Frank Lloyd Wright buildings & others for whom this was their first exposure - our guide bridged the knowledge gap. Enough time was provided so we could carefully look at different aspects of an area. Extra credit is given for tour planning because the guide led us to shady spots for outside portions & arranged for sitting in inside areas. Thanks!","rating":5,"reviewer":"Fonron","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3212694378","title":"Good but iPhone interface is cluttered.","comment":"The app is good but the iPhone interface has so many touch points that it’s hard to navigate.","rating":3,"reviewer":"Monapainter","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3210583526","title":"Atlantis, Bahamas !! Great people","comment":"I just had the first vaca In 10 years at Atlantis!! Donavan at the front whenwe cheeked In was fabulous ! Got a great room and all we needed so the trip started out wonderful and Aleeyah was the best she figured out everything and made sure our stay was the best. Any issues they worked hard to correct and double checked on everything -just Fabulous !!!","rating":5,"reviewer":"Pasha2015","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3210098414","title":"Love Trip Advisor","comment":"I use trip advisor all the time to check out places before I make reservations. It’s so helpful.\nI got sick in a foreign country when I went to see my grandson and I didn’t want to get them sick. \nTrip advisor found me a great place to recuperate for 5 days and then I went to stay with them as planned. Being sick I didn’t want to end up in a dive and try and find a new hotel. The place was exactly as described. Small ,family oriented hotel,with breakfast daily, they let my other daughter bring me food to the room.\nWithout Trip Advisor I wouldn’t have known this place ever existed.\nHave confidence where you’re staying by using this app.","rating":5,"reviewer":"moms2cool","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3207722752","title":"Love the app","comment":"Love the trip advisor app, I have been around the world and I use it everywhere I go, always accurate and easy to use. Thank you guys","rating":5,"reviewer":"Stas Mironenko","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3207640085","title":"Chicago neighborhoods","comment":"Although I think the listings for Chicago in general is great. There is no ability to quickly explore the near north neighborhoods (Andersonville, edgewater, Lincoln square, Rogers park etc)","rating":4,"reviewer":"Raylab","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3204891669","title":"Arctic Circle and Northern Lights Tour from Fairbanks AK","comment":"Tour on 9/17/18\n\nPer comments/reviews on TripAdvisor, I booked this Arctic Circle and Northern Lights Tour from Fairbanks, Alaska about 2 weeks in advance (with Alaska Wildlife Guide LLC via Viator, costs: $225 per person).\n\nA few days prior to the trip, I called Alaska Wildlife to confirm (required) and to request Vegeterian meals for my husband and me.  No real person answered phones.  I left 3 messages, without anyone returning calls.\nI was worried since we had paid in full ($450) when booked (required).\n\nThe 4th time I called, a lady who answered my phone said that she could not retrieve my messages because her boss didn’t give her the password (?).\n\nPS:  the lack of communication is the reason I only give this trip 4 stars.\n\nFor this 14 hours tour, we were picked up at our hotel at 10:15am promptly, by Dave.  He was the driver and tour guide.\n\nThis is a small group.  We travel in an 8 Passengers van.  The van was ok but due to the road construction/condition and since my husband and I sat at the very last seats, our bodies were “rocked and rolled” 😜😛\n\nDave was very good.  He drove very carefully.  He had good experience and knowledge about related things and places.\n\nDuring the trip, Dave explained and/or talked about the local nature, animals and geography where we were going to, the Arctic Circle and Northern Lights.\n\nOne of our stops was the Big Pipelines.   It’s huge!  Amazing!  \n\nWe made it!  We arrived the Arctic Circle at about 8pm.  What’s a good feeling!  \n\nThe excitement of dreams coming true is beyond the description of words!\n\nAt 8PM, we still had enough sun light and plenty of time for photos and to enjoy the fresh air.  And of course, Dave helped everyone of us to take photos.  Thanks Dave for always doing extra things to make everyone happy.\n\nOn the way back to Fairbanks, we stopped at a few places to see the Northern Lights.\n\nIt was cloudy so the Aurora wasn’t very strong as we expected but we were happy enough to see some.\n\nWe knew that it was up to the Mother Nature.  It was not anyone fault 😜\n\nOverall, we’re so pleased with this tour.\n\nThank you Dave very much for his kindness and extra efforts.  We’re so glad you’re our driver and tourguide! \n\nI highly recommend Dave and this tour with my friends and family as well as everyone who would like to have this tour.  You will love it!","rating":4,"reviewer":"Arctic Circle Lovers","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3204423350","title":"My go to for travel and trip planning","comment":"I have been a member of Trip Advisor since 2004 and it has always been my go to when I need travel and trip information. It has helped me find many hidden jewels and has never guided me wrong in accommodations. If you are looking for a good place to find all the information and advice you could need for your trips this would be the app I would recommend.","rating":5,"reviewer":"smkymtnlover","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3203627499","title":"Gabriela Leon, server at Dreams Playa Mujeres,Cancun,Mexico","comment":"5 Star rating 🌺","rating":5,"reviewer":"Kikiadorabella","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3201082413","title":"W","comment":"It a good app I like it","rating":4,"reviewer":"basmaes","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3200904979","title":"Not for iPad","comment":"I love the app on my iPhone, but not the iPad version. Can’t see any details, only the summary, pics and reviews... not sure how that’s helpful when the renter doesn’t list out every amenity in the description.","rating":3,"reviewer":"anniedee83","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3200145468","title":"Mariners Taverna Tolo Greece","comment":"We met Nick at the beach pounding a freshly caught octopus.  He invited us to the taverna and we ate the freshest most well prepared octopus we’ve ever eaten!  That and prawns in a creme sauce and a grilled snapper that was  tasty and delicate.  One of the culinary highlights of our Greek travels...","rating":5,"reviewer":"acpaine","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3199639810","title":"With Locals Best of London Tour with Tom","comment":"We were thrilled with Tom's tour of the Best of London. He is the\nultimate storyteller, weaving tales of London's fascinating and\nsomewhat sordid history. He spent extra time with us to bring us to\nhis favorite fish and chips restaurant. He also gave us\nrecommendations for additional sightseeing spots. Love love love\nTom!!! Cheers!","rating":5,"reviewer":"Dr. Chili Queen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3199485956","title":"Love it but.......","comment":"This app is always my first stop when deciding on a new restaurant, activity or hotel. And I’m a faithful reviewer. But where in all the links - including FAQ, Contact Us and Support - does one get a real opportunity to ask a specific question, not a generic choice?  I have reviewed dozens of restaurants and activities on Hilton Head Island - and according to the search location option this area does not exist. I cannot look up any past reviews although there was no problem writing them. So please answer these 2 questions:\nHow do I access my past reviews for Hilton Head?\nHow does one address specific questions that will actually get answered?\nThank you!!!\nBunnyyoop","rating":4,"reviewer":"Bunnyyoop","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3199404858","title":"Honeymoon","comment":"TripAdvisor helped my Husband and I plan our entire honeymoon! It was so nice knowing what was around us, how much it cost to get into certain events or museums. We are already using the app to help us plan our next trip!","rating":5,"reviewer":"MeekGaff","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3198693463","title":"Hyatt Regency Jersey City","comment":"The worst bed and pillow I have experienced ever! If you are looking for a good night’s sleep not only won’t you have that, but also have a backache the next day.","rating":1,"reviewer":"szimmers","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3198278478","title":"Trouble submitting reviews","comment":"iPad 4, iOS 11.. app will not let me submit review, no error code only keeps asking me to agree to policy, when I click cancel, the app stalls.","rating":3,"reviewer":"Danyboy007","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3197733725","title":"Reviews by unknowledgeable and/or pretentious foodies.","comment":"Why would you rely on anyone you don’t know to tell you how good a restaurant is in a foreign country. When I read a review of a restaurant I know well in Florence, a review which said it wasn’t a “real Italian” restaurant because it didn’t have veal parmigiana, it sort of summed up what the problems are.","rating":1,"reviewer":"seraglie","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3197546089","title":"No longer. - Excellent app and site","comment":"I have used TA forever! Unfortunately, the app drives me nuts! Does anyone else find that while scrolling through pics and they haven’t loaded all the way the roll starts from the beginning?! Alternatively, when you click “see all” say underneath a hotels room pics you don’t see all room pics but instead “see all” the hotel’s pics loaded period. Pretty frustrating when I’d like to look at only room pics or whatever. I’ve deleted the app before because of this but apparently it hasn’t bothered anyone else. TripAdvisor: I want to see pics in order of submission. New first. A hotel pic in 2005 or 2012 is irrelevant. Kept those at the bottom. Some places remodel/renovate. I don’t want old mixed with the recent.","rating":2,"reviewer":"JAKAG06","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3197326404","title":"A Must For Everyone","comment":"Retired about a year ago and it was a very important tool to book travel, find great restaurants and things to do. Ratings were accurate! Since retirement I still use it and find it equally useful. So user friendly! Try it!","rating":5,"reviewer":"geno8483","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3197302729","title":"Worst service ever!!!!","comment":"Stopped in Brooklyn’s restaurant south of Mile High Stadium in Denver to watch the second half of the Bronco game. Been sitting here 30 minutes and every table around us has wait people but we haven’t been helped. Take that back, my husband went to the bar and got us drinks. Worst ever, and we’re starving.","rating":1,"reviewer":"Reg2bears","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3197177704","title":"Tripadvisor Rocks !!!","comment":"Nothing on travel without TripAdvisor consult ..","rating":5,"reviewer":"RiteshMittal","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3196594150","title":"Missing features","comment":"This app is built for travelers, and yet it doesn't include access to your inbox. You have to go to the full website to read private messages, which isn't always possible for people on the road.","rating":1,"reviewer":"Comedy and Circuses","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3196418091","title":"Use app for all travel- change in search tool= 4","comment":"I love Trip Advisor and have used it for years both reading and posting reviews.  Have not planned a trip without it for many years.  My only issue is changes to the search engine.  It is less user friendly as it wants to default to the last location, often when I do not.  Would still give a 4.5 if that were an option.","rating":4,"reviewer":"LisaSays","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3196379440","title":"Rude Bar","comment":"We were guests for just an evening at this Hilton. It is an attractive, new, clean and spacious place. The desk staff was polite but not cordial. Our issue was the bar tender. We sat for twenty minutes and were simply ignored. Other patrons would walk up next to us and be served while we were pointedly ignored. The hotel offered guests a free drink at the bar, which appeared to be worthless. I suspect that was the strategy to void giving away this little bonus. Why we were treated so rudely is otherwise a mystery to me. I will not pass this way again and admittedly I write this in anger, but I advise others to be cautious about this place.","rating":1,"reviewer":"fresguy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3195429569","title":"Birds Eye Helicopter Tours","comment":"What a great way to see Rhode Island! Of course sightseeing on land is always a good idea but, for a totally neat experience, go on the helicopter tour - you will not be disappointed.  Our guide was great and shared plenty of interesting facts about the area.","rating":5,"reviewer":"tbs1958","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3193756632","title":"Great content but a bit clunky","comment":"Thanks to the user community, there is a wealth of info available.  The app is a bit clunky and slow but tolerable since there is so much info.  Appears they have taken out web links to push you toward using Viator, a related company.","rating":4,"reviewer":"Beach Rare","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3192633523","title":"Great help","comment":"I love this app, for food reviews , trips, places to go... everything!","rating":5,"reviewer":"Helena79","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3192499524","title":"Nico Johnson","comment":"Cassandra & Queen are are absolutely the best they worked with me accommodating all of my needs","rating":5,"reviewer":"maiyahluv","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3192255538","title":"Map accuracy terrible","comment":"Been sending updates for my place of employment’s map location - 252 MILES off course.  Two-three times a week for five months requesting update.   No phone to call, no email to write, no chat to engage in.\n\nOtherwise it’s a great source of info (as long as they map business location properly!).","rating":1,"reviewer":"Do not upgrade!!!","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3192124652","title":"Plastic Surgery","comment":"Dr Enrique Alejandro is so so good. I did a lot of research on surgeons in Guadalajara, or Dr Alejandro does most of his work, and compared his technique, his skills, and his training with the best surgeons in New York. My sister-in-law had had work done by Dr. uses the same technique and she looks amazing. I did my research and Dr Alejandro uses the latest under the muscle technique not used by many because they have not had the training. He takes his time and treated me as an individual piece of art, sculpting my face in a way that did not change the way I look but a younger version of myself. I don’t look like “ i’ve had work done”. I’m just younger looking. The Elaen Center in Nuevo Vallarta Connect to the San Javier hospital is clean, the staff professional and caring. Not only that but he would contact me to check up on me, to have me come in for regular checks up without extra charge. He’s young, professional and takes immense pride in his work.","rating":5,"reviewer":"cherrydelo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3192047016","title":"Fantasy island amusement park","comment":"I agree with majority, in desperate need of care. Truly hoping for positive change! My suggestion, PLEASE lose the corny banjo music during an information call! Totally unnecessary. Difficult to hear options. Plus, you MIGHT want to update your operational schedule!?","rating":2,"reviewer":"marrshaaa","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3190635678","title":"كل ما تحتاجه لرحلتك القادمة","comment":"أستعين به لمعرفة الأماكن السياحية والمطاعم المدن التي ارغب في زيارتها. شكراً من الأعماق.","rating":5,"reviewer":"Abdull2000","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3188692979","title":"Good filter","comment":"Always a good bet when visiting a new place.","rating":5,"reviewer":"fjp8021","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3188240968","title":"Trip Advisor is the Best International Resource","comment":"I do a fair amount of international travel. A recent 3 week trip through the Swiss, Italian and Austrian Alps proved that Trip Advisor remains the authority on lodging and dining outside of the North America. Robust crowd sourcing and outreach to businesses (Trip Advisor stickers are in the windows of many establishments) appear to be the key elements to this achievement and TA has these in spades. Areas of potential improvement include a more robust map interface and more diverse reviews on necessary travel resources (grocery stores, laundry etc.) For both I prefer Yelp which is also generally better within the U.S.","rating":4,"reviewer":"markingolden","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3187790172","title":"Start every vacation here!","comment":"I don’t know what I’d do without tripadvisor!...I plan every get-a -way through here.   No matter how long your trip is.  Where to eat, sleep, activities, shop, ratings, pictures. You don’t need any other travel app!!","rating":5,"reviewer":"fghjjrds","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3186981091","title":"Helpful guide","comment":"Great guide to visiting someplace new, without the extortion of Yelp. Gives you photos, reviews, and top 10 places to visit in each area. Super useful.","rating":5,"reviewer":"CuteCitCat","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3185963935","title":"Don’t leave home without using trip advisor to make plans","comment":"Invaluable in planning out trips. Always so much to see,  it this is an honest way to evaluate options and pick sights, attractions and dining that best suit our needs. I read several reviews where we are in doubt to get a good sense of experiences others have had. In return I write honest reviews to help other travelers as well.","rating":5,"reviewer":"Organized planner","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3185516008","title":"TA overlooked something","comment":"Use TA all the time and rely on it for recommendations. Have the app installed on phone and iPad. What is frustrating is when I want to write a review. I open the app and can locate many choices of destinations, but I don’t see where it gives any option to write a review. I get emails regularly asking me to review a place we have been. But when I open the app I don’t see any option to write one. Did they overlook that?\nIt is quite possible that I am the problem. Just saying!","rating":2,"reviewer":"OC Gordon","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3185135122","title":"Useful but too hotel-focused","comment":"Where do I go to find my prior reviews? The fact that this basic piece of functionality is either difficult to find or nonexistent is absolutely inexcusable. Hectors me to keep location on all the time for no apparent reason; no, you can get my location only when I need your app. And still sends me off in the direction of a random overseas city anyway when looking for hotels. I’m in Wichita, not Orleans, France. Get your act together, guys, you’re coming close to a one-star review.","rating":2,"reviewer":"scareduck","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3182207496","title":"Pinchos Restaurant in Aruba","comment":"Loved the ambiance, service (Floyd our waiter was great), and the food was outstanding.","rating":5,"reviewer":"Anna the teach","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3182083100","title":"Awful app","comment":"I’ve given up trying to find a button to push so I can write a review.","rating":1,"reviewer":"1twangster","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3181207914","title":"First stop when planning travel","comment":"I don’t think I’ve ever planned a trip without checking TripAdvisor!","rating":5,"reviewer":"knobelwoman","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3179088323","title":"Pivice Hlavkuv Dvur","comment":"In Prague, Czech Republic, we had a wonderful dinner of local Czech food with warm recommendations and greetings by owner.  Outside seating was perfect!","rating":5,"reviewer":"mbrichan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3178599099","title":"Crashing","comment":"Trip advisor has been taking forever to load and crashing constantly since the last update, iphone and iPad.\nWhat’s going on !","rating":3,"reviewer":"Frankvil","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3177824335","title":"FM Dons","comment":"First time to this restaurant and had a fabulous experience and meal! We were greeted warmly and followed up\nWith Kate, our waitress, totally warm, informative and engaging! The food was presented beautifully besides tasting 👍! Chef Keith came by our table and we were able to chat with him as well as learn the history of this new year plus new business for him! We will definitely be back and we will spread the word!","rating":5,"reviewer":"MSR and LRG","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3177697572","title":"Very helpful","comment":"I always check the reviews before I visit anything.  Everything from hotels to restaurants to attractions. Very helpful.","rating":5,"reviewer":"Les1964","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3176449828","title":"Chicago Architecture River Cruise","comment":"Our trip was well worth the money!  It really brought the grandeur of Chicago to life for us. Blake, our guide, is the best!  His narration didn’t sound scripted at all, and he was extremely knowledgeable even outside the standard tour information!","rating":5,"reviewer":"STLMarti","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3176259430","title":"My favorite, not anymore","comment":"I loved the trip advisor and use it for many years, recommended to my friends too. However, when it comes to contact/ help center, it is terrible. There is no way to communicate with them. They should be supportive of their top contributors and not blocking them writing more reviews. There is no email, phone number for contact. You can’t find an answer for your questions on the help center. While (we saw on the press) people are writing fake reviews, to add a listing for a place you like to review it is often blocked by trip advisor with no explication( while that business is listed on google or mentioned on trip advisor over and over again under nearby place listings). The iPad application is often crashing or very slow.","rating":2,"reviewer":"mc@art","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3176260074","title":"Rockie Mountain tour","comment":"Kyle Harris.   Thank you so much for the great tour.   My husband and I give you five stars you were always attentive, polite, informative paying close attention to the needs of your group.  Highly recommend this tour.","rating":5,"reviewer":"costaricanlady","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3176075792","title":"University grill fort Myers","comment":"The baked haddock was wonderful! Was here yesterday. Sandra was our server she was awsome! Very professional and helpful! Enjoyed our meal will be back!","rating":5,"reviewer":"Ellen la la","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3175969012","title":"Tripadvisor censors reviews and forums","comment":"Tripadvisor censors critical reviews and posts . Your real and true opinion is not wanted or valued . Only positive reviews are accepted. Not a credible or valuable review site .","rating":1,"reviewer":"Ressaw2011","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3175662644","title":"Solid from the start","comment":"This app has really turned into a must have for...everyone, really. Solid tech and a great network that has helped billions of travel destinations.\n\nWorld class app for the world wonders everywhere!","rating":5,"reviewer":"support strap","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3175153929","title":"Review of limoliner","comment":"Never again will I travel with limoliner who changed scheduled trips with only one day notice to impossible times allegedly because of driver unavailability. Obviously they cannot afford backup drivers. I think they are in financial trouble. Db781","rating":1,"reviewer":"db781","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3172888637","title":"Montmorency Falls Bike Tour in Quebec","comment":"A wonderful bike ride with our guide Raymond! He gave us insightful information along the way at a comfortable pace. The snacks were delicious!  The falls are amazing and the views from the top are first rate. Thank you!","rating":5,"reviewer":"Hensel Family","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3172843456","title":"Easy to use, longstanding information","comment":"Trip Advisor has been around a long time and is easy to use.  It has built a good reputation for those who are looking for information about different places and make it easy for those who would like share their thoughts about these various locations (good or bad).","rating":5,"reviewer":"Newport Helen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3172755417","title":"Great research tool with one significant flaw","comment":"Trip Advisor has become my go-to tool when I'm in a new place. Great for researching restaurants, hotels, points of interest etc. My big complaint is that all restaurants get lumped into the same category regardless of size, scope, level of complexity etc. A small 20 seat luncheon with no alcohol place has no business being compared with a large white tablecloth shop running a much more refined operation complete with full bar and wine service. These are not equivalent and should not be critiqued as the same businesses. Until Trip Advisor starts to distinguish between snack shop, carry out small scale eateries and large refined white table cloth restaurants, I will always have a question about the posted ratings and recommendations. Sorry, just the truth and the facts.","rating":4,"reviewer":"Church Lady 1985","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3172734808","title":"Love Trip Advisor","comment":"Easy app to use on the go when looking for restaurants etc.","rating":5,"reviewer":"Jezzlouise","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3171965501","title":"Best western Daytona Inn Seabreeze","comment":"The breakfast was the bomb and Mrs. Pat that takes care of you in the morning is the top caretaker ever! You walk in and it’s all smiles to start your day! Will give you the best trips to see. All the staff is super friendly and so Helpful and the room was comfortable. Thanks to all of you!","rating":5,"reviewer":"slingshotrider","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3171884428","title":"Reges oceanfront Resorts","comment":"Very nice hotel. Awesome view!  Good resort restaurant for breakfast. Clean and comfy. I will definitely go back!!!  Did not have one complaint 😀","rating":5,"reviewer":"Nancy Vas","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3170590680","title":"Rental in Rome","comment":"I used rental in Rome for a rental in Rome thinking it was local and they would be better than a worldwide service!\nItvwas a terrible  experience and they took entire payment for 21 days  way back in March\nUpon arrival at Vite prestigious\nNothing was as listed — it was not any of things they said including and most important elevator access\nI am trying now to get my money refunded after I left immediately!\nDo not even put them on your site!!!    Terrible experience!!!","rating":1,"reviewer":"dottyb@aol","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3169510012","title":"First place I look at","comment":"When going on vacation or to a different town we are always looking for the best reviews!  We are never disappointed and will turn around and write our reviews!  I think it is important to share the good, the bad and the ugly of all places!  It is our opinion of places so read it or not!","rating":5,"reviewer":"iphone6lover","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3169303035","title":"What did you DO?","comment":"I find TripAdvisor to be non-functional with the last two updates. The opening screen is whited out with grey boxes for the icons for a good two minutes. Why do I bother to use this app? This is one of the rare cases where I find the website way more useful and with less hassle. I will be deleting the TA app since it isn't useful or helpful in any way.","rating":1,"reviewer":"305lovinit","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3168662862","title":"Great travel app!","comment":"Great travel app!!!!!!","rating":5,"reviewer":"Frank1307","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3168134199","title":"Very thankful for this app","comment":"Love love love this app I use this everywhere we go including around home. It's very helpful and I love reading what others think and I like to leave my reviews also. Great app!","rating":5,"reviewer":"candicane0104","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3168112471","title":"Paradise on 14th","comment":"My relaxing day on Miami was magnificent and don’t get me started on the 2 captain so cedric and Anton and the 2 cashiers Karen and Malona  they made my day even the more perfect thank you so much","rating":5,"reviewer":"buterkhgfffcv","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3167791860","title":"Good room net and clean  good customer services good breakfast","comment":"Good","rating":5,"reviewer":"Bn when","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3167711664","title":"I look at Trip Advisor before deciding","comment":"I use the trip advisor app for helping travelers through my experiences. I like connecting and sharing with other adventures and travelers as often we have similar experiences but especially when booking travel to places I have not previously been. I give it a 5 star, top rating because it’s based on customer’s opinions and experiences and management’s responses which I like to know. If management doesn’t take time to respond, that speaks volumes to me. You can add places that aren’t on the app which helps the small businesses as well so think of them next off the beaten path you take. I highly value the trip advisor app!","rating":5,"reviewer":"FL Escape","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3167436784","title":"Life safer on more than one occasion.","comment":"Nice to have TripAdvisor when you’re in a foreign place to review everything! Places to visit, hotels, restaurants and even scope out maps. Love the forums!! If you have a question about something you can ask other travels on advice and get feedback. Try it. \n\nOne thing I would love to see is a translator to read other reviews in other languages. Other then that I \nLove your app! \n\nThanks for all the safe travels tips!!!","rating":5,"reviewer":"Terapin Backpacker","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3167428327","title":"Always a go to Ap","comment":"Trip Advisor is my go to whenever traveling or looking for a new restaurant in my area. I can pre-plan hotel stops with great restaurants. For quick booking on the road, Trip Advisor links well with other hotel booking sites checking availability. A feature I’d like would be  directional search vs nearby. Useful when looking for meal stops enroute. Currently need to know upcoming cities, then search individually.","rating":5,"reviewer":"lestermin","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3167357414","title":"Room for improvement","comment":"I have come to rely on this app for all of my trips.  But it is time to make it better.  My complaint is that once pictures are posted, you can not take them down or edit them. I understand we are helping other travelers, but if I by accident shared the wrong pictures (or the location attached is incorrect, for example my pictures from ice castle in NH is linked to an Ice Club in Rome in Europe.  I’d love to go see Rome but I have not been there yet) I would want to be able to fix it. \nChanging my profile picture is another thing I wish I could do but cannot no matter what I tried.","rating":4,"reviewer":"micelle405","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3165962313","title":"I love this app it's one of my favorites ⭐️⭐️⭐️⭐️⭐️","comment":"It is great just full of information from other travelers and pictures! ❤️","rating":5,"reviewer":"ScarlettM2011","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3165339853","title":"I totally depend on this app","comment":"I depend on these reviews written by people like me, for planning trips. The details and personal reviews are essential for finding the most beautiful and interesting spots, such as finding a place to see wild kangaroos in Australia, or finding a waterfall that was easy for my handicapped Mom to walk to.","rating":5,"reviewer":"Cr1718","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3165070623","title":"Cantina Mexico, Cabo San Lucas","comment":"A completely different atmosphere within a fun and lively town. I loved this bar the moment I walked in!  Great management, fantastic value. If you ever get tired of the same old atmosphere, (which is fine,) but there’s nothing quite like feeling you’ve just entered into something different, warm and special - and FUN!!!","rating":5,"reviewer":"JnEHayes","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3164729256","title":"Great","comment":"It’s great. Does what the website does.","rating":5,"reviewer":"Taylor McInerney","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3162767340","title":"Very bad strategy","comment":"They delete bad comments from hotel page and make em top for money all few chain hotel which really bad. People want good service from good hotels. Otherwise all hotel will pay you to make top and all good hotel will be demolished for your step. THINK BEFORE DOING IT PLEASE.","rating":1,"reviewer":"anydy007","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3161853826","title":"My go-to ... with some reservations","comment":"This is definitely the primary app I use for travel. The filter and location features are incredibly helpful. \n\nDepending on how their partnerships work, there may be better deals on other apps or direct from the hotel itself that would not appear on tripadvisor. So it is definitely worth cross-checking with other platforms.\n\nMy remaining nagging concern with using this app is it has had a well documented history of deleting reviews from people who sought to help fellow trackers by providing warnings regarding personal safety. \n\nThe company only decided to do something about it after the MULTIPLE horror stories went public which speaks to the sorry ethics of its leadership team. \n\nI wish this was the only app I needed to rely on for travel — it’s otherwise that good! It’s not entirely trustworthy on its own and one must study reviews and details across sites and providers to ensure a pleasant and safe travel experience.","rating":4,"reviewer":"Tall, Dark and Anthem","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3161497305","title":"Cibone, an exquisite experience","comment":"Tucked into one the quaintest buildings in historic Frederiksted, Cibone is absolutely exquist. Each meal is prepared by one of the few truly fine dining chefs on island to perfection. The owners take great pride in presenting their island’s culinary skills and architecture to locals and visitors alike. A true joy. Thank you.","rating":5,"reviewer":"Mary from Turtles","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3161228661","title":"Lionel Ritchie at Planet Hollywood in Las Vegas","comment":"Lionel did not disappoint. We had seen him before in Anaheim. His show was engaging, intimate\nAnd extremely entertaining. He Rocked the House\nAll Night Long. Thanks Lionel, for great memories for my wife and I.","rating":5,"reviewer":"Joe's Home Office","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3159033005","title":"Indispensable app for frequent travelers","comment":"I always use this app when I travel. Throw out the worst and best reviews and you get an accurate set of reviews.","rating":5,"reviewer":"Dbrr13","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3158483326","title":"Addis Ababa Hotels","comment":"We will be spending 2 nights in Addis Ababa next month. I was hoping to go to a Hilton Hotel, but Trip Advisor did not show that there was a Hilton in Addis. My friend who lives there told me to look into the new Ramada Hotel. Again, Trip Advisor did not have that Hotel on their list or map. \nI will no longer use this app to look for Hotels in cities unfamiliar to me.","rating":1,"reviewer":"Chlinimuuseli","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3157523421","title":"Very helpful app","comment":"I use it for hotels, restaurants, shows, attractions. Very handy!","rating":5,"reviewer":"Shnewls","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3156928467","title":"The warmest reception and service","comment":"I came into the AC Hotel in Louisville, KY, with my granddaughter on 8/18/18 and Joseph and Kelsie were a breath of fresh air blowing from check-in.  They were sensitive to my frazzled state.  Trying to keep a tired 3 year old composed in a lobby full of adults was one challenge.  Finding the right card was the other!  They were calming, patient and understanding.  I enjoyed my stay and being uplifted by such beautiful people.","rating":5,"reviewer":"Grateful Glam-ma","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3156852935","title":"Use the app all the time","comment":"I love to post reviews from my hotel or restaurant stays across the world. I also use it personally before booking a hotel stay bc I like to read other reviews and see actual pictures from regular travelers like myself.  The app functionality makes it easy to upload photos and write reviews. Although Trip Advisor has to review and “approve” every posting, they do so in a fairly quick fashion. I guess they are looking for foul language in the posts? Not sure. That’s the only odd thing is the review and approval process.  Still a great app and recommend using it to get real reviews from real people.","rating":5,"reviewer":"Fayloveswine","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3156142288","title":"I use TripAdvisor for everything","comment":"Love the app!  Easy to use. No complaints.","rating":5,"reviewer":"tdv2567","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3155781990","title":"Necesario para viajar","comment":"Es una herramienta necesaria para un viaje, ayuda mucho al momento de buscar donde comer y hospedarse 👍🏼","rating":5,"reviewer":"cotrineli","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3153664500","title":"Love the trip advisor app","comment":"This app has helped us so much when we travel. We use it to find hotels and also to find restaurants and activities. It also helped us a lot when we moved to a new city!","rating":5,"reviewer":"j-mama8","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3153501000","title":"What would I do without it","comment":"I use TripAdvisor whenever I travel and I travel a lot. I know what to do where to sleep and eat and all because fellow reviewers let me know their honest opinions. I can’t imagine how you can’t use this app.","rating":5,"reviewer":"Hardleetryin","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3152588005","title":"Great Southern food and hospitality!!","comment":"We ate at the Old Mill in Pigeon Forge last night. Every meal comes with corn chowder, corn fritters, salad, mashed potatoes, vegetable and homemade dessert. I had roast beef (HUGE portion!), John had chicken & dumplings and Ron had catfish. I had blackberry cobbler a la mode for dessert and the guys had pecan pie. I was stuffed!!! Next to the restaurant is a Mill and waterfall. Wonderful atmosphere and reasonable prices!","rating":5,"reviewer":"BritFan05","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3151656739","title":"تطبيق رائع وجميل","comment":"تطبيق اقل مايقال عنه انه مساعد لأي مسافر بكل اللغات والمهام ، اصبح التطبيق يدعم اللغة العربية وهذا شيء انتظرناه كثيراً .. نطمع في المزيد","rating":5,"reviewer":"ALI-alwadee","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3150573226","title":"Novotel Hotel in Chumphon","comment":"A true place to get away from the hustle and bustle. Beautiful grounds right next to the beach.","rating":5,"reviewer":"getawaypal","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3150400573","title":"For 1k per night not happy","comment":"The hotel itself is magnificent. I’m on the gold level floor and paid $1000 per night. It rained all day so I was eager to take a long bath in my room. I kept leaving hoping to come back to made up room. I did this until 6:00 PM.My room was never cleaned  up. I will not come back.","rating":3,"reviewer":"where in a whatever Aurora","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3149881990","title":"Quit sending me emails on past searches","comment":"I want to turn off emails on past searches and I cannot do that on my iPhone app. Fix this super annoying issue or I will just delete!","rating":2,"reviewer":"Lunalove74","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3149765633","title":"Used to be better","comment":"I like to read the reviews but now only a few are shown and then you have to pick the review by a category to read them.  I like to look at the most recent ones to see how a restaurant is doing.  Ap used to be pretty handy, now it’s kind of diappointing.","rating":2,"reviewer":"jeff6467","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3149655515","title":"Light Fare With A Flair","comment":"Dune Dog opened this Labor Day Weekend 2018 in Stuart, FL.  Above from Jupiter “up” the Treasure Coast is welcome by this reviewer and I’m sure many more - and when this makes the paper or is spread by word of mouth it will be just like their Jupiter store - you won’t be able to get near it for a well deserved break.","rating":5,"reviewer":"Kenny Gr","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3149650125","title":"Muy buena app","comment":"Es muy útil.","rating":5,"reviewer":"jlm105","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3149328013","title":"Possible bug in newest update","comment":"I love this app and use it all the time, whether we are actually planning a trip or just dreaming. Right now I am planning a trip to Branson, MO. I was using the app to search for vacation rentals and things to do, with family members coming from other states. But when I decided on a condo, I emailed the link.  Then the update came through and when I got back on with my iPad, the Vacation Rental section was gone and I couldn’t get the photos from the saved condo.  I tried deleting and reinstalling the app, but same thing. I got on the desktop computer and everything was right, and the booking went through, but it still won’t come up on the iPad.","rating":4,"reviewer":"TropMary","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3148501464","title":"Swear by them","comment":"Been using the app more than my laptop or home computer.. Easy navigation","rating":5,"reviewer":"Brettsifdny","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3147666311","title":"Trip planning","comment":"I like planning trips with this ap.  I can find restaurants I want to try, beaches to walk, places to stay and things to see and have them all at my fingertips.  I feel so organized and efficient!","rating":4,"reviewer":"Nemofujimom","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3147627168","title":"App crashes","comment":"Everytime I open the app it crashes. Have installed the latest version but this has been going on for past couple of versions now.","rating":1,"reviewer":"pk63622n","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3147568788","title":"Have to type 200 words this is to much.","comment":"I love this app good for food and hotel stay but when we playing reviews we have to type 200 words that is to much. Otherwise this is best App for travelers like me. Hope they have better map options.","rating":5,"reviewer":"Nirav(Nick) Chaudhari","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3146950771","title":"Very useful app","comment":"If I want to go anywhere the first thing I do is see the reviews on trip advisor and decide whether to go or not .this app helped me in taking my decisions.","rating":4,"reviewer":"roopa29","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3146774701","title":"Pretty good app, needs report button","comment":"Update- 9-2-18: For some reason, I routinely now get messages about areas I’ve recently looked at on TA. I can’t find any way to disable them. I often visit TA and look at forums for areas we’ve visited in the past, but I don’t need a nuisance message later about info for that area. \n\nOriginal review - I love being able to access TA from my phone. \nI guess TA probably has to drop some pictures after awhile, but it is a little disappointing to look back and see your pictures are gone. \nIt would be nice if the reviews were searchable by oldest first too. \nI miss a few of the features available in the PC version. Like having a button to report posts, being able to report incorrect information about a restaurant, attraction or hotel, not just closed, but incorrect addresses or duplicate listings. \nNeed a button to flag reviews left for obviously wrong locations. \nI wish the travel dates would drop out when you close the app so they don't cause issues in the next search. \nI miss the thumbs down button ;-)\nStill, it is a great app!","rating":5,"reviewer":"Frustrated EBay user","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3146602880","title":"Must have app","comment":"Whether for local sites and restaurants or travel farther afield, I use this website and on a recent cross country road trip, this app was my go to for finding hotels and restaurants as we drove. Found great BBQ in Kentucky and Kansas, great Thai in Moab UT. \nI asked friends for recommendations for restaurants in St Louis, saved them to my trip folder on TripAdvisor and then was able to quickly pick a restaurant that meshed with that we desired at the time. \nEasy to use. Great traveler reviews and photos.","rating":5,"reviewer":"JennyC10VA","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3146414066","title":"Hampton Inn - Kimball, TN","comment":"The young staff at this hotel really strive to make one feel welcome. They accommodate the guests in as much as possible. The rooms are quite clean and adequate for a highway stop. The only staff name I can remember is Hillary, however, each and every staff member from housekeeping to front desk are outstanding. I highly recommend this Hampton.","rating":5,"reviewer":"eurodame","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3146216914","title":"Can’t add photos, doesn’t respond well","comment":"Difficult to give reviews with photos. Also trip advisor doesn’t check these rentals out so beware of the creative photos from owners.","rating":1,"reviewer":"nevada jack t","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3143995643","title":"Great help for trips","comment":"I was looking for good places for dinner and lunch. Every time when I listen TripAdvisor we where eating great and cheap! Thanks for all help TripAdvisor!","rating":5,"reviewer":"igorcy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3143440770","title":"3 Star Restaurant","comment":"Casual dining in the Hyatt McCormick Regency Chicago .  Wonderful soup and pot roast. The chef ; Jason came out to our table to discuss my meal.  Vicente , our server was extremely gracious .  After hours of driving we were glad to relax with a well cooked meal.","rating":4,"reviewer":"Frustrated121913","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3142964137","title":"What has happened to app?","comment":"Using on iPad have been for years. Last two updates don't seem to be helping. App now runs very slow and get blank page on home page for the longest time. Is it because my iPad no longer getting updates from Apple?  No other apps have this problem, though.","rating":1,"reviewer":"Bozothec","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3141709012","title":"At least it’s not yelp","comment":"A little less annoying than yelp.  Hence 1 Star.","rating":1,"reviewer":"ddindallas","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3141657627","title":"Never do without","comment":"Enough said! One of the only apps I use and trust:) It’s never let me down yet and been using it for as long as I can remember using apps and internet!","rating":5,"reviewer":"Kimsouthfl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3141527482","title":"I use the TripAdvisor app for everything","comment":"If I want to book a hotel or find something to do, whatever it is, I use TripAdvisor. The reviews are unbiased and by people that are real. The app is easy to maneuver and is probably the app I use most.","rating":5,"reviewer":"LolaBriarwood","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3141260537","title":"Must","comment":"It’s a great app for traveling and it’s a must for finding new and exciting places to eat.","rating":5,"reviewer":"carterjd","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3140255122","title":"Hotel Grand Bohemia Prague","comment":"Our stay in Prague was underpinned by an excellent experience staying at Hotel Grand Bohemia. The staff were sensitive and competent. Rooms were clean and well appointed. Full breakfast was excellent.","rating":5,"reviewer":"RBL-T","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3139949135","title":"Very helpful!","comment":"The app is so helpful when I want to plan a trip to a new place! It’s my go-to app whenever I’m planning an itenirary or making bookings for a vacation! However, recently I tried adding a place but I found it difficult to do so! Hope it gets fixed!","rating":4,"reviewer":"HimjaSethi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3139410921","title":"TripAdvisor","comment":"A good place to find places to stay while traveling. The one think that is lacking are negative reviews. For example: San Simeon lodge has great reviews. Go to Yelp see the bed bugs.  Bad reviews are more important than good ones","rating":4,"reviewer":"Sam5274","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3139124263","title":"Great app","comment":"Its a good app","rating":5,"reviewer":"Edirik","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3138472256","title":"Excellent service","comment":"I truly appreciate the help of Wynnette Valerio, she’s one of the best staff of Holiday Inn, Vacaville, California. Thank you again Wynnette...","rating":4,"reviewer":"Alisto02","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3138370009","title":"This traveling couple’s bible","comment":"We have ONE complaint, not everything is on TA. But we use it obsessively for planning trips, during trips and reviews afterwards. Wouldn’t want to live without it.","rating":5,"reviewer":"ronyagllewop","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3138168865","title":"ILoveKickboxing sarasota","comment":"I love the workout and the gym & the trainers are awesome ! One hour workout , go check it out and you will be hooked !💪💪💪💜.","rating":5,"reviewer":"flinttowngirl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3138118421","title":"Paulina Azul Fives","comment":"Best worker in bar tending at Azul Fives!  Visit her on your next stay!","rating":5,"reviewer":"elmarty","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3137894692","title":"P","comment":"PLO group u","rating":3,"reviewer":"Bornt0run","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3137387391","title":"Great app!","comment":"I made search for Cartagena, Colombia in Booking.com and I kid you not the stupid app says ‘not found’!! Really!! Cartagena without hotels is like an egg without its yolk! This app is very complete. It even allows you to communicate to the place you’re looking at by posting a question.","rating":5,"reviewer":"pookie050","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3137110681","title":"A Must Travel Tool","comment":"I search several TA reviews on an upcoming trip b4 making plans! GOOD research tool.\nUpdate as of Aug. 3018 this is still my Go To app for travel! 😃","rating":5,"reviewer":"Team Garza","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3135969897","title":"Great app!!!","comment":"Always use for looking at places I’m going.the tours available are particularly good. Used many times, while can be expensive worth it because shows you best of local area that I would never have gone and bypassing getting tickets and lines and the best part. Like the food tours especially.Always on TripAdvisor to research cities I’m going to. For me 5*****","rating":5,"reviewer":"gman10047","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3135952139","title":"Maps don’t work good with iPhone- the app keeps going to Apple maps & does not give directions","comment":"KKC1","rating":2,"reviewer":"KKC #1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3134426802","title":"The Revolutionary Story Tour in Boston","comment":"This tour is fabulous!  What a great story to hear from a true historian!  Mike tells the story as if you were there and a part of it. He’s smart, funny and keeps you interested. I highly recommend this tour!!","rating":5,"reviewer":"wvshears","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3134083939","title":"San Francisco","comment":"First time using this app. So far I have it very helpful and super easy to use.","rating":4,"reviewer":"Nor3100","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3132478181","title":"Great for restaurants","comment":"TripAdvisor app has served me well for trip planning, especially when it comes to restaurants.  I’ve never been let down.","rating":5,"reviewer":"barkerfife","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3131663525","title":"Unique","comment":"Nice place and clean room. The room was  a little smaller than I expected. I did talk to the front desk she explained the hotel was build in 1923 and that she completely understood. She did give me a 10% discount. I very much appreciated this plus her spirit. Ask for Nadine or Heather if you book a reservation great experience here.","rating":5,"reviewer":"spirtual insite nadine","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3131106246","title":"So reliable!","comment":"I love this app! I’ve used it for a few years now for multiple trips...we love it so much! It’s great for setting up and planning the trips...AND for checking out places we might like to try out rather spontaneously...","rating":5,"reviewer":"Frenchylicious","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3130921014","title":"Cucci’s at Hot Springs","comment":"This restaurant was mediocre at best. However it was really the only option in town on a Tuesday evening for an informal dining experience. I had the cheesesteak and it was decent.  Skimpy on cheese and mushrooms but bread was homemade. Husband had spaghetti- they only have one type of pasta.  It was served very watery. Three meatballs and hubby says they were ok.  When the watery bowl was addressed, an “I’m sorry ‘ bout that” was all we got twice!  So I would probably not go again unless it was Tuesday!!","rating":2,"reviewer":"MH in PA","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3130869334","title":"Trip Advisor For Sale?","comment":"I used to love Trip Advisor.  We travel a lot (full time rv-ers) and I used to count on the app for things to do that were off the beaten path as well as advice on the more popular sights.  However, since the app is now more about selling rooms or tours it is much less about what is really out there to see and do.  It’s still useful, but no longer my go-to.  :-(","rating":3,"reviewer":"Grggggy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3130211571","title":"Great travel App.","comment":"I use this app. all the time?  It especially when we travel.  We have found great restaurants that we probably would never found without this App.  It is also helpful when looking for things to do for the family when on vacation.","rating":4,"reviewer":"emptynrster","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3129132863","title":"I use this app everywhere I go","comment":"I’ve used trip advisor for years. The app is very good and seamless. I don’t have any issues with it.","rating":5,"reviewer":"Distillate jhvyddhfs","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3125939472","title":"My go-to for booking and info (still)","comment":"I use this a lot to research locations and hotels. Easy to use, reasonably comprehensive, and finds good rates for locations that we travel. Like most apps however, sometimes it just goes away and I have to start over. Prefer web sites to apps, but this one works well on my iPad.\nAs I wrote this some time ago I wanted to return and confirm that this is still my go to app, locally, nationally and internationally. I find the people who do reviews on this site are also a bit more likely to assess the various places and products more reliably - of course there are exceptions and they usually make themselves obvious.","rating":5,"reviewer":"ElliottAH","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3125924884","title":"Not impressed","comment":"I am not impressed with the website or the app. You can filter restaurants but the filters are not carried over to map view.  The maps are not great.","rating":1,"reviewer":"RichardBonn","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3125914782","title":"TRIP ADVISOR","comment":"There are two (2) CHARLIE GITTO restaurants.  Trip advisor fails to distinguish one from the other.","rating":1,"reviewer":"eastsideflyer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3125477791","title":"Reviews helpful","comment":"Wouldnt think of spending time in a new city without consulting this app. I find peoples factual reviews helpful and they give me direction as to where to spend my time.","rating":5,"reviewer":"the original runleeny","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3125203512","title":"Hard Rock Hotel Daytona Beach","comment":"Sooo clean, no cigarette buds, service was great, everything new, great location, great valet(Felix)but also able to park across the street. \nThe hotel truly has a resort feel. You really don’t have to leave for entertainment. Live music was great. I was relieved there was no early morning chair saving happening. The guests were a mixed crowd, families, couples - no 20 somethings partying. \nMy son Goes to college at Embry Riddle in Daytona and we will stay here from now on. In the past we stayed at The shores, Hampton inn, a couple others but all felt ehhh. \nThe negative-\nNo drawers in the room. So I left my suitcase on the floor to trip over. It left me frustrated to have to toss through my clothes and bend over. How do the celebrities who come manage?(ok they get suite😗) you get my point. \n\nLOUD music at the pool even at 8am. There is no quiet spots at ALL in outside spaces. You have to leave to make a phone call or put noise canceling headphones on to read. Need more full shade options at the pool. \n\nIt seemed to me that most of the employee s were foreign. They were motivated, hard working and friendly. I don’t understand how the hotel brings jobs to the area though if they hire all foreign workers.","rating":4,"reviewer":"Goojacha","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3125131511","title":"Perfect for travelers,","comment":"We have all arrangements for all trips by this perfect application, the reviews are very helpful and guiding.","rating":5,"reviewer":"foodlover24","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3125063917","title":"City guide download is impossible to find!!!!! And download","comment":"Don’t get it.     Why aren’t they easy to find?????","rating":1,"reviewer":"lemonlikeskitty","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3123829026","title":"Update pictures","comment":"Please put pictures in chronological order.  It is not helpful to see what a hotel looked like 7 years ago.  There is no order to the pictures at all.  This is not how it was in the past.  Disappointing.","rating":2,"reviewer":"Vkramer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3122909915","title":"App Review vs Others","comment":"This app for trip advisor has the best prices compared to others I am liking it so far","rating":4,"reviewer":"Jaaac5","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3122717730","title":"Getting sick and tired of commercialization","comment":"It seems like Trip Advisor is trying to sell me stuff rather than advise me.  I get they need to make $, but they crossed a line in my mind.","rating":1,"reviewer":"Marknitz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3122710738","title":"Powerful Information at your Fingertips","comment":"This app has worked flawlessly since I started using it a few yrs ago.  The TripAdvisor app and site serve as a powerful information hub for travel, especially to new destinations.  It really streamlines trip planning and cuts down on ‘lesson learned the hard way.’  The additional capability to discover, review, and purchase activities/tours is a very helpful feature.  This had enabled me to partake in tours I otherwise wouldn’t have known about.  I don’t how people travelled before this🤷‍♂️.","rating":5,"reviewer":"BCSrobomoto","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3122570651","title":"Opinions","comment":"I just hope that everyone keeps in mind that people’s “reviews” on trip advisor are their opinions!  That’s all! Not facts!! Just because you have access to the internet does not make you an expert.","rating":1,"reviewer":"diehardquill","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3122413199","title":"Munichwalk","comment":"We had a very unsatisfactory experience with this company. In May we booked a trip for our Grandson to Dachau. I called with a question and they were unable to find my booking with my confirmation #. They told me to rebook it and they would refund me one of the trips. I have contacted them at least 6 times and have been given 1 excuse after the other. It is now almost September and still nothing. I am absolutely frustrated and disappointed in them. I would definitely not recommend them.","rating":1,"reviewer":"Whapita","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3122301060","title":"Great App & I find most of the reviews quite helpful.","comment":"This app can save you from wasting good money at bad places.  Read at least 5 or 10 reviews before deciding.\n\nI have One Major concern that I have brought to their attention in the past but it has not been corrected in over a year.\n\nI visit new restaurants frequently with my wife and I have always attempted to write a review.  I never can because the restaurant is not listed and when I enter the name and exact location nothing happens.  I have tried to notify Trip Advisor of this problem in the past but there us no place on their app that I can find to add a new restaurant.","rating":5,"reviewer":"SignFixers","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3122169251","title":"Best App","comment":"This is my best friend for traveling.","rating":5,"reviewer":"JoyKarwan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3122056029","title":"Reliable","comment":"A great and reliable source of information. I have to check reviews before booking any hotel","rating":5,"reviewer":"Rouds M","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3121869624","title":"A must check source","comment":"Seems to work best in mid size destinations.  When there are many options the truly outstanding ones sometimes get lost among other great but not outstanding options.  Seems silly to complain because you still get great options!  If the destination is too small you end up getting franchise reviews and miss out on the local flavors.  I still find myself checking in all destinations I will be traveling through to make sure I don’t miss something!","rating":5,"reviewer":"KittyappgalSkystream","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3121664543","title":"iPhone","comment":"I'm happy with the majority of the benefits and features of the app. My main complaint is that the iPhone does not have the same capabilities as the computer. iPhone does not show that you got a helpful rating from another traveler. You can't access information the same way on the iPhone as on a computer. I use my iPhone for everything. I don't own a computer.","rating":4,"reviewer":"King Romulus","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3121586103","title":"Don’t leave Home without it","comment":"The go to source for honest reviews from real people.","rating":5,"reviewer":"Mikee75040","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3121103103","title":"Improve the Things to Do module","comment":"Things to do module needs to have a local (or in-city) section separate from an out-of-town section. The two are now mixed together which is not the best way to present this to a visitor!","rating":4,"reviewer":"cint21","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3118258736","title":"Simple way to inform others.","comment":"I love using the trip advisor app.  It is easy to navigate and quick to leave my opinion on a sight seeing activity or restaurants.","rating":5,"reviewer":"Phoel's mimi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3117271520","title":"Can’t edit answers","comment":"Wanted to edit an answer I wrote on the website for a traveler’s question. Nope. Can’t do it in the app. Not good.","rating":2,"reviewer":"FloresArts","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3117179507","title":"My favorite review site!!","comment":"This is my favorite review site. I almost always check the site for local restaurants. I love the gps part and letting you know, a very good restaurant is 75 feet away and around the corner. \n\nIt has also become one of my go to sites, when I am planning a vacation. I always read 10++ reviews for the items I am interested in and do not simply go by the points. \n\nAfter three years of using it regularly, I now contribute to it. I have written 258 reviews, to help fellow travelers and foodies : )","rating":5,"reviewer":"MichaelH6811gy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3116235193","title":"I like it","comment":"I learned that I must check trip advisor site before book a hotel or trips and restaurants","rating":5,"reviewer":"Abeerzaki","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3114914122","title":"Great app","comment":"Great app","rating":5,"reviewer":"cr141414","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3114774660","title":"Lost plate food and beer tour Beijing","comment":"awesome tour eating at favorite restaurants amongst the Chinese people. Not tourist trap tour! Lots of history and good food. Hong was the best guide! I highly recommend this experience !!!","rating":5,"reviewer":"merchieprez60","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3114014255","title":"Consistently good","comment":"We have traveled three continents using TripAdvisor and have never been disappointed in the recommendations- be it places to eat at, visit or stay. Wouldn’t dream of traveling with any other travel guide!","rating":5,"reviewer":"msjakl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3113716632","title":"BACK POCKET - Tour Guide","comment":"It’s like having a tour guide in your back pocket! I use Trip Advisor when we hit the road to plan stops along the way. Sometime detour from original plans and take a longer route just to hit a great place for lunch! Hasn’t steered me wrong yet! Great info here!!","rating":5,"reviewer":"Scott Gaspard","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3113152462","title":"WiFi","comment":"I have installed, reinstalled, turned off and on both my phone and iPad. I get absolutely no information about places I am near unless I am on WiFi. That seems pointless when I am traveling. If I am at home, I get helpful comments about places, but TripAdvisor globes me no Advice when I am on an actual Trip.","rating":2,"reviewer":"orgnizd 51","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3112638514","title":"Wouldn’t travel without it","comment":"While I wouldn’t think of traveling without consulting Trip Advisor, I get pretty annoyed using the app.  On my tablet, I’m unable to select the buttons to rate service, quality, value, etc. while writing a review.  Sometimes, as I’m writing a review it hangs out there, showing up on my homepage for weeks or months and I’m unable to get it to post.  I also get frustrated when searching with the app. Trip Advisory needs to add more robust filtering options.  For example, I want a restaurant that serves gluten free, within — miles of x and with an average rating of 4 or higher based on at least 50 reviews.","rating":3,"reviewer":"Amateur walker/runner","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3112501389","title":"Great info!","comment":"Consistently good info! Great when you are traveling to areas you aren’t familiar with. Love the alerts I can setup for getting lower prices on hotels and flights. \n\nImprovements need to be made on communications from the app when they accept your info about a new restaurant. Also, I submit a lot of reviews and pretty often my reviews get hung up in cyber space so when I go to review that same place again I will get an error asking me to finish my last one, even months years later. \n\nIt’s not easy to contact TripAdvisor. You get a ton of hyperlinks that really don’t tell you anything.","rating":4,"reviewer":"Tpl3ss","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3111810458","title":"Meaningful reviews even in less traveled locations","comment":"I live in Beijing and find TripAdvisor to be more accurate for foreign tastes than local options such as DianPing. Served my wife and I well in Thailand, Maldives, Mauritius, New York, Boston, ... everywhere. Thanks TripAdvisor for making our holidays more enjoyable and carefree.","rating":5,"reviewer":"ChrisPfeiffer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3111264212","title":"Absolutely BEST travel app available","comment":"I travel all the time. Asia, North America, Europe.\n\nI always review which hotel I'm suggested to stay in, or plan my appointments at restaurants on TripAdvisor prior to confirming.\n\nI also review most places I go.\n\nHighly recommend","rating":5,"reviewer":"Parker In China","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3111213408","title":"Must have travel companion app","comment":"If you like surprises while traveling that’s great - but I don’t when it comes to hotels and restaurants and TripAdvisor is a real gem of an app for finding the best eats & sleeps on the road as well as things to do! Highly recommended from a seasoned traveler. Just get it, it’s free!","rating":5,"reviewer":"andyrauf","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3110022271","title":"The new fix broke the app","comment":"Please fix the app!  The new update broke app and it’s horrible.","rating":1,"reviewer":"Sallen1107","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3109627785","title":"Excellent app","comment":"This is my go to app when I’m planning a vacation or just in general if I want to know if any place (restaurant, museum, etc)it’s worth visiting. It’s pretty easy to use and it also will give some insight on places you haven’t even heard about. I also post my own reviews of places I’ve visited so I can help others too.","rating":5,"reviewer":"lizakq","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3107656524","title":"Useful","comment":"Trip Advisor is super useful for finding places to eat and things to do both at home and away. I like that you can search reviews for keywords. As a reviewer, I would like to be able to edit posts. Also, I would like fewer emails pressuring me to review. The badges for reviewing is a cute idea but once you realize they don’t get you anything but more emails they lose their appeal.","rating":4,"reviewer":"RainbowSky100","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3106688250","title":"Awesome","comment":"Is is the best app. I always check out other reviews before booking anything.","rating":5,"reviewer":"rgeulen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3105672638","title":"Vegas room reservation","comment":"Booked a room with strips views, ended up viewing walls and dirty rooftop. Never with vegas. Com again. Be aware Vegas now charges parking fee founded out after checking out. Called vegas. Com customer service someone name Nancy told me you have to do finout by yourself by read Terms and conditions. Thanks a lot.","rating":1,"reviewer":"2121dave","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3105641686","title":"I must be retarded","comment":"Every combination of nonsensical letters and numbers and special characters for user name still returned the error message that my user name is already taken. What malarkey! I give up.","rating":1,"reviewer":"CobyAlum","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3105458518","title":"Fun and Useful, but","comment":"Been reviewing places and using app for 5-8 years (>50,000 readers). Lots of fun and very useful. However, i have two concerns. First is the advent of fake reviews. These guys owe it to community to invest a ton in preventing this. Second is somewhat excessive and pushy marketing tactics by sellers/tour company's, hotels, etc. operating through the site. All that notwithstanding, i recommend it highly.","rating":4,"reviewer":"@AtahualpaGroup","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3105423130","title":"Indespensible planning tool","comment":"We don’t take a trip or eat at an out of town restaurant without consulting TripAdvisor ahead for advice. TripAdvisor is also useful for prioritizing attractions to visit during a limited time at a destination. The ratings are consistently reliable, and carefully reading the reviews gives a good picture of what is actually good or bad about a facility. We particularly like discovering hidden gems of local restaurants that might otherwise be overlooked while on the road rather than stopping at familiar chains or the place with the biggest or largest number of billboards on the route. We have never been disappointed by a choice based on TripAdvisor.","rating":5,"reviewer":"Rolling Condo","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3104898930","title":"Dubrovnik Sea Kayak Tour","comment":"This was my wive’s idea & it was a good one!  I highly recommend it whether you’re fit or not (must be willing to exert some effort regardless) after 20 minutes the group divides into 2; easier & more effort.  In our group only four went on the easier route, my wife & I included, and it was terrific.  Metric & Marcos were our guides & not only did they lead / coach us through the water, they gave us all we needed on the history of Dubrovnik.\n\nWell worth it!!\n\nMatt & Sandy Oechsli","rating":5,"reviewer":"Matt Oechsli","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3104194977","title":"Issues since update","comment":"I love this app and use it for all my vacation trips but since the last update it takes 3-4 minutes for the app to load and open.  Another issue is that the app wont add items to a day when i try to add items.  I just get a blank grey window.","rating":4,"reviewer":"DeputyScott","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3103910114","title":"La mejor app de reseñas de viajes","comment":"Al que le guste viajar debe considerar siempre esta aplicación! Te ayuda a elegir los mejores hospedajes, restaurantes, atracciones que pasan al lugar que desees viajar!","rating":5,"reviewer":"B2B archie fan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3103697780","title":"I love that we can help each other","comment":"With what we experience as we travel. This app makes it so easy to check out what to do and where to eat and sleep.","rating":5,"reviewer":"EE@NC","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3100951792","title":"USA Guided Tours","comment":"My family and I had a great day! Saw all the sites of DC that we wanted to see.  Our guide Christopher did a great job and he knows his history. The bus driver Rahelle was very nice.","rating":5,"reviewer":"Elimarfox","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3100842269","title":"Bad and getting worse!","comment":"Not only is TripAdvisor a total funnel for their profit-sharing partners, now hijacking every search and ruining all credibility, now the interface has failed as well. Sidetracks your posts if you don’t allow it free access to your entire phone - THEN doesn’t save your posts once it has misdirected\nyou for its own purposes. I’ll be dropping the app.","rating":1,"reviewer":"Ssm5280","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3099091497","title":"N&S Taxi Amsterdam","comment":"One the worst experiences I have ever had in dealing with a cab driver \nHe changed $69 euro when his company had quoted about $33 euro.  He then proceeded to accuse the hotel who had made the reservation and been quoted a fee of lying to me.  He called the police to have me arrested. My wife, after watching him screaming, asked me to pay him to get rid of him.  If in the future you have no alternative but to use this company, l recommend you request and receive a signed statement before you set foot in their cab of exactly what to expect in terms of cost, distance and travel time","rating":1,"reviewer":"holycowthatsthepolicebehindme","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3096583137","title":"Great App...","comment":"I love this app and I would never book a vacation without consulting Trip Advisor! The reviews are always on point and usually give the reader insight into which excursions to book, which tourist attractions to see and which resort employees are good! I highly recommend this app to any travelers!!!","rating":5,"reviewer":"Tough2282","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3096555066","title":"Place to avoid","comment":"Nothing good to say. Just a question :is the family which owns the hotel is no longer interested in managing it, why don’t they sell ?\n45 minutes after arriving we had the bill !\nWe stood up to go to the buffet and when coming back, nothing left on the table : wine, napkins, glasses, knives, forks.\nAnd when we objected, they brought us back the glasses of wine from the kitchen !","rating":1,"reviewer":"a.wormser","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3096031513","title":"Latest update is not working","comment":"My iPad app won't work. Crashes as soon as I log in. I've reinstalled 3times, changed my password, logged out on all other devices, but it is still crashing. I have an older iPad, but  iOS 10.3.3, so it should work. Anyone else experiencing this? Warning: There is no functional help desk for TripAdvisor, so you are on your own if you have problems.","rating":1,"reviewer":"PK Seattle","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3095782648","title":"Nishapatel78","comment":"Good app","rating":5,"reviewer":"nishapatel78","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3095690563","title":"Motel 8 1213 Las Vegas Blvd south","comment":"This hotel is nasty and the don’t clean floors you walk barefooted and your feet will turn black  it smelled like pee and we had to Change rooms because the room smelled like someone smoked in them this is a non smoking hotel No one knows who owns the hotel the bathroom box springs were all tore up and hanging no wash clothes and only two towels the staff is as dumb as it comes the don’t have a continental breakfast like they advertise they don’t care about the customers while we were there they had people demanding there money back that’s how bad this is  My option is that the owner is nothing more than a slum liars and is never there even managers are not there and can’t be reached by phone it’s really a place to stay away from unless you want to get sick in one form or another","rating":1,"reviewer":"macwrc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3095128266","title":"Disappointing","comment":"I think it’s the worst app for the best project, the main idea is really useful and I use it very frequently, but the app is soooo slow , frequent sudden interruptions , really heavy on surfing from one thing to the other , I really wish that it get fixed soon because we need such a useful app to work on the best possible way.","rating":2,"reviewer":"Hadhood 91","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3095062147","title":"Easy to use, informative and it works","comment":"We have used this app while traveling, picking and finding a restaurant. It works and is easy to use.","rating":5,"reviewer":"Former NFL fan - We stand!","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3094830551","title":"Better than the website","comment":"I am a HUGE fan of Trip Advisor...HUGE! \n\nBut the website and app dated in the presentation and functionalities. \n\nSearching can be quite a tooth pulling task.","rating":3,"reviewer":"travelernatl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3092756329","title":"App works for the most part","comment":"There are a lot of search features which are impossible to use.","rating":3,"reviewer":"Pdlev","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3092257563","title":"Go to travel app","comment":"We use this app on our trips to find things to do and restaurants.  Easy to use and easy to review places.  The only thing is that some reviews are over 3 years old and the place may not exist anymore or people have obviously reviewed the wrong place and there is nowhere to try to correct this or send a message to the webmaster for corrections.","rating":4,"reviewer":"nomadrver","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3091345894","title":"Wine country walking tours","comment":"I recently had my sister in town visiting and decided to play tourist and signed up for wine country walking tours. When we initially met in the plaza, I was disappointed that our tour guide was not Harold, but that disappointment was short lived as I got to know Carol. Talk about fun and informative! And that girl knows her wines. I learned so much about my own hometown and the people behind The wine businesses. It was a great day and a wonderful way to celebrate a special occasion. Eat, drink, and be merry. What else could you ask for? Actually, I wouldn’t mind having one of those wine country tour tote bags that Carol was caring!","rating":5,"reviewer":"Jax 53","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3090398129","title":"Important and credible","comment":"Of the many websites around to review local attractions and restaurants, this is one of the most reliable. The reviewers include short bursts of their experience including pictures occasionally which shows the true essence of a place above and beyond what you can look up on the website.","rating":4,"reviewer":"wonthing","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3088775115","title":"Friendliest staff, cleanest and coziest rooms, reasonably priced!","comment":"This is a review for the best Western Inn at Facetock in Bandon,  Oregon. We stayed there in a recent vacation and had been there a year earlier too. We specifically came back to this hotel due to the friendliness of the staff, the coziness and cleanliness of the room, and the reasonable price. The hotel is across the street from the beach so we’d  wake up every day to fresh air and the sound of the waves.  Every day breakfasts , included in the price, were always delicious and carefully prepared with many options. The check-in-staff, the cooks, the hostesses, room service attendees, were all friendly, professional and made us feel at home. Kudos go to Larry, the manager there, Eileen, and the rest of the welcome staff, who gave us great suggestions as to places to visit in Bandon. We highly recommend staying at this lovely hotel if you’re in the Bandon area.","rating":5,"reviewer":"Unhappy Scrabble addict","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3088276182","title":"Helpful and glitch free","comment":"Trip Advisor app easy to use. Its nice for finding reliable reviews for restaurants and hotels when traveling. Its not the mist information but easy and quick to access.  Also finding local attractions like the Cadillac Ranch art installment near Amarillo TX.","rating":5,"reviewer":"CeMN44","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3088259733","title":"Best Travel App","comment":"Easy to navigate. Most comprehensive information of any travel app that I’ve used.","rating":5,"reviewer":"P Lech","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3087991735","title":"Skylonda Lodge","comment":"An amazing destination spa retreat where I spent 3 nights and 4 days in luxury accommodations in a “treehouse” amongst the Redwoods outside San Francisco.  Run by holistic Dr. Gabby, it is an oasis of body, mind, spirit rejuvenation.  She has put together an amazing team of experts including a gourmet organic chef, a top-notch nutritionist, fitness experts, massage and yoga experts, who guided our journey in quality instruction or workouts.  There are miles of forest trails, a pool and jacuzzi, a library and plenty of indoor and outdoor places to read or enjoy nature.  It is gated and quiet yet easily accessible from maintained highways and/ or San Francisco or San Jose airports.  I will definitely return.  I came home with a quieter mind. 👍","rating":5,"reviewer":"Chlydog","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3087708403","title":"Great app for finding food and entertainment.","comment":"I have never had a bad meal from any restaurant I have gotten off from selection from this app.  Reviews are accurate and plenty of information to make decision.  Always use when I travel.  It has not let me down yet.  I have only used the food and entertainment parts of app and cannot comment on the rest.","rating":5,"reviewer":"David from Maine","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3086811369","title":"Great traveling tool","comment":"This has to be the best app for anyone interested in traveling whether you’re traveling worldwide or in your own backyard. I cannot express how much I love and enjoy using this app.","rating":5,"reviewer":"Hopes10","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3086810059","title":"Difficult","comment":"When trying to write reviews this sit can be difficult to use. Usually takes me several times to fine the place I want to review. Ok trying to this and will not take my name. So frustrating!!Just take it. 8 times","rating":3,"reviewer":"jheppler","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3086788491","title":"My go-to app for travel and meals","comment":"I always Trip advisor to find attractions when I visit a new place. Even going out to eat in my hometown, I check Trip advisor occasionally for reviews and recommendations. I find it more accurate/real than Yelp.","rating":5,"reviewer":"Judzus","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3086641353","title":"Highest praise","comment":"I have grown to seriously appreciate the value of trip advisor. I find the reviews very useful. I think what is particularly important is the trip advisor does not edit or specifically delete reviews. In contrast, yelp will post some and delete others in a very troubling fashion. I know longer contribute to yelp because I think they have a hidden agenda; it might have something to do with purchasing advertising on their site. I'll stick with trip adviser. They are more honest and the reviews more useful.","rating":5,"reviewer":"Santa Klauz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3086292438","title":"Excellent travel  guide","comment":"I find the travel advisor app an excellent travel tool . I use it to find hotels,activities,places to eat when I make a trip. I plan my itineraries after I had browsed Travel advisor. The app is easy to navigate.","rating":5,"reviewer":"ccarin01","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3085455043","title":"Removal of rank in restaurant view","comment":"Why was rank “X” of “XXX” restaurants removed from the front page?  I don’t care how many reviews the place has or how many stars it rated, the only important metric is how it ranks against other places in the area","rating":3,"reviewer":"Asavakit","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3083896813","title":"My Treasure Map for Finding Hidden Gems","comment":"When traveling, Trip Advisor is my go to for finding the best local places to visit, restaurants, and hotels.  We have eaten at some amazing places that we would never have found without Trip Advisor. One was in my husband’s hometown!  The app is easy to navigate. Highly recommended.","rating":5,"reviewer":"CyberDolls","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3083753625","title":"Has gotten too commercial","comment":"Very ad driven","rating":1,"reviewer":"nbk212","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3082826036","title":"Love this app but use improvements","comment":"I use this app almost every time we go to a new city to find what food is good and where to eat. That being said there are some improvements I would like to see. \n1. For vegetarians and vegans the app can be a little difficult to navigate. One change I would like to see is in phrasing and searching filters. There is a difference between vegetarian/ vegan restaraunts and a restaurant having vegan/vegetarian options. The app currently does not show the difference which can be vexing. \n2. Another change I would like to see is in the search. Often times i go on here to find food between point a and point b but currently there is not a way to search along that route or slightly off from it. Yes you can go through each address and see but for tourists this can be difficult and additional time to your task. \n\nIt’s a good time to mention that even if these changes don’t occur I will keep using the app but it would be nice to see a change to help support those of us with different diets. And not just non-meat eaters but, gluten free eaters, paleo people or even those that have a lot of allergies to food such as nuts, milk, eggs and more.","rating":4,"reviewer":"Teddy bear babe","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3082430497","title":"Bev Magness","comment":"This is the 2nd time we have stayed here. Nice accommodations and very friendly and helpful staff.","rating":5,"reviewer":"Peppy12345","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3081968031","title":"Good but room for improvement","comment":"I love this app. I literally use it everyday and we are on the road legit 280-300 days a year so I review from all around the world. It certainly helps me decide where to go/stay and hopefully I’m helping others as well with mine. That said. You do need to take a page out of yelps book where you can respond as sometimes you have management responses and if I’ve forgotten a certain employee name that did great or not so I’d like the option to respond. Also, YOU NEED TO ALLOW US TO EDIT!!!  Sometimes the place you visit was positive/negative and you review. The next time is the opposite and I’d like to add to my review like yelp allows. Otherwise it’s a great app to help other travelers. Thank You","rating":4,"reviewer":"Top contributor","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3081762098","title":"Best app EVER","comment":"I’ve used TripAdvisor for years to help me plan trips. I wouldn’t have had near as much fun without knowing the best places to go! Thanks for all you guys do!!!","rating":5,"reviewer":"Jesssicakelley","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3079610538","title":"Townsend Hotel in Birmingham Michigan over rated","comment":"I booked my room in May for this weekend. 2 days ago I received an email from manager welcoming me on my upcoming trip and please let them know my arrival time etc.   So I did. I received an email back saying I had no reservation. Could it be under a different name. No- was my response.  Another email - could I send my confirmation number. I did and then I called to see what the problem was. Oh- no problem, the reservation was there. Great. I arrived and checked into my beautiful room. I will attach a picture of my view. All is great. At 9pm, loud and horrible music starts. I called desk to complain. Oh- it’s a wedding. We have them every week. Great. I wasn’t told about this. Did I want to move - no - it’s 9 pm. I’m unpacked and ready for bed. Manager on duty was guy who couldn’t find my reservation yesterday. He’s very nice, but for $500 per night- no thank you. I wished I had stayed at the airport. Said I could move tomorrow. Another inconvenience.","rating":1,"reviewer":"beviebeach","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3078917777","title":"Wee food tour","comment":"I came to Glasgow to taste the history & culture and that is exactly what I got with some awfully good company along the way. Maddy is a charming host that took me into the heart of the city I would never have found on my own!  You will find your time & money well spent on this delightful tour💕👍🏽","rating":5,"reviewer":"mrs hoogins","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3078870598","title":"3 hr trip of city or tours northwest","comment":"Betsy was the guide Thursday am\nShe was accommodating and very knowledgeable. Wonderful time!","rating":5,"reviewer":"kmsat8@gmail","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3077721225","title":"Helpful","comment":"Actually non-biased","rating":4,"reviewer":"des7682","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3076712866","title":"Very helpful","comment":"Although I don’t travel much.  I do like the my trips portion at least you can create a list of what you want to do, where to eat, and where to shop.  Then all you have to do is go to that list and write your reviews for the places you have been. It also helps to prevent going to places that have poor reviews. One thing that I need to remember if I find a place that is outstanding to add it immediately. We stopped late at night at one place they were awesome but couldn’t remember who they were. The reason for only 4 stars is that I have found places that are not listed. One that I wanted to give a good review and another that I wanted to give a poor review. Overall I have been enjoying using this app for about 6 years and am really making an effort to review locals to assist our visitors.","rating":4,"reviewer":"Beth Meier","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3075512175","title":"No zip code search","comment":"Can’t search in a zip code","rating":1,"reviewer":"Lav in Seattle","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3075062958","title":"Keeps bothering me for a review.","comment":"Very annoying app. Keeps asking for a review.","rating":1,"reviewer":"charles4515","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3075000995","title":"Indispensable for Travel Planning","comment":"Read the good and bad reviews of any hotel, restaurant, tour guides and destinations BEFORE booking. \nI have been using TripAdvisor for over 20 years and have never been disappointed. Truly the best Ap for travel planning!","rating":5,"reviewer":"travel tart","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3074166279","title":"Extreme eco park (atv, zipline, cenote) mexico","comment":"Crew was great.  Staff was very friendly, helpful and patient.  Taco snack was also delicious.  Had lots of fun doing all the activities.  Better than expected and would do over again","rating":5,"reviewer":"nja79","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3073906003","title":"A favorite app for do it your self travelers","comment":"I can always depend on trip advisor for recommendations for restaurants, what to do and accommodations in far off places.","rating":5,"reviewer":"Took my money again","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3073731870","title":"Awesome","comment":"I rely on this app no matter where I am going.  It has never failed to give me an accurate review of any establishment.  This is a credit to the many other users who take the time to do a review each time they go somewhere.","rating":5,"reviewer":"Educator_4_Life","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3073452679","title":"Not Always Accurate Restaurant Ratings","comment":"Read restaurant reviews but BEWARE. You’ve got to take some reviews with a grain of salt. If here on vacation, get up with the hotel staff or locals. You’ll be happier than following some of these reviews. I’m a harsh food critic. I also hate wasting my money on crappy food, too. Not every review on here is accurate. Some places are down right scary.","rating":3,"reviewer":"CSICowgirl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3072975997","title":"Best travel app ever","comment":"I can’t tell you how many people ask me “How did you find this place?” Or  “You always go to the coolest restaurants!” But it’s all from reading TripAdvisor’s reviews and customer photos. It’s so much better than Yelp with all it’s annoying ads. And now you can even see bed and breakfast or private rentals for the night.","rating":5,"reviewer":"jgodwinna","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3072865043","title":"👌🏼👍🏼","comment":"Mrs Sue wazz so beautiful and nice!!!! LilGucci33!!😝","rating":5,"reviewer":"lilgucci33","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3071594835","title":"Villa Carmen - Opatija","comment":"My family (8 people)have just enjoyed this spectacular villa overlooking Opatija! Fabulous setting with loads of room to spread out around the beautiful pool. Owner was most helpful and friendly meeting each request with charm. Villa is beautifully decorated with high end furniture and great quality bed linen too. Our wee dog enjoyed the walking trail (2k)under trees that starts at the back gate to the property. Loads of great restaurants in town plus big Spar and Lidl filled our shopping needs. Having a self contained flat as part of the villa really pleased our son and his fiancé.","rating":5,"reviewer":"Vienna-Brit","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3071274680","title":"find your location feature","comment":"I would like for the app to locate your location for reviews instead of always having to search","rating":4,"reviewer":"former online user","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3070795208","title":"Research Anywhere!","comment":"I use this app all the time, not just for planned trips but to learn about other places. Am reading a book about the Dust Bowl in the USA, looked up cities that were named and was able to add to the books experience. This app is a must-have for anyone wanting to explore and potentially visit other spots in the world.","rating":5,"reviewer":"Dreadpirate Patty","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3070469063","title":"Royalton Myan Riveira","comment":"We recently went on vacation July 29 and returned on August 5 2018. We were seven family members and stayed at the Royalton. The resort was very clean and beautiful. We went with the Diamond Club and was very pleased the way we were treated. We had two butlers who were very caring and couldn’t do enough for us. Katerina and the gentlemen that was with her I can’t remember his name I think it was Nundo were wonderful. The food was delicious and a big variety in the buffet for breakfast and lunch. The restaurants were very good and the people are nice and pleasing. The pool is very clean and workers around the pool are wonderful. We didn’t have to make any reservations for dinner the butlers did it all for us. Always had clean towels in the rooms and by the pool. We had top shelf alcohol and plenty of it. We didn’t go in the ocean because there were a lot of sea weeds that was the only thing we didn’t like about the resort. We will definitely go back. They are opening other Royalton Resorts in other places. We would like to try a different Royalton other than Mexico!! Soooon.","rating":5,"reviewer":"redyeastrice","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3070093318","title":"Great for travel but need performance enhancements","comment":"I always find neat info about place I'm going to on trip advisor. I like having all info in one place and enjoy community reviews. One gripe is that it is slow to open and update takes forever. Also when you click a link from google search it tries to open the app whether you want to or not - let me decide since the app is so slow","rating":4,"reviewer":"GalinAZ","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3070018865","title":"Great travel resource!","comment":"I never travel without consulting TripAdvisor!","rating":5,"reviewer":"texasgirl75","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3069861201","title":"Would like a few updates for writing reviews","comment":"I like using trip advisor to help plan trips for leisure.  Because trip advisor has helped me I also like writing reviews to help other travelers.  \n\nI’d like the app to have a choice of families without kids (or adult children) as a choice when reviewing activities like museums, amusement parks, etc.  \n\nSometimes when writing a longer review while using an iPhone the text I’m typing is not always visible. I also have no idea what the points mean or if you can do anything with them.\n\nOther than those two minor details, I find the app helpful.","rating":4,"reviewer":"Leslie Christensen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3069714060","title":"Trip Advisor No More","comment":"Trip Advisor used to be our go to site. It has now become a huge joke and a waste of time.  Whatever algorithm they supposedly use, is pointless.  There’s no way to even know that people have actually experienced a place and every jackass tourist who has a complaint now threatens businesses with a bad review if they don’t get their way. Don’t waste your time. Stick to sites like Open Table and Air BnB where only actual customers can write reviews instead of people who have never even visited a place.","rating":1,"reviewer":"TANoMore","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3069169779","title":"Freezes and crashes","comment":"The app constantly freezes then crashes","rating":1,"reviewer":"acomens","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3068133906","title":"Great Service and Referrals","comment":"Thank you, Trip Advisor, for creating a platform where real people review real businesses. Thank you also for assisting so many individuals make an informed choice based on actual experiences. Although I DO wish the individuals with BAGGAGE could be removed from the equation AND ALL reviews more than 5 years old would be eliminated, I still think that what u offer with TRIP ADVISOR is a much needed service!","rating":5,"reviewer":"salty3salty","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3066362689","title":"Raw sewage flowing into the Split, Croatia harbor","comment":"Arrived in beautiful Split Croatia this morning and was concerned to see and smell a large flow of raw sewage pouring into the harbor. Is this a regular thing? How is it affecting the marine life? Is it safe to swim? Are they going to do anything about it. Very sad to see and Smell","rating":1,"reviewer":"crowdog jones","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3065898248","title":"تطبيق ممتاز","comment":"من افضل التطبيقات الخاصة بخدمات السفر\nيجمع كل احتياجات المسافر من معلومات او فنادق او مطاعم \nعند زيارة اي دولة لاول مره لاتنسى اخذ فكره عنها من خلال هذا التطبيق","rating":5,"reviewer":"Alsahali","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3065067901","title":"com.tripadvisor.error Error 242","comment":"I get this error trying to log in, but searching the help center doesn't produce any hits. My password works when logging into the site on my laptop.","rating":1,"reviewer":"Flash3581","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3064948097","title":"Small group trip to wineries","comment":"Tour was very informative and great. Our tour guide, Anthony, was excellent with a good sense of humor. Will recommend to friends and relatives.","rating":5,"reviewer":"Nitz of San Francisco","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3064615474","title":"Schaferstube","comment":"Delicious food, family run restaurant in Zermatt","rating":5,"reviewer":"meme crow","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3060758126","title":"Best planning app","comment":"Best planning app","rating":5,"reviewer":"Andrecavah","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3059479043","title":"Saved cities should be available off line","comment":"I’ve used the Trip Advisor app for over 6 years. There used to be self walking tours that one could follow off line. I used one of them extensively to find my way back to my hotel when WiFi was not available. \nNow I can make my own in My Trips, but it’s not available to me when I am offline. This frequently happens to me when I am traveling out of the USA.  I download the city map, but I haven’t found how to download my saves so I can find my way from one saved spot to another. This makes it difficult when I’m walking somewhere that I don’t speak the language. \n\nThat said, I do love the app and use it to select sites and evaluate hotels and restaurants. I can eat at those restaurants only when I can remember where they are, since I can’t find my trips when I’m offline.","rating":4,"reviewer":"Linda's a cruising","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3059298687","title":"Best for travel advice","comment":"The app is great for sightseeing and food/drink advice. Downloadable guides are great too.","rating":5,"reviewer":"iTunesNYC","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3059172250","title":"I can’t write my own review!","comment":"We stayed in a Marriot Residence Inn with good reviews in Montreal and I was disappointed with the overall amenities and hotel features. Unfortunately, the didn’t allow me to write my own (bad) review!:(\nDeleted and replaced!!!","rating":2,"reviewer":"Jclandi","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3059158005","title":"Keep improving this App it’s a great tool with much potential.","comment":"TA is a very useful tool when traveling. I enjoy sharing insights gained by my own travel experiences and will often offset the reviews of other unfavorable or overly favorable reviewers. This app should have a rewards system - not sure what that would look like.","rating":4,"reviewer":"iDocJC","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3059029751","title":"Harding Restauranteur","comment":"Trip Advisor is another tool used to help me manage my restaurant in meeting our valued guests expectations.  There is nothing worse then waking up to a negative review. It effects our stomach. \n\nBut .... we encourage feedback while in face person to person and not everyone feels comfortable with doing that!\n\nTrip Advisor helps us meet & go beyond expectations and keeps us on our toes!","rating":5,"reviewer":"ww23","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3058336366","title":"Reliable Guide","comment":"This app has saved me! It pointed out bed bugs in high-range hotels. In one city I drove 15 miles to find bed big free hotel! You can count on the reviews!","rating":5,"reviewer":"GoYeGuy","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3056380148","title":"Review","comment":"Have been using Trip Advisor for about 5 years now and really like using the app.  I try to add reviews, both good and bad, for restaurants, campgrounds, hotels and attractions in various places we visit throughout the country.  I try to give the kind of information in a review that I would look for when reading reviews.  The app is helpful in making some suggestions about places reviewed.  I will continue to use, and read, Trip Advisor.","rating":5,"reviewer":"Baw9451","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3056033128","title":"Marriott Marquis","comment":"This is a great hotel.  It is close to all the major theaters and offers great views of Time Square.  But what really separates this hotel from others is the service provided at the front desk. In particular, Front Desk Manager Maureen Hall.  She is the consummate professional.  I am Marriotts reward customer, and she made sure I felt special. She took her time to find me the best room available and made sure all my concerns were addressed.  She is a tribute to Marriott, and a blessing to hotel visitors.","rating":5,"reviewer":"Odysseus 2000","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3055705038","title":"Jet Boat","comment":"This is a must do!!!","rating":5,"reviewer":"Qoe100","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3054795963","title":"Trip Advisor- my travel friend","comment":"This app and I have gone to India, Ethiopia, all over the US... I found a guided horse ride in Addis Ababa- even local friends didn’t know about it and it was incredible. The app is consistent, solid and well maintained. Kudos to Trip Advisor!","rating":5,"reviewer":"IamCowgirly","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3054460362","title":"Plan first before you pack","comment":"Try to always check for ideas on favorite places to visit, cross check reviews on lodging with other sights. Very valuable for planning trips.","rating":5,"reviewer":"MJRarts","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3054360958","title":"Hilton Head Creek Cat","comment":"My husband and I went on this excursion the other day and it was a blast! I would recommend it highly to anyone; the weather was great and views just beautiful. Our tour guide, captain Kim was fantastic; I highly recommend trying it out!","rating":5,"reviewer":"NancyT17","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3053189425","title":"An indispensable travel companion","comment":"If it had been around in 1492, Columbus would have have found his way to India and the best naan in town. This isn’t a travel app, it’s a magic memory creator. Never leave home without it.","rating":5,"reviewer":"UsuallyJB","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3052072540","title":"My “go to” travel  app!","comment":"I use it soooo much, my family will ask “what does trip advisor say about this place?” Before we venture in! We are enjoying this useful app","rating":5,"reviewer":"Sejw","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3051650042","title":"MidLakes Navigation - Skaneateles Dinner Cruise","comment":"This was not my first dinner cruise on the Judge Ben Wiles, but I have to admit I was totally disappointed.  But let me preference this with saying the food was EXCELLENT!   When I called for reservations I was told there were 34 openings, therefore I requested  a window table for the four of us and was told it’s a first come first served basis. Figured we’d be safe getting a window table with that many available seats. Guess not! Our table was in the middle and we got bumped constantly from people walking back to go out for a smoke.   The gentlemen next to us - at a window table - said when called he was told there 24 seats available. Hmmmmm!  \n\nThe service was sub- par.  After all the other tables were asked about beverages and served, we had to flag down a server and ask for ours.   We then asked for paper plates so we could eat the cheese and crackers we ordered along with the bread. At first she said there weren’t any, then she realized that there were some left over from the lunch cruise and brought 4 over. Seriously! For $57 p/p I don’t think it would be to much to ask for.  The same with dessert - we had no place to put our cannolis and chocolate covered strawberries while  eating them other than one small corner of the community serving dish. No one even came over to ask if we would like coffee. How could they miss us - we were crammed into the middle of the ‘dining room’.  When we received our bill - we owed $14.00 for our sodas and ice tea.  We handed the server $25. which she took and came back stating we still owed $14.00. What?!?!?  Ok - it was only an $11 tip but we were not in a restaurant where our order was taken / served and check on to make sure everything was ok.  All the other tables were asked if they would like water - not ours. We were like the forgotten / invisible table.   So she did her job in embarrassing us, so we coughed up another  $15 and handed it to her, very politely when we left.   We are normally far from cheap tippers - we are usually 25% - 30% of the bill - but with no service other than dropping off our pre-ordered meal and not a smile on anyone’s face -  we did not feel a exorbitant tip was due. \n\nThere were singers in the park that Friday night and as the Capt was giving his boarding instructions they started their songs and no one could hear what he was saying. The dock people were even shaking their heads in disbelief.","rating":4,"reviewer":"Cruising Diva","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3051473234","title":"Love this","comment":"A couple of years ago I started traveling a bit for work and found myself constantly in new areas. Not knowing where to stay or eat I hit the internet and stumbled across Trip Advisor. Now I don’t remember how I functioned without it. I use it for work travel, family vacations, weekend adventuring, finding new places locally etc. plus I can review my own reviews if I can’t remember if I liked a place.","rating":5,"reviewer":"AevalAmore","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3051342154","title":"Makes travel easy","comment":"I travel with my family a lot and it’s a lot of stress to bring 6 people to places we’ve never been. Trip advisor helps us find hotels, restaurants, and things to do.","rating":5,"reviewer":"Mlieby","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3050998555","title":"Top Nothch","comment":"This is my go to travel app","rating":5,"reviewer":"SumnerCitizen","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3050761632","title":"Love it","comment":"Best site ever. Do use","rating":5,"reviewer":"naharkamal","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3050435345","title":"Sheraton airport hotel","comment":"We have been very pleased since returning after being away for over 10 years.  Service has been outstanding.","rating":5,"reviewer":"Butlered","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3050205740","title":"The Hotel Flag is an awesome place.","comment":"I was first impressed by their customer service and then I was very impressed by the room and the modern appointments to the entire suite.  I really appreciate the staff for making my stay memorable.","rating":5,"reviewer":"sfensrb1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3050142980","title":"Worthless for my next trip - meal filter does not filter","comment":"I was looking for a place to meet family for breakfast in Brooklyn Ohio next weekend.  I have found TA to be generally helpful in the past for such searches.  Not this time.  I am looking for a BREAKFAST place, instead I got 214 restaurants & bars.  My guess is maybe 10% actually serve breakfast.  I don’t really have time to sort thru 214 places when 90% clearly do not meet my first criteria, that is open when at the time I need a restaurant. I figured OK I’ll wait until breakfast time and try applying the “open now” filter and I still got the same worthless list.  I wonder if TA gets paid by the #’s they list.  If so, I can understand their logic but that logic only drives me to other sources.","rating":1,"reviewer":"Rick26.2","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3050097148","title":"Won’t let me see what I can do around me","comment":"I’m in a small town, I want to see what there is to do AROUND my town. I’m down to drive where ever to take my family out to have fun but when I type in my town, it only lists what there is to do IN town(which is absolutely nothing). There needs to be an option that will let me see all things to do within a 10-50 miles radius. This app is useless without that to me.","rating":1,"reviewer":"Brooklymsummer","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3050038470","title":"Biased recommendations from the app","comment":"Unfortunately, the results from the TripAdvisor app seem misleading biased towards events that generate revenue for the company, than an objective service.  I recently visited a museum that was free.  When I looked it up on the app, I was recommended an $88 walking tour with no mention that the museum itself was free","rating":1,"reviewer":"ccd16","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3049996351","title":"Omelettes, breakfast","comment":"A great place for good omelettes. Good value for money!","rating":4,"reviewer":"Izel00","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3049753677","title":"The old display","comment":"Just getting back on after s while, and noticing a new appearance. It seems the important stuff on here had been covered up with ads, and it’s harder to find what I want. I like the old display.","rating":3,"reviewer":"jchoberka","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3049748370","title":"Great App","comment":"Easy to use to locate hotels, restaurants, and things to do.  Wish I knew how to ask questions about a specific area, and how to locate recommendations for family with children trips in the USA.","rating":5,"reviewer":"Lauabcdefg","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3049550979","title":"Princess Royal ocean City Maryland","comment":"I had a great week there nice people A special thanks for a great job from Naomi our cleaning lady for a very good job","rating":4,"reviewer":"Broadbecky5512","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3048032187","title":"Duneland Beach Inn","comment":"Stayed in the “captain’s quarters”  suite which is bright, airy & luxuriously appointed. The gourmet restaurant offers inspired, creative entrees, salads, soup, appetizers & deserts.\nLocated just 1/4 mile from  an immaculate beach featuring sunset views of the Chicago skyline 35 miles to the west.","rating":4,"reviewer":"Romanround","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3047802212","title":"Trip Advisor reviews and recommendations are the only ones we trust.","comment":"We always use Trip Advisor to check out new destinations and give feedback to places visited.  This is a great tool to keep people informed and push the owners to meet the customer’s expectations.  Trip Advisor reviews and recommendations are the only ones we trust.","rating":4,"reviewer":"Sherretz Family China","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3047058663","title":"Our go to travel app","comment":"We travel quite a bit and count on TripAdvisor for all our travel needs! We get great info from restaurants to shopping, must sees to nightlife. We appreciate all the good folks that take the time to review all these places! Hope ours return the favor!","rating":5,"reviewer":"PC SnoMan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3046805709","title":"Comfort Inn The Gorge in The Dalles, OR","comment":"Amazing front desk staff, assisted us pleasantly when my husband could not navigate the stairs to our upper level room. Moved us to a lower level room with a smile. Metta is a gem.\nThank you for a great stay.","rating":5,"reviewer":"Laurio64","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3046248962","title":"Supports liberal causes-poor business choice","comment":"Another business that has decided to support the zeatheist of radical liberal causes when it should stick to serving all its customers rather than offend half of them.","rating":1,"reviewer":"Allenjbj","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3045923013","title":"Lobstaaaah!!!","comment":"Great meal of FRESH lobster, delicious, moist haddock, lightly buttered with fresh cut potatoes. \nFriendly Waitress made for a fun lunch!","rating":4,"reviewer":"Elaine loves birds","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3045655606","title":"Regular user","comment":"I’m a big TripAdvisor fan and find myself using the app regularly even for local suggestions.  Easy to use.  I’ve never booked trips with them - just use it for reviews and suggestions.","rating":5,"reviewer":"Awsic","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3044565576","title":"My go to travel planner","comment":"We love Trip Advisor.  Have found so many wonderful places to stay and dine.  Easy to use and you can book your stays through the app.  One stop shop.","rating":5,"reviewer":"macmo219","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3043045325","title":"Book Restaurant table and nightclub table","comment":"I wish can book a table online through TripAdvisor, so I won’t need to wait for the table outside the restaurant or nightclub. I would definitely use this app all the time If i can book tables through this app.","rating":5,"reviewer":"big fan of minus (old version)","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3042900884","title":"Always use!","comment":"I never plan a trip without consulting Trip Advisor and reading the reviews to get insight into the places where I’m traveling. I almost always book from the hotel’s website but I consider Trip Advisor a trusted friend and never leave home without it!","rating":5,"reviewer":"nansworld","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3041307337","title":"Tasca  46 Avenue de Suffren, Paris","comment":"This Italian restaurant in the Eiffel Tower neighborhood is a gem!  We ate dinner 2/3 nights there and discovered it by accident.  The special salad with greens, beautifully sliced mushrooms, delicate dressing with a sprinkle of Parmesan cheese is fantastic!  And the 2 pasta specials we had were superb:  both cooked al dente.  Not to be missed!!","rating":5,"reviewer":"BarneyGingie","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3041283516","title":"Highly recommended","comment":"I love this app! Easy to use!","rating":5,"reviewer":"Landmarc","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3040638785","title":"Very Useful!","comment":"Over and over we have found the TripAdvisor App very useful. Gives us up to date reviews and opinions on hotels, restaurants and attractions. We rely on it a lot and have found places we’d never have known existed without it.  We like to eat at non-chain, locally owned restaurants and this gives us a guide to places we want to try. We are often very pleased with our “finds” while traveling!","rating":5,"reviewer":"lindakimberley","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3037586622","title":"Our Go-to guide for every vacation","comment":"Reviews are always helpful and accurate and have helped us choose the most reasonably priced hotels, restaurants and their bags to do with helpful hints that save us lots of time and headaches","rating":5,"reviewer":"Eliminated","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3037466630","title":"ONE Cabañas","comment":"Complejo de Cabañas Patagonicas ubicadas en el único barrio privado en Los Antiguos, Santa Cruz.\nDistintas opciones de cabañas con 1 dormitorio, 2 dormitorios y Estudios.\nIdeal para ir en pareja o familia, con acceso privado al Lago Buenos Aires, donde podrán disfrutar de la pesca, caminatas a orillas del Lago o simplemente tomar fotografías de la Cordillera.\nUbicadas a 2 km del centro del pueblo y a 2 km del paso fronterizo a Chile Chico.\nCabañas construidas con Troncos de Pino Oregón y una decoración exquisita!!!!\nCamas 2x2 con sommier y la mejor ropa de cama y almohadas para diferentes necesidades.\nAbierto todo el año.","rating":5,"reviewer":"Emma y Vera","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3037215370","title":"LaurieM33","comment":"TripAdvisor is my go-to app prior to planning any vacation, from hotels and restaurants to unique experiences!","rating":5,"reviewer":"LaurieM33","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3036779739","title":"Love Trip Advisor app!!!","comment":"The only problem I ever have with this app is when I have poor cell service, I can’t use it! \nHighly recommend. I use this app all of the time. Love it.","rating":5,"reviewer":"alisonkates","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3036403367","title":"Trip Advisor","comment":"I have travelled the world too many times to count, but since Trip Advisor came on line, it is usually my first stop for word of mouth.  Once one ground I might go elsewhere but the reviews are usually spot on. Can’t go wrong, thanks for the help, where were you 45 years ago, lol.","rating":5,"reviewer":"Learning something each day","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3035577893","title":"Las Vegas Super Saver Madame Toussaud And Gondola Ride","comment":"My husband and daughter and I had a great time at Madame Toussaud Wax Museum In Vegas based in The Venetian Hotel!!!!  We kidded around and took pictures with the celebrity look-alike Wax figures!!!!  Also don’t leave Madame Toussaud without seeing the 3D Mini Movie!!!!  It was “way cool”!!!!\n\nWe also enjoyed the Gondola Ride also in The Venetian Hotel.  This was special to us because our son proposed to his girlfriend in Gondola Ride in The Venetian Hotel last year!!!!  We loved seeing where our son proposed!!!!","rating":5,"reviewer":"Shonna Lee","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3034446225","title":"Very useful and helpful","comment":"Iam using this app since 2016 and its really good and helpful app\nThanks","rating":5,"reviewer":"Sinan d","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3033806027","title":"Latest app update is disappointing","comment":"The app was good until the recent update. The filter function now has a bug, filter by Hotel Class is no longer functional!","rating":1,"reviewer":"tripandbeyond","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3033411172","title":"Been a trip advisor user since it began!","comment":"Prefer thisApp over all others I have tried! Usually the most honest and reliable reviews of restaurants and hotels and for directing me to the best airfares! Also use the things to do list to choose activities in the areas I visit! It has become a little confusing at times. I miss the old days when you could pull up a location and immediately see reviews  and Listings by rank based on customer reviews only and not on sponsored advertisements! Will still be an advocate user anyway!","rating":4,"reviewer":"oldfaithfuk","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3033194960","title":"Good for honeymoon planning !","comment":"We am going for our honeymoon and this app helps a lot. The ‘things to do’, community, reviews are good.","rating":5,"reviewer":"anvarjam","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3033127197","title":"Loud and crowded atmosphere!","comment":"The food was good but the atmosphere was HORRIBLE! His/her restrooms right off the dining room. Tiny tables, no soft music to keep the conversations down.  You have to scream to have a conversation because it’s so small and everyone is talking over each other. The tables are so close you can’t move. The service was good but the atmosphere was so disturbing you can’t relax to eat.","rating":2,"reviewer":"gahanna 1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3033090023","title":"White Sands- Jamaica- Marlon Harris","comment":"Tour guide Marlon Harris, at White Sands is the number one tour guide in Jamaica. Honest, entertaining, knows the best spots for day trips, great driver, awesome air conditioned van! A must know guide for Jamaican tours.","rating":5,"reviewer":"Cutiepie0136","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3032821104","title":"The “Go-To” App for Trip Planning","comment":"I always consult Trip Advisor when planning any trip, whether a short weekend trip or researching a resort or hotel stay. I love being to read through a customers eyes or see from their point of view. The Map View also helps to see what attractions and restaurants are within walking distance or a short ride away. I have also used the booking capability of the app as well, knowing that the pricing is competitive.","rating":5,"reviewer":"ChiTown Thomas","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3032810817","title":"Combo Alcatraz and city tour SF","comment":"Our guide during the city tour, SodaPop was funny and informative. Day on the he uncovered top and experienced it all.","rating":5,"reviewer":"AZwash","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3032549320","title":"Travel","comment":"We found trip advisor very helpful when traveling. We do a lot of road trips and\nUse trip advisor for hotels, restaurants and attractions. Reading people's reviews has not steered us wrong yet. Now use trip advisor all the time","rating":5,"reviewer":"Nsnrjfkmancjrbgkid","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3032528034","title":"Features Gastro Pub, Gibsonton, fL","comment":"Great Place to eat before a movie. Located inside the movie theater.","rating":5,"reviewer":"brucelav","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3031840330","title":"BS IF TRIP ADV SENSORS!!","comment":"What a BUNCH OF BS!!! TRIP ADV HAD TO REVIEW YOUR NEGATIVE COMMENTS AND DECIDE IF THEY WILL POST SO REVIEWS ARE A BUNCH OF BS   ALSO IF A BUSINESS COMPLAINS THEY DO NOT LINE YOUR NEGATIVE REVIEW TRIP ADV WILL TAKE IT DOWN \nLIES LIES LIES DO NOT BELIEVE THIS AP!!!","rating":1,"reviewer":"TRUTH REVIEWS101","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3031666653","title":"Great app!","comment":"I always use trip advisor when I plan a trip. It has been fairly accurate when I’ve used it. The only drawback I’ve found is after I write a review and it has posted, the reviewed party may give feedback regarding my review. While this is expected, I don’t expect my review to be called inaccurate or made up and not have any way to defend my review. I wish I were able to address this issue with the party I’ve reviewed. One place in particular has basically called every negative reviewer a liar, claiming they made up things to put them in a negative light. When in fact multiple people gave the same reviews! I have pictures to prove myself if I write a negative review I don’t appreciate being called a liar and not being able to defend myself. Knowing this, I fully intend to document anything I may say in my review with pictures to prove my assessment of future places.","rating":4,"reviewer":"ZX6girl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3031426095","title":"Siam Bayshore Hotel and Resort, Pattaya, Thailand","comment":"Siam Bayshore is a five star stress reducer.  The architectural design of the buildings, gardens, swim pools, fountains and ponds are so great, that you wonder, if by someone else’s hand, that the designers may have had many spiritual awakenings while creating this place.  Many of the plants have attached botanical name along with what remedy or medicine it may be used for.  \nThe staff, from bell men, desk clerks, dining staff and all others add to in making the Siam Bayshore a destination to treasure.\nI have stayed, maybe 7 times in so many years.  My last 5 night stay was recent.  From check in to check out...easy and comfortable.  What minor requests ( room location ) Tina, of  main desk, accommodated the change graciously, furthering always Siam Bayshore’s making my stay flawless.  Please add, the breakfast buffet is perfect...tiny amount of many along with a fruit smoothie, little ice and no liquid surgery, provided al the fuel for my swimming and walking day.\nAdded Note: the PH for swim pool water is daily posted ...no chlorine /acid surprises.  Makes Siam’s two large pools amongst the best.  \nI recommend for all, except those that need a party party atmosphere.","rating":5,"reviewer":"red abalone","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3031010655","title":"Before any vacation: Trip Advisor It!!","comment":"That what i do before going pretty much every where","rating":5,"reviewer":"zuppaduppa","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3030846738","title":"My go to for reviews!","comment":"Always accurate and well presented information on area establishments.\nMy go to for information when I travel and for locally.  I have found some true gems locally through TripAdvisor, as well as when traveling! Highly recommended app!!!","rating":5,"reviewer":"JMPur","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3028881800","title":"Villa del palmar","comment":"We loved the hotel and the service is top notch. From the moment we check in we saw smiling faces. The employees obviously enjoy their job. We will be back in 2020. All employees were excellent especially the waiters at the pool. We loved the energy and enthusiasm of the activities coordinator and his assistants. Only complaint is that travel agency wasn’t real clear on best and worst excursions. We had to find out the hard way and waste out money. Loved scuba instructor in pool giving free lessons. It made me enjoy and book scuba trip with him. Restaurant were great especially sushi bar . We ate there 3 nights in a row. Definitely going back","rating":5,"reviewer":"villa del palmar cancun mexico","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3028863309","title":"Shelby’s Tours—great fun","comment":"My friend Lulu and I had a great time buzzing around Sydney with our guide, Mark!  He made the tour interesting and fun despite some soggy weather—we even visited a coffee bar and heard stories of King’s Cross.  Mark loves Australia—evident through his knowledge of Australian history.  A must do in Sydney","rating":5,"reviewer":"saralowman","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3028581966","title":"Viking Cruise, “Paris to Normandy”","comment":"Great cruise experience! Beautiful, delicious food! Found lasting friendships. 183 tourists on board! No kids! Excellent wines! Well organized land excursions! Paris, Monet Museum, Bonaparte’s home, Notre Dame Cathedral, Omaha Beach! Interesting, fun, & relaxing!","rating":5,"reviewer":"Cruise Critic","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3027441455","title":"Stop over","comment":"We usually stay in the Duluth/ Superior area when traveling to Minnesota. We did have a good stay while here. The staff was extremely helpful, our room was clean and the breakfast was what I expected. Would stay here again.","rating":4,"reviewer":"MyFamily1990","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3027390378","title":"Reliable without Revenge","comment":"Good and positive reviews with suggestions instead of whining to get a check comped.   Reliable.","rating":5,"reviewer":"Ken-Kinja","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3027340880","title":"Over Priced Go to Cracker Barrel","comment":"Meatloaf very dry. Slaw dry. Chicken just okay. Tea very good. The tea was the best thing. We will not go back.","rating":2,"reviewer":"Macipoo2007","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3027197517","title":"Nice App","comment":"We use this app everywhere we travel and have found all reviews helpful. Anymore we check even before going to place we have been too in the past to see if it’s still the same. Thanks and keep up the good work on the app!","rating":5,"reviewer":"FitzMarine","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3027109826","title":"Diferencia app web","comment":"Buena plataforma para informarse siente hoteles restaurantes y lugares. Mi gran observación es que la información que dan en la app no totalmente igual. Importante ver todos los comentarios de los sitios de la misma manera que en la web ( idiomas) para tener mejor referencia.","rating":3,"reviewer":"cesardepina","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3026886195","title":"Best travel app","comment":"I have been traveling for over 40 years. Not For work, but when I was much younger my parents lived in the Middle East and I was paid to visit them twice a year. Are used all the different travel well they were not apps, then but I went through all of them when they came out. I like this up the best because it is the best! It covers so much! I have been traveling a lot in United States. You get into a motel or hotel and hit nearby and you know where you can go to eat or buy certain things. This is just one of the many positive and wonderful things iPhone about Trip Advisor!","rating":5,"reviewer":"Patrickta","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3026633568","title":"Valiosa aplicación","comment":"Desde que viene la reseña por usuarios finales da una buena sensación de veracidad y autenticidad, trato de escribir lo que siento pero pocas veces lo hago de lugares donde me va regular, solo de los muy buenos y de los muy malos, de esos que hay que evitar o pareciera que ir es dinero tirado a la basura","rating":5,"reviewer":"RRBC","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3026609141","title":"Steven c Smith","comment":"Antlers at Vail\n\nGreat place. Views were to die for","rating":5,"reviewer":"Steven1944","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3026503015","title":"Must have","comment":"I always check trip adviser whenever I go anywhere even why am at home with in my hometown I want to see what others are saying about what I want to do. Trip advisor and the people who review places things and events tell it like it is and give me an honest appraisal of what I will see when I go somewhere.","rating":5,"reviewer":"WAC69","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3026340420","title":"Econolodge St. George SC","comment":"I recently stayed one nite here with my two dogs. \nI was very disappointed with the room. The room smelled so musty and was very run down. The bathroom floor tile was broken up and the toilet was leaning into the back wall. The air conditioner took hours to cool the room and was very loud. Also the room was not very clean. I thought of complaining to the nice lady at the desk, but after reading other bad reviews and the lateness of the hour, I reluctantly stayed. I will never use this hotel again. It needs a complete overhaul.","rating":1,"reviewer":"rylady","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3026109999","title":"Hampton inn, toledo north","comment":"Worst hotel ever.  From broken elevators to running out of food on the breakfast buffet by 7:30 am, from mildew on shower head to rude front desk man.  From dirty wet towels in the one working elevator to filthy hallways and public spaces.\nChoose a different hotel !","rating":1,"reviewer":"Didgusted","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3023265004","title":"Whale watching Juneau Alaska","comment":"We used Gastineau Guiding with Capt Dan and Shannon Malone. Small clean boat with 18 in the group. We saw six whales, a lot of sea lions and a bald eagle with good pictures. Great commentary from Shannon and Capt Dan knows the water. My wife really enjoyed the day! Excellent job all! Thanks","rating":5,"reviewer":"RWHIII and Ann","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3023253539","title":"Valuable Trip Planning Tool","comment":"I use Trip Advisor to help plan activities and meals for our road trips, or vacations with friends. I find it easy to use and it allows me to explore a new city or area for things to experience. After all, that may be why I am visiting. Good resource!","rating":5,"reviewer":"246810#","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3022867391","title":"Welcome to paradise!","comment":"Our stay at Issimo Suites Boutique was as Luxurious as it gets! This elegant ADULTS ONLY (PROGRESSIVE) Hotel did not disappoint. My wife and I had an amazingly breath taking view from our spacious  private  room with its large secluded balcony/patio. \n\nWe watched the sunset from our balcony and rose to the sweet sounds of the jungle’s natural music each morning. \n\nThe room offered all the amenities and comforts of home, and the beauty of paradise. The attention to detail lures you in as you enter your personal slice of peaceful elegance. The natural stone floor leading to the open shower and jacuzzi tub are stunning, flowing into a great room with a king bed, sitting area and a small bar area that looks out into the Pacific Cove. \n\nThe ocean and forrest/jungle views were to die for, and the adjacent pristine pool was a nice touch to the outdoor beauty.\n\nAt times, it felt like we were on set of Zootopia as we listened to a variety of birds singing in harmony with the howler monkeys. Each morning was just majestic as the next!  We loved watching the monkeys , (capuchin, squirrel and howler monkeys) run along the tree branches as they played with each other, and feet away, we witnessed two blue whales dance in the ocean.  Wow- unbelievable!\n\nOverall, Issimo was  a great place to relax, unwind, and enjoy all of the beauty that Manuel Antonio has to offer.  \n\nThe Location: Conveniently located near the beach (beautiful 5 minutes walk through the forest), National park, nice restaurants and shopping for souvenirs!  The hotel provides transportation free of charge to central drop spots , so this is a plus!\n\nThe Hotel: Top notched luxury! The concierge was highly attentive and accommodating. \n\nThe food: Bona-petite- fresh daily, NO complaints, only HAPPY/Satisfied tummies😊.   \n\nOverall, our experience was simply amazing! The hotel is beautiful and the entire staff were extremely helpful; especially with our transportation to shopping and excursion experiences. \n\nWe had NO complaints and WILL return because the tranquility, the progressive and inclusiveness this hotel offers is second to none. Without reservation, we highly recommended Issimo Suites! #ProgressiveStaff #UltraExclusive🌸 #EPICVIEWS!","rating":5,"reviewer":"Hoop girl","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3022811567","title":"Must have","comment":"This app is a must have when planning a trip whether it is simply dinner out or a special vacation. The app provides so much information and the ability to interact with others; photos, a vast history of reviews, maps, website access, etc.","rating":5,"reviewer":"Kolene223","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3022769656","title":"Fina at Beaumont inn& suites she takes care of the reservations and makes the breakfast taste","comment":"Fina is a employee  at Baymont inn& suits , she has 2 jobs that she does excellent  , She takes care of the reservations and makes the breakfast for the guests","rating":5,"reviewer":"beach -lover","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3022376566","title":"Excellent tour with Collin","comment":"I brought my 10 year old son and we had a blast!   Thanks Collin and Rick. Your knowledge of the show and locations were awesome.","rating":5,"reviewer":"Kleemans","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3022201644","title":"Used frequently","comment":"I review this app frequently to locate villages, hotels, holiday rentals, restaurants and sites to see, usually as much as a year in advance of a holiday to help plan an itinerary. I find the information extremely helpful. Of course, you must use your judgment and read between the lines of reviews to validate the app’s recommendations. But if you take the time to research using Google Street View and other websites you will find TripAdvisor helpful. We have not been disappointed (yet; fingers crossed).","rating":5,"reviewer":"LKilg","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3021853202","title":"Very helpful!","comment":"We use it often!","rating":5,"reviewer":"Whodat 1999","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3021564895","title":"Use TridAdvisor ALL the time","comment":"From RV campgrounds to restaurants to things to do, I always check this app. Always has tons of info. Fantastic resource.","rating":5,"reviewer":"Amy J. Shelton","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3021068562","title":"Go to app for travel","comment":"This is my go to app when traveling to find hotels and good eats.  We like eating at non-chain restaurants and trip advisor is helpful in finding the good ones.","rating":5,"reviewer":"Hrand","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3020899089","title":"Dusit D2 Hotel in Chiang Mai Thailand","comment":"Just got back from this hotel in Thailand and I would rate it excellent for is service, for it’s nice people, for his accommodations, and Pan at the front desk who took care of all my needs.          Joan W. from Naples Florida USA","rating":5,"reviewer":"Joan Margaret","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3020754079","title":"Love this app","comment":"So easy to search! Love this app!","rating":5,"reviewer":"Manjuberry","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3020629570","title":"WE ebike tour cable car and boat ride","comment":"Gaurav kalwani is a fantastic tour guide! It is the 2nd time that I do the tour with Gaurav and I would recommend him to everyone !!!! ⭐️⭐️⭐️⭐️","rating":5,"reviewer":"katia1006","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3019404625","title":"Insider tour Berlin","comment":"Went on famous walk. Very informative 4 hour walking tour of East Berlin. Covered all the main sites with a good historical perspective by guide Taylor. Certainly worth the money.","rating":5,"reviewer":"NJ Suzee","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3018700894","title":"Awesome","comment":"Trusted reviews I can count on.","rating":5,"reviewer":"Kayla24fan","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3018494297","title":"If you travel, this app is essential!","comment":"It’s my go-to before going to a new country. The breadth of the information you can find is sometimes quite astonishing.","rating":5,"reviewer":"GrandmasterTim","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3018404441","title":"May start using Yelp instead","comment":"Seems like all the interesting reviews are on yelp. It just really isn’t very fun and entertaining to use TripAdvisor for reviews.","rating":3,"reviewer":"MADMikeFM","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3017662922","title":"Best App to Find Food and Things to Do","comment":"I love the TripAdvisor app. It is my go-to app when traveling to lookup restaurants, hotels and things to do while traveling. \n\nFar less “emotional” than Yelp or other review sites, Trip Advisor offers accurate information for traveler.","rating":5,"reviewer":"iParks","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3017649831","title":"World of Knowledge","comment":"I have used TripAdvisor for at least four years all over Europe, Eastern Europe, Turkey and the United States of America and it has never disappointed for sourcing restaurants, hotels and places to see and things to do.....Great Job!","rating":5,"reviewer":"TShane82","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3017154696","title":"July 21,22 27 days stay at The plaza in Mestre","comment":"Very good 4 star hotel across from train station.\nNice room and good breakfast.    \nWill give a plus for the service and hospitality.\nWill recommend to friends and will come back next year.\nArriverderci","rating":4,"reviewer":"mlciabarra","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3013723684","title":"Use this app all the time","comment":"Love it,, it rarely lets me down 👍👍👍","rating":5,"reviewer":"Chefprov","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3013072061","title":"This app is no good","comment":"Tried several times to book a room for multiple days and keeps coming back with a one day set up.  Hard to get a multi day discount if it cant set up right . Id give it a quarter star if I could","rating":1,"reviewer":"killen time","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3011313183","title":"Trip advisor works great","comment":"I enjoy trip advisor because it allows me to share the good and bad experiences I’ve had, even if users don’t find it helpful at least I can look back at my reviews to remind myself what I do and don’t like","rating":4,"reviewer":"Noobsack","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3010807006","title":"Must Have Travel App","comment":"This is our go to app for figuring out what to do, where to eat, where to stay...for everywhere we go. Served us well both domestically and internationally. The BEST.","rating":5,"reviewer":"EJ Wasson","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3010068002","title":"Indispensable tool","comment":"First choice for travelers.","rating":5,"reviewer":"Neterch","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3008006369","title":"Boston in One Day Bus Tour","comment":"My mom and I came to Boston for a baby shower but came a couple of days early so we could see the sights. We booked the Boston in One Day Bus tour and we were definitely not disappointed. Our tour guide Sam who we affectionately call Sam I Am was amazing. He was knowledgeable, personable and made the tour a wonderful experience!! We recommend this tour highly and if you want to enjoy it as much as we did we suggest you request Sam I Am!!","rating":5,"reviewer":"Tiffany & Donna","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3007515479","title":"Love my Trip Advisor","comment":"I always use trip advisor when traveling for work or for play. Trip Advisor has not let me down!","rating":5,"reviewer":"JolaKell","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3006969712","title":"The app ruins the website","comment":"The app is fine but it limits the website experience — can’t bookmark stuff is a HUGE problem when traveling. Why does every website need an app? The app does nothing the website doesn’t do.  Just focus on your website and fire all the app people that ruin the experience of your site.","rating":1,"reviewer":"JEKDC","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3005363090","title":"Guide for Traveling","comment":"I use Trip Advisor in planning my travel agenda when traveling. \nThe reviews provide accurate information as to expected quality of the visit with restaurants and tourist attractions.","rating":5,"reviewer":"NanCoat Raymond","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3005344381","title":"My favorite app","comment":"I use TripAdvisor every time I want to find a new place to eat or a hotel. Reading the reviews help me make wise choices. I’m never disappointed. The reviews are right every time","rating":5,"reviewer":"Ipvb","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3004270114","title":"Go to when I got to go to app","comment":"Trip Advisor has been a trusted travel companion for many years. When planning a new adventure, Trip Advisor is, well, my trip advisor!","rating":5,"reviewer":"@keolalai","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3003093638","title":"We had an absolutely wonderful time","comment":"We couldn’t have asked for a better day today to go and see the Whale and Puffin watch! We had a blast!!","rating":5,"reviewer":"Sjhicks","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3001915526","title":"Disappointed","comment":"I used to be able to use this while traveling without a WI connection.  Now I can’t do anything without a WI connection.  It’s of no use to me any more.  Wish it still was.","rating":1,"reviewer":"Kdp43","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3001752046","title":"Love it","comment":"Use it every time we plan to travel somewhere in the world. Europe, Yellowstone, Texas, Oklahoma, now working on Hawaii!","rating":5,"reviewer":"No Klue","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"3000877448","title":"A traveler’s must","comment":"It is my first stop for travel planning.  As you read more reviews you will determine what you care about.  I once read a negative review of the hotel that spoke about how thin the stairs were.  Wasn’t a concern for me.","rating":5,"reviewer":"jimmy_j_jim","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2998592549","title":"OUTSTANDING","comment":"I don’t even think about planning a trip without checking what Trip Advisor has to say.  I have not been steered wrong yet.  \n\nFrom things to do, to hotels, to restaurants - LOVE the information I have found here.","rating":5,"reviewer":"pegwithpizazz","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2998437426","title":"Easy peezy!","comment":"I love this app because it’s so easy to write my reviews! It’s also easy to check out restaurants when I’m in a new town. I travel a good bit so it’s nice to get honest information about food and lodging. I don’t leave home without my trip advisor app!","rating":5,"reviewer":"Cdrcove1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2998155435","title":"Seattle Locks Tour","comment":"Took my family of five on 7/30 and thoroughly enjoyed. We went to Pikes Market, grabbed lunch and did the 3:45 tour. We bought tickets the night before online and we’re glad we did because it was sold out when we arrived.\nWe paid to park all day at the public lot across from pier 55 and we’re able to easily access Pikes Market AND the Locks Tour from that location. \nOur tour included a bus ride to the departure site and then we ended up back at pier 55. Make sure your ticket includes the bus/shuttle. Great experience!","rating":5,"reviewer":"AllyCara","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2997733192","title":"Too many tours mixed in with real information","comment":"I finally created Trip Advisor account for our Round the World Trip. When you click on Things to Do, it shows all tours rather than actual attractions. Irritating to be constantly shown guided tours rather than real attraction info.","rating":3,"reviewer":"smallBunny","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2997624754","title":"Good App","comment":"I like this app. Ive been using it a lot lately. I feel like I get honest opinions about places, hotels, restaurants and things to do.","rating":5,"reviewer":"can't fine one not used","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2996789646","title":"Saving our family vacation!","comment":"My husband and I take pride in finding great activities to keep our kids engaged and to enjoy in new places. We even argue about how best to spend our time, but trip advisor has the final day for us. Great app.","rating":5,"reviewer":"mommamaryjess","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2996726378","title":"Traveler? Go 4 TripAdvisor","comment":"Hello guys \nThanks for the best app for travelers all over the world \n\nWithout this app i couldn't take adventures like i do now \nI knew places i never heard off \nBelieve me i’m traveling for 3 years now and still this app manage my adventures and make it the best trips EVER \n\nand this app don't need a review or anything \nBecause believe every single person i met on my trip through Europe use it always \n\nSo new travelers..\nwhat are you waiting for ?? \nStop reading and start downloading...","rating":5,"reviewer":"Midoxlir","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2996688208","title":"I love this app😍","comment":"I use this app for every place I go. It’s great at allowing people to review their visits to places and give honest opinions. I am able to look at their experiences and judge for myself if people are being nit picky or if they are giving honest reviews of their experiences.","rating":5,"reviewer":"Naynay2123","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2996408944","title":"Great advice","comment":"This app is perfect for planning any trip! Hotel reviews are very good. Let’s you know what is nearby","rating":5,"reviewer":"mindyclark","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2996264208","title":"A travelers best friend!","comment":"A family member died which meant cleaning out a house that has been in the family since 1921.  Trip advisor was right there daily for 6 days as we tricked the contents across the US with a dog and 4 cats.  The filters pinpointed hotels that meet our needs.  This app made our adventure successful and comfortable.","rating":5,"reviewer":"Trucker Mac.","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2993737033","title":"Always use Tripadvisor","comment":"This app is my window to the world. I not only use it to know what to do but also to book tours. Our tour for Mount Fuji in Tokyo, Japan was a total success. From the moment I booked it online to the actual tour and check in etc everything was perfect and legit. I fully recommend TripAdvisor","rating":5,"reviewer":"2-12-10","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2992984043","title":"My Go-to dining app","comment":"I always go to Trip Advisor when checking out a new restaurant, hotel or vacation rental.  Their reviews are spot-on and I’ve never been disappointed!","rating":5,"reviewer":"NBRwhidbey","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2992792595","title":"PDcpreoolp. Ptp is mnppoppj","comment":"E lorn was \nMuup luvppjn","rating":5,"reviewer":"minlyyooym i","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2992438442","title":"Best Western, Opp, Alabama","comment":"Mrs. Bonita, manager, was very helpful in every way. The best ever! Would definitely stay again!","rating":5,"reviewer":"Southern nanna","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2990751947","title":"I can count on Trip Advisor","comment":"Great app. Information is very valuable.","rating":5,"reviewer":"RYGAR123","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2989624172","title":"The best road trip app!","comment":"I’ve used TripAdvisor off and on for years but it wasn’t until our 3-month road trip tour of the US that I realized what a valuable tool it has evolved into. Wherever we’re heading, I key in the city or major area in the search field and so much information appears! I feel like we really have a handle on the important go to sights which helps out in the planning process and making the best use of our time. And most importantly, we don’t drive away thinking we missed something really special because we know what we want to see and do before we even get there. It’s much easier having all the Things To Do pooled into one app with the opinions of other users right at your fingertips.","rating":5,"reviewer":"BZoned","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2989496360","title":"Very useful worldwide","comment":"I can’t say enough about this terrific. It brings worldwide travel information to you instantaneously. We use the app all of the time.","rating":5,"reviewer":"Budmanvet","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2989017315","title":"Coming and going!","comment":"We use the app to check out options for hotels and restaurants, and i track where we have been and perhaps what we ate. When talking to friends i can share details by referencing the app on my iPhone.  Only pet peeve is no “couple” category when out with my wife!","rating":4,"reviewer":"Nick's Knife","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2988935211","title":"Miss Charlotte","comment":"I have spent many wonderful nights at the Holiday Inn Airport Charlotte over the past 6 months.  I was so surprised to see Miss Charlotte back after a long illness.  She’s always so warm and friends and genuine.   So helpful with any housekeeping needs.  She is a stellar employee and I missed her greatly when she was out.  When stepped off the elevator last week and saw her I sooo happy.  Welcome back to one of the best employees at the Holiday Inn Airport Charlotte NC","rating":5,"reviewer":"SilverWings747","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2988925969","title":"Hilton Murfreesboro","comment":"I like the size of the room and our bed is very comfortable. They are not friendly and don’t go out of their way to make you feel welcomed. I was struggling to bring all my bags in and as they watched no one even offered help. No room service I understand if there is stuff on the bed they won’t make it but we didn’t even get new towels we had to ask them. The pool we enjoyed but would have enjoyed more had it been kept clean. I won’t be staying again. The rooms aren’t cheap and you shouldn’t have to ask to have new clean towels put in the room not to mention the rudeness.","rating":2,"reviewer":"stephanie Norwood","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2988867366","title":"Information You Can’t Get Elsewhere","comment":"Trip Advisor is my go-to when planning a trip. The information is comprehensive and the forums are where I go when I want practical information from experienced travelers.","rating":4,"reviewer":"DCtoSC","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2988833932","title":"Clumsy and hard to use app","comment":"I use TripAdvisor on my computer all the time and find it extremely helpful. However I hate using the app on my phone. It’s hard to navigate, difficult to find what I need. Look forward to future improvements because it’s a much needed app. I wish the website wouldn’t automatically re direct me to the app on my phone.","rating":1,"reviewer":"Zumi41","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2988625954","title":"I don’t go anywhere w/o TripAdvisor!","comment":"When traveling anywhere, I always use Trip Advisor.  Thank you to all the people who post their reviews.  It is incredibly helpful!","rating":5,"reviewer":"Snkcory","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2988616635","title":"Man Overboard Deep Sea Fishing","comment":"I chose Captain Rick to take my family on a fishing adventure. It couldn’t have been any better. He took us to several areas and we caught many different kinds of fish. He cleaned and bagged them for us when we returned. Captain Rick is located in Placida, Florida and he can be reached at 941-525-8155. Happy fishing !","rating":5,"reviewer":"Sue Gready","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2987480455","title":"Never leave home without it","comment":"We live and die by TripAdvisor!  Love the convenience of the app. Just traveled through Europe for almost one month and picked every hotel, restaurant and activity based in TripAdvisor reviews.","rating":5,"reviewer":"benson12","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2987169390","title":"Great App","comment":"I use Trip Advisor frequently for restaurants as well as travel information. I find the reviews to be a little higher than I might give, but knowing that, it’s a very helpful app.","rating":4,"reviewer":"Lily 2379","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2986254220","title":"Sidi abd elrahman El Alamein Matrouh","comment":"Wonderful place amazing stay helpful staff thank you 😍😍😍","rating":5,"reviewer":"marwa hosny","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2985574258","title":"Europe","comment":"Basing any decision in Europe on a TripAdvisor review is a recipe to be disappointed. I made this mistake and don’t want others go through the same travel pains.","rating":1,"reviewer":"HoustonTX13579","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2985279313","title":"Love this app!","comment":"I have been using this app for a long time now to research and review. Only on a very rare occasion has it not been accurate. It has helped me plan many vacations and saved a lot of heartache. My family gives me a hard time about it but at the end of the day they know we are going to the best places possible for our family. We have avoided countless let downs on our vacations because of a little research ahead of time.\nAll of that being said, I like to pay it forward to everyone else who is trying to do the same thing.\nThumbs up for TripAdvisor!","rating":5,"reviewer":"Coinroy67","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2985009841","title":"Useful to find the best attractions on your trips","comment":"The user reviews are the best! I spend a lot of time on the road scouting places for photography workshops, the reviews by users on the site help me chose attractions that are worthwhile and the others to skip. I like that I can save things I’d like to see by location, when I am there I just pull up the TripAdvisor app, and I can scroll through all the activities I saved. Select a place, tap on the address and you get directions to the location. Also, the forums are an excellent place to find out info on a specific location, for example hurricane damage, etc.","rating":5,"reviewer":"Photographer on the Go!","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2984495392","title":"Great Electronics Sales Associate Olivia G.","comment":"One of the reasons I like shopping at Unclaimed Baggage is the superior value of electronics.  I have been helped twice by Olivia G. who is always courteous, exceptionally knowledgeable, and professional.  Olivia G. answered my numerous questions about an iPhone and fitness monitor during my visits to Unclaimed Baggage.  Sales Associates like Olivia G. make shopping at Unclaimed Baggage \neven more fun.","rating":5,"reviewer":"colstanley","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2984461878","title":"Love this App!!","comment":"One of the apps I love the most!  Great for planning a vacation and to search for restaurants!!","rating":5,"reviewer":"Lizzy Liz98","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2984378139","title":"Won’t let you do multi-city trips","comment":"I have been trying to arrange a multi city trip. However, the app will not let me do it. Worse, the TripAdvisor main website defaults me back to the app. I will now delete the app and see if I can make do with the internet site from my iPad. Very irritating.","rating":2,"reviewer":"Revwado","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2984348298","title":"Constant use","comment":"This is an update of my review reflected below.  We constantly use this when we travel and for restaurants in our home area.  We still think this app is very good and easy to use.  One of the keys is that  we find the latest places are included .  However one of my pet peeves is still there.   Reviews no matter how old. Are still reflected.  A review over 12-15 months  old does not seem to be current enough to matter.   Things  change, people leave, corrections are made .\n\nWe use this in our travels primarily for restaurants and  places to stay.  Glad we see the good bad and ugly.  However reviews should be purged after 12-15 months to keep out the old ratings.  Have seen reviews going back to 2008 which makes no sense due to being relevant\nThis has been my review for couple years.  Need to purge old reviews as they have zero meaning as out of date. Today actually saw a review for 2007","rating":4,"reviewer":"Emahiserj","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2984021902","title":"Honesty","comment":"I recommend that TA create loyalty badge with discount , as a trusted contributor I would like to see expanding in the badges.","rating":4,"reviewer":"Juneinborn","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2983708511","title":"Service is slow, but food is worth to wait","comment":"Took a while to get food on the table. However, the food is very good. Worth to wait","rating":4,"reviewer":"iAteYuhrCrayons","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2983601420","title":"George Strait Tribute","comment":"One of the top three I enjoyed of 12 viewed.\nAn Excellent Tribute with above average performance in singing, customer interaction and historical info about George including some live action films. We will go see Gordy & Debbie anytime we have an opportunity!  👏🏻👏🏻👏🏻👏🏻\n\nDan & Dina 😎👧🏻\nTexas 🇺🇸🇨🇱","rating":5,"reviewer":"danl7000","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2983329917","title":"Management Center Fixes","comment":"The app and mobile version need help. Can’t access the menu in management center as it goes off the screen. Photos don’t upload properly and it seems to be lacking options to edit and change information fluently.","rating":2,"reviewer":"I'm DISappointed 15","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2980132220","title":"geographically challenged","comment":"Cannot locate the city of Dubrovnik, Croatia, a UNESCO site\nTherefore unable to create personal timeline","rating":1,"reviewer":"ctr75","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2979847010","title":"Go To Travel App","comment":"Every time I prepare to take a trip, the first thing I do is consult trip advisor. The app makes it easy. This last trip, I downloaded the city guide to my phone and didn’t need to even worry about phone service/web connection. I don’t think I’d take a trip without consulting Trip Advisor. I think it’s better than any travel guide. I love to read the reviews of other users. The app. Get it. Use it. Have fun.","rating":5,"reviewer":"agirlandheryarn","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2978971617","title":"Opinions from actual visitors!","comment":"Very useful on our recent visit to Vietnam! How else would we have known about that out of the way restaurant or to avoid this tourist trap? We used Trip Advisor to get addresses and hours of operation. We also used the app while in Vietnam when we couldn’t find a grocery store. We received answers right away!!","rating":5,"reviewer":"LeeandJP","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2978900258","title":"Former Grand Hyatt in Chile YIKES! There is NO MANDARIN ORIENTAL !!!!","comment":"Travelers should know NOT to consider staying at the now announced Mandarin Oriental Hotel !\nThe fictitiously give the impression that they are The Mandarin Oriental . \nCouldn’t be further from the truth! When you arrive you realize the whole hotel is under massive renovation! Hotel is completely outdated and now called Hotel Santiago!  Avoid!!!!","rating":5,"reviewer":"corangelo1","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2978779920","title":"Help with trip/food planning","comment":"My hubby and I enjoy riding our motorcycle. We usually try to look up some place different to eat and head that way. This app helps. Thank you.","rating":5,"reviewer":"CherryPower63","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2978677285","title":"Useful App and sounding page","comment":"I enjoy contributing to Trip Advisor and like getting feedback from vendors.   Most of the time I’m able to write positive reviews but once in awhile have a negative report to share.   I use Trip Advisor a resource for new locations and will likely start booking my trips thru them.    I have seen the Trip Advisor logo all over the world and know it is an important part of marketing their business.","rating":4,"reviewer":"Djpayerle","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2975419518","title":"Great fun on eBikes.","comment":"Great fun!  Jonathon, our guide, was very informative and knowledgeable about the flora and fauna in the area. He said he talks to much, but that is why we are lucky to find and hire guides like him. I would rather hear more than less, just me.","rating":5,"reviewer":"zdwt04","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2974662253","title":"This is the app I always use when traveling.","comment":"Trip Advisor has been reliable, accurate and easy to use resource  on many of our family trips. On several occasions it guided us to amazing places of interest that we had no idea about. I love using this app.","rating":5,"reviewer":"Pyteshestvennik","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2974341024","title":"Wonderful Travel Tool","comment":"Love Trip Advisor .We use it for all of our trips and it is extremely helpful with  every aspect of a trip -activities ,hotels,restaurants,and transportation. A must use tool for every trip . 😎","rating":5,"reviewer":"MSD22","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2972927490","title":"SJS","comment":"We visited the Houmas House plantation in New Orleans and thoroughly enjoyed seeing the beautiful gardens and the plantation itself. While our docent, Michelle, was knowledgeable about the history of the house, we did not enjoy her personal stories. We were there to hear about Houmas House. She did do her best to keep her pleasant composure and continue talking during the screaming and yelling of another family’s two small children who were with us on the tour.","rating":3,"reviewer":"visiting from Texas","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"},{"app":"TripAdvisor","id":"2971521724","title":"Trip Advisor Is The Best","comment":"We use this app all the time and it delivers exactly what we need to plan our trips and outings. We provide honest written feedback on every business we use to help other patrons with their choices.","rating":5,"reviewer":"RandyS-FL","fee":"free","date":"NA","version":"114.2","data source":"npm app-store-scraper"}]